#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_StopMontagePlayDate

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimNotifyState_StopMontagePlayDate.AnimNotifyState_StopMontagePlayDate_C.Received_NotifyTick
// 0x0058 (0x0058 - 0x0000)
struct AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortnite_M_Avg_Player_AnimBlueprint_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHighTower_Date_LayerAnimBP_C*          K2Node_DynamicCast_AsHigh_Tower_Date_Layer_Anim_BP; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick) == 0x000008, "Wrong alignment on AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick");
static_assert(sizeof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick) == 0x000058, "Wrong size on AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, Animation) == 0x000008, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, ReturnValue) == 0x000014, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, K2Node_DynamicCast_AsAnim_Montage) == 0x000018, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue) == 0x000030, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint) == 0x000038, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, K2Node_DynamicCast_AsHigh_Tower_Date_Layer_Anim_BP) == 0x000048, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::K2Node_DynamicCast_AsHigh_Tower_Date_Layer_Anim_BP' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick, CallFunc_BooleanOR_ReturnValue) == 0x000051, "Member 'AnimNotifyState_StopMontagePlayDate_C_Received_NotifyTick::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

