#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ApplyMedkit_Athena_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ApplyMedkit_Athena_AnimBP.ApplyMedkit_Athena_AnimBP_C
// 0x0310 (0x0600 - 0x02F0)
class UApplyMedkit_Athena_AnimBP_C final : public UFortItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0300(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0330(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0378(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x03F0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x04A0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0568(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x05B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x05D8(0x0028)()

public:
	void ExecuteUbergraph_ApplyMedkit_Athena_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ApplyMedkit_Athena_AnimBP_C">();
	}
	static class UApplyMedkit_Athena_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApplyMedkit_Athena_AnimBP_C>();
	}
};
static_assert(alignof(UApplyMedkit_Athena_AnimBP_C) == 0x000010, "Wrong alignment on UApplyMedkit_Athena_AnimBP_C");
static_assert(sizeof(UApplyMedkit_Athena_AnimBP_C) == 0x000600, "Wrong size on UApplyMedkit_Athena_AnimBP_C");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, UberGraphFrame) == 0x0002F0, "Member 'UApplyMedkit_Athena_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0002F8, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_Root) == 0x000300, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_Slot_1) == 0x000330, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000378, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x0003F0, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0004A0, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_Slot) == 0x000568, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0005B0, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UApplyMedkit_Athena_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0005D8, "Member 'UApplyMedkit_Athena_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

