#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArgonUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "ArgonRuntime_structs.hpp"
#include "ArgonUI_structs.hpp"


namespace SDK
{

// Class ArgonUI.ArgonWidgetBase
// 0x0008 (0x0320 - 0x0318)
class UArgonWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Argon*               ArgonMutator;                                      // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BindToMutator_BP();
	void UnbindFromMutator_BP();

	TArray<class AFortPlayerStateAthena*> GetTeamPlayerStates(uint8 Team) const;
	void SetPlayerPortrait(class AFortPlayerStateAthena* Player, class UFortLazyImage* PortraitImage) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArgonWidgetBase">();
	}
	static class UArgonWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArgonWidgetBase>();
	}
};
static_assert(alignof(UArgonWidgetBase) == 0x000008, "Wrong alignment on UArgonWidgetBase");
static_assert(sizeof(UArgonWidgetBase) == 0x000320, "Wrong size on UArgonWidgetBase");
static_assert(offsetof(UArgonWidgetBase, ArgonMutator) == 0x000318, "Member 'UArgonWidgetBase::ArgonMutator' has a wrong offset!");

// Class ArgonUI.ArgonHUDAlertWidget
// 0x0020 (0x0340 - 0x0320)
class UArgonHUDAlertWidget final : public UArgonWidgetBase
{
public:
	float                                         DisplayPlayerFinishedMessageTime;                  // 0x0320(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FArgonFinishedPlayerInfo>       PlayerFinishedMessageQueue;                        // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisplayPlayerFinishedMessage(const struct FArgonFinishedPlayerInfo& FinishedInfo);
	void ForceHidePlayerFinishedMessage();
	void OnPlayerFinished(const struct FArgonFinishedPlayerInfo& FinishedPlayerInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArgonHUDAlertWidget">();
	}
	static class UArgonHUDAlertWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArgonHUDAlertWidget>();
	}
};
static_assert(alignof(UArgonHUDAlertWidget) == 0x000008, "Wrong alignment on UArgonHUDAlertWidget");
static_assert(sizeof(UArgonHUDAlertWidget) == 0x000340, "Wrong size on UArgonHUDAlertWidget");
static_assert(offsetof(UArgonHUDAlertWidget, DisplayPlayerFinishedMessageTime) == 0x000320, "Member 'UArgonHUDAlertWidget::DisplayPlayerFinishedMessageTime' has a wrong offset!");
static_assert(offsetof(UArgonHUDAlertWidget, PlayerFinishedMessageQueue) == 0x000328, "Member 'UArgonHUDAlertWidget::PlayerFinishedMessageQueue' has a wrong offset!");

// Class ArgonUI.ArgonLeaderboardWidget
// 0x0010 (0x0330 - 0x0320)
class UArgonLeaderboardWidget final : public UArgonWidgetBase
{
public:
	TArray<struct FArgonLeaderboardData>          LeaderboardEntries;                                // 0x0320(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAnyTeamTicketCountChanged();
	void OnRacingPlayersByPlaceChanged();
	void UpdateLeaderboardUI();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArgonLeaderboardWidget">();
	}
	static class UArgonLeaderboardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArgonLeaderboardWidget>();
	}
};
static_assert(alignof(UArgonLeaderboardWidget) == 0x000008, "Wrong alignment on UArgonLeaderboardWidget");
static_assert(sizeof(UArgonLeaderboardWidget) == 0x000330, "Wrong size on UArgonLeaderboardWidget");
static_assert(offsetof(UArgonLeaderboardWidget, LeaderboardEntries) == 0x000320, "Member 'UArgonLeaderboardWidget::LeaderboardEntries' has a wrong offset!");

}

