#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicRuntime

#include "Basic.hpp"

#include "ArsenicRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ArsenicRuntime.FortCheatManager_Arsenic.SetInfectedDamageToBuildingPercent
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Arsenic_SetInfectedDamageToBuildingPercent final
{
public:
	float                                         DamagePercent;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_Arsenic_SetInfectedDamageToBuildingPercent) == 0x000004, "Wrong alignment on FortCheatManager_Arsenic_SetInfectedDamageToBuildingPercent");
static_assert(sizeof(FortCheatManager_Arsenic_SetInfectedDamageToBuildingPercent) == 0x000004, "Wrong size on FortCheatManager_Arsenic_SetInfectedDamageToBuildingPercent");
static_assert(offsetof(FortCheatManager_Arsenic_SetInfectedDamageToBuildingPercent, DamagePercent) == 0x000000, "Member 'FortCheatManager_Arsenic_SetInfectedDamageToBuildingPercent::DamagePercent' has a wrong offset!");

// Function ArsenicRuntime.FortCheatManager_Arsenic.SetInfectedDamageToStructuralBuildingPercent
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Arsenic_SetInfectedDamageToStructuralBuildingPercent final
{
public:
	float                                         DamagePercent;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_Arsenic_SetInfectedDamageToStructuralBuildingPercent) == 0x000004, "Wrong alignment on FortCheatManager_Arsenic_SetInfectedDamageToStructuralBuildingPercent");
static_assert(sizeof(FortCheatManager_Arsenic_SetInfectedDamageToStructuralBuildingPercent) == 0x000004, "Wrong size on FortCheatManager_Arsenic_SetInfectedDamageToStructuralBuildingPercent");
static_assert(offsetof(FortCheatManager_Arsenic_SetInfectedDamageToStructuralBuildingPercent, DamagePercent) == 0x000000, "Member 'FortCheatManager_Arsenic_SetInfectedDamageToStructuralBuildingPercent::DamagePercent' has a wrong offset!");

// Function ArsenicRuntime.FortCheatManager_Arsenic.SetMatchTime
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_Arsenic_SetMatchTime final
{
public:
	float                                         NewTime;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_Arsenic_SetMatchTime) == 0x000004, "Wrong alignment on FortCheatManager_Arsenic_SetMatchTime");
static_assert(sizeof(FortCheatManager_Arsenic_SetMatchTime) == 0x000004, "Wrong size on FortCheatManager_Arsenic_SetMatchTime");
static_assert(offsetof(FortCheatManager_Arsenic_SetMatchTime, NewTime) == 0x000000, "Member 'FortCheatManager_Arsenic_SetMatchTime::NewTime' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.EndGame
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Arsenic_EndGame final
{
public:
	uint8                                         WinningTeam;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_EndGame) == 0x000001, "Wrong alignment on FortAthenaMutator_Arsenic_EndGame");
static_assert(sizeof(FortAthenaMutator_Arsenic_EndGame) == 0x000001, "Wrong size on FortAthenaMutator_Arsenic_EndGame");
static_assert(offsetof(FortAthenaMutator_Arsenic_EndGame, WinningTeam) == 0x000000, "Member 'FortAthenaMutator_Arsenic_EndGame::WinningTeam' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.GetTeamPlayerCount
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Arsenic_GetTeamPlayerCount final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_GetTeamPlayerCount) == 0x000004, "Wrong alignment on FortAthenaMutator_Arsenic_GetTeamPlayerCount");
static_assert(sizeof(FortAthenaMutator_Arsenic_GetTeamPlayerCount) == 0x000008, "Wrong size on FortAthenaMutator_Arsenic_GetTeamPlayerCount");
static_assert(offsetof(FortAthenaMutator_Arsenic_GetTeamPlayerCount, Team) == 0x000000, "Member 'FortAthenaMutator_Arsenic_GetTeamPlayerCount::Team' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_Arsenic_GetTeamPlayerCount, ReturnValue) == 0x000004, "Member 'FortAthenaMutator_Arsenic_GetTeamPlayerCount::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaMutator_Arsenic_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContainerTags;                             // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_OnCurrentPlaylistLoaded) == 0x000008, "Wrong alignment on FortAthenaMutator_Arsenic_OnCurrentPlaylistLoaded");
static_assert(sizeof(FortAthenaMutator_Arsenic_OnCurrentPlaylistLoaded) == 0x000028, "Wrong size on FortAthenaMutator_Arsenic_OnCurrentPlaylistLoaded");
static_assert(offsetof(FortAthenaMutator_Arsenic_OnCurrentPlaylistLoaded, PlaylistName) == 0x000000, "Member 'FortAthenaMutator_Arsenic_OnCurrentPlaylistLoaded::PlaylistName' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_Arsenic_OnCurrentPlaylistLoaded, PlaylistContainerTags) == 0x000008, "Member 'FortAthenaMutator_Arsenic_OnCurrentPlaylistLoaded::PlaylistContainerTags' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.RefreshPlayerIndicators
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Arsenic_RefreshPlayerIndicators final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_RefreshPlayerIndicators) == 0x000008, "Wrong alignment on FortAthenaMutator_Arsenic_RefreshPlayerIndicators");
static_assert(sizeof(FortAthenaMutator_Arsenic_RefreshPlayerIndicators) == 0x000008, "Wrong size on FortAthenaMutator_Arsenic_RefreshPlayerIndicators");
static_assert(offsetof(FortAthenaMutator_Arsenic_RefreshPlayerIndicators, PlayerState) == 0x000000, "Member 'FortAthenaMutator_Arsenic_RefreshPlayerIndicators::PlayerState' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.GetTimeRemaining
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Arsenic_GetTimeRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_GetTimeRemaining) == 0x000004, "Wrong alignment on FortAthenaMutator_Arsenic_GetTimeRemaining");
static_assert(sizeof(FortAthenaMutator_Arsenic_GetTimeRemaining) == 0x000004, "Wrong size on FortAthenaMutator_Arsenic_GetTimeRemaining");
static_assert(offsetof(FortAthenaMutator_Arsenic_GetTimeRemaining, ReturnValue) == 0x000000, "Member 'FortAthenaMutator_Arsenic_GetTimeRemaining::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.GetWinner
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Arsenic_GetWinner final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_GetWinner) == 0x000008, "Wrong alignment on FortAthenaMutator_Arsenic_GetWinner");
static_assert(sizeof(FortAthenaMutator_Arsenic_GetWinner) == 0x000010, "Wrong size on FortAthenaMutator_Arsenic_GetWinner");
static_assert(offsetof(FortAthenaMutator_Arsenic_GetWinner, ReturnValue) == 0x000000, "Member 'FortAthenaMutator_Arsenic_GetWinner::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.IsGrowlEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Arsenic_IsGrowlEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_IsGrowlEnabled) == 0x000001, "Wrong alignment on FortAthenaMutator_Arsenic_IsGrowlEnabled");
static_assert(sizeof(FortAthenaMutator_Arsenic_IsGrowlEnabled) == 0x000001, "Wrong size on FortAthenaMutator_Arsenic_IsGrowlEnabled");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsGrowlEnabled, ReturnValue) == 0x000000, "Member 'FortAthenaMutator_Arsenic_IsGrowlEnabled::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.IsHealOverTimeEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Arsenic_IsHealOverTimeEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_IsHealOverTimeEnabled) == 0x000001, "Wrong alignment on FortAthenaMutator_Arsenic_IsHealOverTimeEnabled");
static_assert(sizeof(FortAthenaMutator_Arsenic_IsHealOverTimeEnabled) == 0x000001, "Wrong size on FortAthenaMutator_Arsenic_IsHealOverTimeEnabled");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsHealOverTimeEnabled, ReturnValue) == 0x000000, "Member 'FortAthenaMutator_Arsenic_IsHealOverTimeEnabled::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.IsHeartbeatEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Arsenic_IsHeartbeatEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_IsHeartbeatEnabled) == 0x000001, "Wrong alignment on FortAthenaMutator_Arsenic_IsHeartbeatEnabled");
static_assert(sizeof(FortAthenaMutator_Arsenic_IsHeartbeatEnabled) == 0x000001, "Wrong size on FortAthenaMutator_Arsenic_IsHeartbeatEnabled");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsHeartbeatEnabled, ReturnValue) == 0x000000, "Member 'FortAthenaMutator_Arsenic_IsHeartbeatEnabled::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.IsPawnAnInfected
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Arsenic_IsPawnAnInfected final
{
public:
	const class AFortPawn*                        Pawn;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaMutator_Arsenic_IsPawnAnInfected) == 0x000008, "Wrong alignment on FortAthenaMutator_Arsenic_IsPawnAnInfected");
static_assert(sizeof(FortAthenaMutator_Arsenic_IsPawnAnInfected) == 0x000010, "Wrong size on FortAthenaMutator_Arsenic_IsPawnAnInfected");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsPawnAnInfected, Pawn) == 0x000000, "Member 'FortAthenaMutator_Arsenic_IsPawnAnInfected::Pawn' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsPawnAnInfected, ReturnValue) == 0x000008, "Member 'FortAthenaMutator_Arsenic_IsPawnAnInfected::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.IsPlayerARevealedInfected
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Arsenic_IsPlayerARevealedInfected final
{
public:
	const class AFortPlayerController*            PC;                                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaMutator_Arsenic_IsPlayerARevealedInfected) == 0x000008, "Wrong alignment on FortAthenaMutator_Arsenic_IsPlayerARevealedInfected");
static_assert(sizeof(FortAthenaMutator_Arsenic_IsPlayerARevealedInfected) == 0x000010, "Wrong size on FortAthenaMutator_Arsenic_IsPlayerARevealedInfected");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsPlayerARevealedInfected, PC) == 0x000000, "Member 'FortAthenaMutator_Arsenic_IsPlayerARevealedInfected::PC' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsPlayerARevealedInfected, ReturnValue) == 0x000008, "Member 'FortAthenaMutator_Arsenic_IsPlayerARevealedInfected::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.IsPlayerTeamRevealed
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Arsenic_IsPlayerTeamRevealed final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortAthenaMutator_Arsenic_IsPlayerTeamRevealed) == 0x000008, "Wrong alignment on FortAthenaMutator_Arsenic_IsPlayerTeamRevealed");
static_assert(sizeof(FortAthenaMutator_Arsenic_IsPlayerTeamRevealed) == 0x000010, "Wrong size on FortAthenaMutator_Arsenic_IsPlayerTeamRevealed");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsPlayerTeamRevealed, PlayerState) == 0x000000, "Member 'FortAthenaMutator_Arsenic_IsPlayerTeamRevealed::PlayerState' has a wrong offset!");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsPlayerTeamRevealed, ReturnValue) == 0x000008, "Member 'FortAthenaMutator_Arsenic_IsPlayerTeamRevealed::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.IsPlaylistDBNOEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Arsenic_IsPlaylistDBNOEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_IsPlaylistDBNOEnabled) == 0x000001, "Wrong alignment on FortAthenaMutator_Arsenic_IsPlaylistDBNOEnabled");
static_assert(sizeof(FortAthenaMutator_Arsenic_IsPlaylistDBNOEnabled) == 0x000001, "Wrong size on FortAthenaMutator_Arsenic_IsPlaylistDBNOEnabled");
static_assert(offsetof(FortAthenaMutator_Arsenic_IsPlaylistDBNOEnabled, ReturnValue) == 0x000000, "Member 'FortAthenaMutator_Arsenic_IsPlaylistDBNOEnabled::ReturnValue' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.RequestGameMessageOnClient
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Arsenic_RequestGameMessageOnClient final
{
public:
	EArsenicGameMsgId                             MsgId;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_RequestGameMessageOnClient) == 0x000001, "Wrong alignment on FortAthenaMutator_Arsenic_RequestGameMessageOnClient");
static_assert(sizeof(FortAthenaMutator_Arsenic_RequestGameMessageOnClient) == 0x000001, "Wrong size on FortAthenaMutator_Arsenic_RequestGameMessageOnClient");
static_assert(offsetof(FortAthenaMutator_Arsenic_RequestGameMessageOnClient, MsgId) == 0x000000, "Member 'FortAthenaMutator_Arsenic_RequestGameMessageOnClient::MsgId' has a wrong offset!");

// Function ArsenicRuntime.FortAthenaMutator_Arsenic.RequestGameMessageOnServer
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Arsenic_RequestGameMessageOnServer final
{
public:
	EArsenicGameMsgId                             MsgId;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMutator_Arsenic_RequestGameMessageOnServer) == 0x000001, "Wrong alignment on FortAthenaMutator_Arsenic_RequestGameMessageOnServer");
static_assert(sizeof(FortAthenaMutator_Arsenic_RequestGameMessageOnServer) == 0x000001, "Wrong size on FortAthenaMutator_Arsenic_RequestGameMessageOnServer");
static_assert(offsetof(FortAthenaMutator_Arsenic_RequestGameMessageOnServer, MsgId) == 0x000000, "Member 'FortAthenaMutator_Arsenic_RequestGameMessageOnServer::MsgId' has a wrong offset!");

// Function ArsenicRuntime.FortChargingSet_Arsenic_Hurl.OnRep_CurrentCharge
// 0x0028 (0x0028 - 0x0000)
struct FortChargingSet_Arsenic_Hurl_OnRep_CurrentCharge final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortChargingSet_Arsenic_Hurl_OnRep_CurrentCharge) == 0x000008, "Wrong alignment on FortChargingSet_Arsenic_Hurl_OnRep_CurrentCharge");
static_assert(sizeof(FortChargingSet_Arsenic_Hurl_OnRep_CurrentCharge) == 0x000028, "Wrong size on FortChargingSet_Arsenic_Hurl_OnRep_CurrentCharge");
static_assert(offsetof(FortChargingSet_Arsenic_Hurl_OnRep_CurrentCharge, OldValue) == 0x000000, "Member 'FortChargingSet_Arsenic_Hurl_OnRep_CurrentCharge::OldValue' has a wrong offset!");

// Function ArsenicRuntime.FortChargingSet_Arsenic_Scream.OnRep_CurrentCharge
// 0x0028 (0x0028 - 0x0000)
struct FortChargingSet_Arsenic_Scream_OnRep_CurrentCharge final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortChargingSet_Arsenic_Scream_OnRep_CurrentCharge) == 0x000008, "Wrong alignment on FortChargingSet_Arsenic_Scream_OnRep_CurrentCharge");
static_assert(sizeof(FortChargingSet_Arsenic_Scream_OnRep_CurrentCharge) == 0x000028, "Wrong size on FortChargingSet_Arsenic_Scream_OnRep_CurrentCharge");
static_assert(offsetof(FortChargingSet_Arsenic_Scream_OnRep_CurrentCharge, OldValue) == 0x000000, "Member 'FortChargingSet_Arsenic_Scream_OnRep_CurrentCharge::OldValue' has a wrong offset!");

// Function ArsenicRuntime.FortChargingSet_Arsenic_Sniff.OnRep_CurrentCharge
// 0x0028 (0x0028 - 0x0000)
struct FortChargingSet_Arsenic_Sniff_OnRep_CurrentCharge final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortChargingSet_Arsenic_Sniff_OnRep_CurrentCharge) == 0x000008, "Wrong alignment on FortChargingSet_Arsenic_Sniff_OnRep_CurrentCharge");
static_assert(sizeof(FortChargingSet_Arsenic_Sniff_OnRep_CurrentCharge) == 0x000028, "Wrong size on FortChargingSet_Arsenic_Sniff_OnRep_CurrentCharge");
static_assert(offsetof(FortChargingSet_Arsenic_Sniff_OnRep_CurrentCharge, OldValue) == 0x000000, "Member 'FortChargingSet_Arsenic_Sniff_OnRep_CurrentCharge::OldValue' has a wrong offset!");

}

