#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ArsenicRuntime_structs.hpp"


namespace SDK
{

// Class ArsenicRuntime.FortCheatManager_Arsenic
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_Arsenic final : public UFortCheatManager_Coupled
{
public:
	void SetInfectedDamageToBuildingPercent(float DamagePercent);
	void SetInfectedDamageToStructuralBuildingPercent(float DamagePercent);
	void SetMatchTime(float NewTime);
	void ToggleDBNOEnabled();
	void ToggleGrowlEnabled();
	void ToggleHealOverTimeEnabled();
	void ToggleHeartbeatEnabled();
	void ToggleInfectedModifiedDamageEnabled();
	void ToggleWinConditionEnabled();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_Arsenic">();
	}
	static class UFortCheatManager_Arsenic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Arsenic>();
	}
};
static_assert(alignof(UFortCheatManager_Arsenic) == 0x000008, "Wrong alignment on UFortCheatManager_Arsenic");
static_assert(sizeof(UFortCheatManager_Arsenic) == 0x000038, "Wrong size on UFortCheatManager_Arsenic");

// Class ArsenicRuntime.FortAthenaMutator_Arsenic
// 0x0400 (0x0780 - 0x0380)
class AFortAthenaMutator_Arsenic final : public AFortAthenaMutator_GameModeBase
{
public:
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AFortPlayerStateAthena* PlayerState)> OnPlayerTeamRevealedDelegate; // 0x0388(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScalableFloat                         InitialInfectedPct;                                // 0x0398(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InfectedDamageToBuildingPercent;                   // 0x03B8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InfectedDamageToStructuralBuildingPercent;         // 0x03D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FString                                 Winner;                                            // 0x03F8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGameTimeExpired;                                  // 0x0408(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             HumanDeathSound;                                   // 0x0410(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EArsenicGameMsgId, struct FAthenaGameMessageData> GameMsgs_Infected;                        // 0x0418(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<EArsenicGameMsgId, struct FAthenaGameMessageData> GameMsgs_Human;                           // 0x0468(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinInitialVehicleFuelPercent;                      // 0x04C0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxInitialVehicleFuelPercent;                      // 0x04E0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         HumanTeam;                                         // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         InfectedTeam;                                      // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_502[0x6];                                      // 0x0502(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagTeamInfoArray                      TagTeamInfo;                                       // 0x0508(0x0118)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FArsenicPlayerDataArray                PlayerDataArray;                                   // 0x0620(0x0120)(Net, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_740[0x8];                                      // 0x0740(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bInfectedConsumePickups;                           // 0x0748(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortAthenaMutator_ConsumePickups*      ConsumePickupsMutator;                             // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaMutator_ArsenicInventoryOverride* CachedInventoryOverrideMutator;               // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_778[0x1];                                      // 0x0778(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCheatHeartbeatEnabled;                            // 0x0779(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_77A[0x6];                                      // 0x077A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndGame(uint8 WinningTeam);
	int32 GetTeamPlayerCount(uint8 Team);
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContainerTags);
	void RefreshPlayerIndicators(class AFortPlayerStateAthena* PlayerState);

	float GetTimeRemaining() const;
	class FString GetWinner() const;
	bool IsGrowlEnabled() const;
	bool IsHealOverTimeEnabled() const;
	bool IsHeartbeatEnabled() const;
	bool IsPawnAnInfected(const class AFortPawn* Pawn) const;
	bool IsPlayerARevealedInfected(const class AFortPlayerController* PC) const;
	bool IsPlayerTeamRevealed(const class AFortPlayerStateAthena* PlayerState) const;
	bool IsPlaylistDBNOEnabled() const;
	void RequestGameMessageOnClient(EArsenicGameMsgId MsgId) const;
	void RequestGameMessageOnServer(EArsenicGameMsgId MsgId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Arsenic">();
	}
	static class AFortAthenaMutator_Arsenic* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Arsenic>();
	}
};
static_assert(alignof(AFortAthenaMutator_Arsenic) == 0x000008, "Wrong alignment on AFortAthenaMutator_Arsenic");
static_assert(sizeof(AFortAthenaMutator_Arsenic) == 0x000780, "Wrong size on AFortAthenaMutator_Arsenic");
static_assert(offsetof(AFortAthenaMutator_Arsenic, OnPlayerTeamRevealedDelegate) == 0x000388, "Member 'AFortAthenaMutator_Arsenic::OnPlayerTeamRevealedDelegate' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, InitialInfectedPct) == 0x000398, "Member 'AFortAthenaMutator_Arsenic::InitialInfectedPct' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, InfectedDamageToBuildingPercent) == 0x0003B8, "Member 'AFortAthenaMutator_Arsenic::InfectedDamageToBuildingPercent' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, InfectedDamageToStructuralBuildingPercent) == 0x0003D8, "Member 'AFortAthenaMutator_Arsenic::InfectedDamageToStructuralBuildingPercent' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, Winner) == 0x0003F8, "Member 'AFortAthenaMutator_Arsenic::Winner' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, bGameTimeExpired) == 0x000408, "Member 'AFortAthenaMutator_Arsenic::bGameTimeExpired' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, HumanDeathSound) == 0x000410, "Member 'AFortAthenaMutator_Arsenic::HumanDeathSound' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, GameMsgs_Infected) == 0x000418, "Member 'AFortAthenaMutator_Arsenic::GameMsgs_Infected' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, GameMsgs_Human) == 0x000468, "Member 'AFortAthenaMutator_Arsenic::GameMsgs_Human' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, MinInitialVehicleFuelPercent) == 0x0004C0, "Member 'AFortAthenaMutator_Arsenic::MinInitialVehicleFuelPercent' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, MaxInitialVehicleFuelPercent) == 0x0004E0, "Member 'AFortAthenaMutator_Arsenic::MaxInitialVehicleFuelPercent' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, HumanTeam) == 0x000500, "Member 'AFortAthenaMutator_Arsenic::HumanTeam' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, InfectedTeam) == 0x000501, "Member 'AFortAthenaMutator_Arsenic::InfectedTeam' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, TagTeamInfo) == 0x000508, "Member 'AFortAthenaMutator_Arsenic::TagTeamInfo' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, PlayerDataArray) == 0x000620, "Member 'AFortAthenaMutator_Arsenic::PlayerDataArray' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, bInfectedConsumePickups) == 0x000748, "Member 'AFortAthenaMutator_Arsenic::bInfectedConsumePickups' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, ConsumePickupsMutator) == 0x000768, "Member 'AFortAthenaMutator_Arsenic::ConsumePickupsMutator' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, CachedInventoryOverrideMutator) == 0x000770, "Member 'AFortAthenaMutator_Arsenic::CachedInventoryOverrideMutator' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Arsenic, bCheatHeartbeatEnabled) == 0x000779, "Member 'AFortAthenaMutator_Arsenic::bCheatHeartbeatEnabled' has a wrong offset!");

// Class ArsenicRuntime.FortAthenaMutator_ArsenicRespawn
// 0x0190 (0x0400 - 0x0270)
class AFortAthenaMutator_ArsenicRespawn final : public AFortAthenaMutator
{
public:
	bool                                          bRespawnAwayFromDeathLocation;                     // 0x0270(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDistanceFromDeath;                          // 0x0274(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaximumDistanceFromDeath;                          // 0x0278(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRespawnLogicData_Teams            RespawnSettings;                                   // 0x0280(0x0180)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_ArsenicRespawn">();
	}
	static class AFortAthenaMutator_ArsenicRespawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_ArsenicRespawn>();
	}
};
static_assert(alignof(AFortAthenaMutator_ArsenicRespawn) == 0x000008, "Wrong alignment on AFortAthenaMutator_ArsenicRespawn");
static_assert(sizeof(AFortAthenaMutator_ArsenicRespawn) == 0x000400, "Wrong size on AFortAthenaMutator_ArsenicRespawn");
static_assert(offsetof(AFortAthenaMutator_ArsenicRespawn, bRespawnAwayFromDeathLocation) == 0x000270, "Member 'AFortAthenaMutator_ArsenicRespawn::bRespawnAwayFromDeathLocation' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicRespawn, MinimumDistanceFromDeath) == 0x000274, "Member 'AFortAthenaMutator_ArsenicRespawn::MinimumDistanceFromDeath' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicRespawn, MaximumDistanceFromDeath) == 0x000278, "Member 'AFortAthenaMutator_ArsenicRespawn::MaximumDistanceFromDeath' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicRespawn, RespawnSettings) == 0x000280, "Member 'AFortAthenaMutator_ArsenicRespawn::RespawnSettings' has a wrong offset!");

// Class ArsenicRuntime.FortChargingSet_Arsenic_Hurl
// 0x00A0 (0x00E8 - 0x0048)
class UFortChargingSet_Arsenic_Hurl final : public UFortChargingSet_Base
{
public:
	struct FFortGameplayAttributeData             CurrentCharge;                                     // 0x0048(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             MaxCharge;                                         // 0x0070(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ChargeTime;                                        // 0x0098(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ServerTimeChargeIncrements;                        // 0x00C0(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_CurrentCharge(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortChargingSet_Arsenic_Hurl">();
	}
	static class UFortChargingSet_Arsenic_Hurl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortChargingSet_Arsenic_Hurl>();
	}
};
static_assert(alignof(UFortChargingSet_Arsenic_Hurl) == 0x000008, "Wrong alignment on UFortChargingSet_Arsenic_Hurl");
static_assert(sizeof(UFortChargingSet_Arsenic_Hurl) == 0x0000E8, "Wrong size on UFortChargingSet_Arsenic_Hurl");
static_assert(offsetof(UFortChargingSet_Arsenic_Hurl, CurrentCharge) == 0x000048, "Member 'UFortChargingSet_Arsenic_Hurl::CurrentCharge' has a wrong offset!");
static_assert(offsetof(UFortChargingSet_Arsenic_Hurl, MaxCharge) == 0x000070, "Member 'UFortChargingSet_Arsenic_Hurl::MaxCharge' has a wrong offset!");
static_assert(offsetof(UFortChargingSet_Arsenic_Hurl, ChargeTime) == 0x000098, "Member 'UFortChargingSet_Arsenic_Hurl::ChargeTime' has a wrong offset!");
static_assert(offsetof(UFortChargingSet_Arsenic_Hurl, ServerTimeChargeIncrements) == 0x0000C0, "Member 'UFortChargingSet_Arsenic_Hurl::ServerTimeChargeIncrements' has a wrong offset!");

// Class ArsenicRuntime.FortChargingSet_Arsenic_Scream
// 0x00A0 (0x00E8 - 0x0048)
class UFortChargingSet_Arsenic_Scream final : public UFortChargingSet_Base
{
public:
	struct FFortGameplayAttributeData             CurrentCharge;                                     // 0x0048(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             MaxCharge;                                         // 0x0070(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ChargeTime;                                        // 0x0098(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ServerTimeChargeIncrements;                        // 0x00C0(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_CurrentCharge(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortChargingSet_Arsenic_Scream">();
	}
	static class UFortChargingSet_Arsenic_Scream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortChargingSet_Arsenic_Scream>();
	}
};
static_assert(alignof(UFortChargingSet_Arsenic_Scream) == 0x000008, "Wrong alignment on UFortChargingSet_Arsenic_Scream");
static_assert(sizeof(UFortChargingSet_Arsenic_Scream) == 0x0000E8, "Wrong size on UFortChargingSet_Arsenic_Scream");
static_assert(offsetof(UFortChargingSet_Arsenic_Scream, CurrentCharge) == 0x000048, "Member 'UFortChargingSet_Arsenic_Scream::CurrentCharge' has a wrong offset!");
static_assert(offsetof(UFortChargingSet_Arsenic_Scream, MaxCharge) == 0x000070, "Member 'UFortChargingSet_Arsenic_Scream::MaxCharge' has a wrong offset!");
static_assert(offsetof(UFortChargingSet_Arsenic_Scream, ChargeTime) == 0x000098, "Member 'UFortChargingSet_Arsenic_Scream::ChargeTime' has a wrong offset!");
static_assert(offsetof(UFortChargingSet_Arsenic_Scream, ServerTimeChargeIncrements) == 0x0000C0, "Member 'UFortChargingSet_Arsenic_Scream::ServerTimeChargeIncrements' has a wrong offset!");

// Class ArsenicRuntime.FortChargingSet_Arsenic_Sniff
// 0x00A0 (0x00E8 - 0x0048)
class UFortChargingSet_Arsenic_Sniff final : public UFortChargingSet_Base
{
public:
	struct FFortGameplayAttributeData             CurrentCharge;                                     // 0x0048(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             MaxCharge;                                         // 0x0070(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ChargeTime;                                        // 0x0098(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ServerTimeChargeIncrements;                        // 0x00C0(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_CurrentCharge(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortChargingSet_Arsenic_Sniff">();
	}
	static class UFortChargingSet_Arsenic_Sniff* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortChargingSet_Arsenic_Sniff>();
	}
};
static_assert(alignof(UFortChargingSet_Arsenic_Sniff) == 0x000008, "Wrong alignment on UFortChargingSet_Arsenic_Sniff");
static_assert(sizeof(UFortChargingSet_Arsenic_Sniff) == 0x0000E8, "Wrong size on UFortChargingSet_Arsenic_Sniff");
static_assert(offsetof(UFortChargingSet_Arsenic_Sniff, CurrentCharge) == 0x000048, "Member 'UFortChargingSet_Arsenic_Sniff::CurrentCharge' has a wrong offset!");
static_assert(offsetof(UFortChargingSet_Arsenic_Sniff, MaxCharge) == 0x000070, "Member 'UFortChargingSet_Arsenic_Sniff::MaxCharge' has a wrong offset!");
static_assert(offsetof(UFortChargingSet_Arsenic_Sniff, ChargeTime) == 0x000098, "Member 'UFortChargingSet_Arsenic_Sniff::ChargeTime' has a wrong offset!");
static_assert(offsetof(UFortChargingSet_Arsenic_Sniff, ServerTimeChargeIncrements) == 0x0000C0, "Member 'UFortChargingSet_Arsenic_Sniff::ServerTimeChargeIncrements' has a wrong offset!");

}

