#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function ArsenicUI.ArsenicWidgetBase.OnPlayerTeamRevealed
// 0x0008 (0x0008 - 0x0000)
struct ArsenicWidgetBase_OnPlayerTeamRevealed final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArsenicWidgetBase_OnPlayerTeamRevealed) == 0x000008, "Wrong alignment on ArsenicWidgetBase_OnPlayerTeamRevealed");
static_assert(sizeof(ArsenicWidgetBase_OnPlayerTeamRevealed) == 0x000008, "Wrong size on ArsenicWidgetBase_OnPlayerTeamRevealed");
static_assert(offsetof(ArsenicWidgetBase_OnPlayerTeamRevealed, PlayerState) == 0x000000, "Member 'ArsenicWidgetBase_OnPlayerTeamRevealed::PlayerState' has a wrong offset!");

// Function ArsenicUI.ArsenicWidgetBase.GetArsenicMutator
// 0x0008 (0x0008 - 0x0000)
struct ArsenicWidgetBase_GetArsenicMutator final
{
public:
	class AFortAthenaMutator_Arsenic*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArsenicWidgetBase_GetArsenicMutator) == 0x000008, "Wrong alignment on ArsenicWidgetBase_GetArsenicMutator");
static_assert(sizeof(ArsenicWidgetBase_GetArsenicMutator) == 0x000008, "Wrong size on ArsenicWidgetBase_GetArsenicMutator");
static_assert(offsetof(ArsenicWidgetBase_GetArsenicMutator, ReturnValue) == 0x000000, "Member 'ArsenicWidgetBase_GetArsenicMutator::ReturnValue' has a wrong offset!");

}

