#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicCoreRuntime

#include "Basic.hpp"


namespace SDK
{

// Enum ArsenicCoreRuntime.EArsenicCorePlayerStatus
// NumValues: 0x0006
enum class EArsenicCorePlayerStatus : uint8
{
	None                                     = 0,
	Human                                    = 1,
	Transforming_HumanToGhost                = 2,
	Ghost                                    = 3,
	EliminatedGhost                          = 4,
	MAX                                      = 5,
};

// Enum ArsenicCoreRuntime.EConsumePickupsDropOnDeathFilterRule_Definitive
// NumValues: 0x0003
enum class EConsumePickupsDropOnDeathFilterRule_Definitive : uint8
{
	DiscardNewestItem                        = 0,
	DiscardOldestItem                        = 1,
	EConsumePickupsDropOnDeathFilterRule_MAX = 2,
};

// Enum ArsenicCoreRuntime.EConsumePickupsDropOnDeathFilterRule
// NumValues: 0x0003
enum class EConsumePickupsDropOnDeathFilterRule : uint8
{
	DiscardLowestRarityItem                  = 0,
	DiscardHighestRarityItem                 = 1,
	EConsumePickupsDropOnDeathFilterRule_MAX = 2,
};

// ScriptStruct ArsenicCoreRuntime.ArsenicCoreSquadMemberPlayerStatus
// 0x0010 (0x0010 - 0x0000)
struct FArsenicCoreSquadMemberPlayerStatus final
{
public:
	class AFortPlayerStateAthena*                 SquadMemberPlayerState;                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      SquadMemberPlayerStatus;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FArsenicCoreSquadMemberPlayerStatus) == 0x000008, "Wrong alignment on FArsenicCoreSquadMemberPlayerStatus");
static_assert(sizeof(FArsenicCoreSquadMemberPlayerStatus) == 0x000010, "Wrong size on FArsenicCoreSquadMemberPlayerStatus");
static_assert(offsetof(FArsenicCoreSquadMemberPlayerStatus, SquadMemberPlayerState) == 0x000000, "Member 'FArsenicCoreSquadMemberPlayerStatus::SquadMemberPlayerState' has a wrong offset!");
static_assert(offsetof(FArsenicCoreSquadMemberPlayerStatus, SquadMemberPlayerStatus) == 0x000008, "Member 'FArsenicCoreSquadMemberPlayerStatus::SquadMemberPlayerStatus' has a wrong offset!");

// ScriptStruct ArsenicCoreRuntime.ArsenicCorePopulationGridCellData
// 0x0004 (0x0004 - 0x0000)
struct FArsenicCorePopulationGridCellData final
{
public:
	uint8                                         NumGhostPlayers;                                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumGhostBots;                                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumHumanPlayers;                                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumHumanBots;                                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FArsenicCorePopulationGridCellData) == 0x000001, "Wrong alignment on FArsenicCorePopulationGridCellData");
static_assert(sizeof(FArsenicCorePopulationGridCellData) == 0x000004, "Wrong size on FArsenicCorePopulationGridCellData");
static_assert(offsetof(FArsenicCorePopulationGridCellData, NumGhostPlayers) == 0x000000, "Member 'FArsenicCorePopulationGridCellData::NumGhostPlayers' has a wrong offset!");
static_assert(offsetof(FArsenicCorePopulationGridCellData, NumGhostBots) == 0x000001, "Member 'FArsenicCorePopulationGridCellData::NumGhostBots' has a wrong offset!");
static_assert(offsetof(FArsenicCorePopulationGridCellData, NumHumanPlayers) == 0x000002, "Member 'FArsenicCorePopulationGridCellData::NumHumanPlayers' has a wrong offset!");
static_assert(offsetof(FArsenicCorePopulationGridCellData, NumHumanBots) == 0x000003, "Member 'FArsenicCorePopulationGridCellData::NumHumanBots' has a wrong offset!");

// ScriptStruct ArsenicCoreRuntime.ArsenicCoreHumanPawnData
// 0x0010 (0x0010 - 0x0000)
struct FArsenicCoreHumanPawnData final
{
public:
	class AFortPlayerPawnAthena*                  Pawn;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FArsenicCoreHumanPawnData) == 0x000008, "Wrong alignment on FArsenicCoreHumanPawnData");
static_assert(sizeof(FArsenicCoreHumanPawnData) == 0x000010, "Wrong size on FArsenicCoreHumanPawnData");
static_assert(offsetof(FArsenicCoreHumanPawnData, Pawn) == 0x000000, "Member 'FArsenicCoreHumanPawnData::Pawn' has a wrong offset!");
static_assert(offsetof(FArsenicCoreHumanPawnData, PlayerState) == 0x000008, "Member 'FArsenicCoreHumanPawnData::PlayerState' has a wrong offset!");

}

