#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicCoreRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "ArsenicCoreRuntime_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ArsenicCoreRuntime.FortAthenaAIBotEvaluator_Dash_ArsenicCore
// 0x00A8 (0x0138 - 0x0090)
class UFortAthenaAIBotEvaluator_Dash_ArsenicCore final : public UFortAthenaAIBotEvaluator
{
public:
	class FName                                   DashExecutionStatusName;                           // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x4];                                       // 0x0098(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetActorName;                                   // 0x009C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WeaponTriggerMeleeName;                            // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinimumTimeAfterPreviousDashToAttemptNewDash;      // 0x00B8(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaximumTimeAfterPreviousDashToAttemptNewDash;      // 0x00D8(0x0020)(Edit, NativeAccessSpecifierPrivate)
	TArray<EFortBuildingType>                     DashableBuildingTypes;                             // 0x00F8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           DashAbilityCooldownTag;                            // 0x0108(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DashDistanceMagnitude;                             // 0x0110(0x0020)(Edit, NativeAccessSpecifierPrivate)
	float                                         MinAcceptableMoveDirFacingDotProductValue;         // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_Dash_ArsenicCore">();
	}
	static class UFortAthenaAIBotEvaluator_Dash_ArsenicCore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_Dash_ArsenicCore>();
	}
};
static_assert(alignof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore) == 0x000008, "Wrong alignment on UFortAthenaAIBotEvaluator_Dash_ArsenicCore");
static_assert(sizeof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore) == 0x000138, "Wrong size on UFortAthenaAIBotEvaluator_Dash_ArsenicCore");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore, DashExecutionStatusName) == 0x000090, "Member 'UFortAthenaAIBotEvaluator_Dash_ArsenicCore::DashExecutionStatusName' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore, TargetActorName) == 0x00009C, "Member 'UFortAthenaAIBotEvaluator_Dash_ArsenicCore::TargetActorName' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore, WeaponTriggerMeleeName) == 0x0000A8, "Member 'UFortAthenaAIBotEvaluator_Dash_ArsenicCore::WeaponTriggerMeleeName' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore, MinimumTimeAfterPreviousDashToAttemptNewDash) == 0x0000B8, "Member 'UFortAthenaAIBotEvaluator_Dash_ArsenicCore::MinimumTimeAfterPreviousDashToAttemptNewDash' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore, MaximumTimeAfterPreviousDashToAttemptNewDash) == 0x0000D8, "Member 'UFortAthenaAIBotEvaluator_Dash_ArsenicCore::MaximumTimeAfterPreviousDashToAttemptNewDash' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore, DashableBuildingTypes) == 0x0000F8, "Member 'UFortAthenaAIBotEvaluator_Dash_ArsenicCore::DashableBuildingTypes' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore, DashAbilityCooldownTag) == 0x000108, "Member 'UFortAthenaAIBotEvaluator_Dash_ArsenicCore::DashAbilityCooldownTag' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore, DashDistanceMagnitude) == 0x000110, "Member 'UFortAthenaAIBotEvaluator_Dash_ArsenicCore::DashDistanceMagnitude' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Dash_ArsenicCore, MinAcceptableMoveDirFacingDotProductValue) == 0x000130, "Member 'UFortAthenaAIBotEvaluator_Dash_ArsenicCore::MinAcceptableMoveDirFacingDotProductValue' has a wrong offset!");

// Class ArsenicCoreRuntime.ArsenicCoreGCNGhostAudioHelperComponent
// 0x0040 (0x00F0 - 0x00B0)
class UArsenicCoreGCNGhostAudioHelperComponent final : public UActorComponent
{
public:
	float                                         VelocityAudioInputRange_Min;                       // 0x00B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VelocityAudioInputRange_Max;                       // 0x00B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AudioInterpSpeed;                                  // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              VelocitySoundMix;                                  // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VelocityThresholdForMixModActivation;              // 0x00C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AudioScalarParameterName;                          // 0x00CC(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x1C];                                      // 0x00D4(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PopVelocitySoundMix();
	void SetLoopingAudioComponent(class UAudioComponent* InLoopingAudioComponent);
	void SetTargetPawn(class APawn* InTargetPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArsenicCoreGCNGhostAudioHelperComponent">();
	}
	static class UArsenicCoreGCNGhostAudioHelperComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArsenicCoreGCNGhostAudioHelperComponent>();
	}
};
static_assert(alignof(UArsenicCoreGCNGhostAudioHelperComponent) == 0x000008, "Wrong alignment on UArsenicCoreGCNGhostAudioHelperComponent");
static_assert(sizeof(UArsenicCoreGCNGhostAudioHelperComponent) == 0x0000F0, "Wrong size on UArsenicCoreGCNGhostAudioHelperComponent");
static_assert(offsetof(UArsenicCoreGCNGhostAudioHelperComponent, VelocityAudioInputRange_Min) == 0x0000B0, "Member 'UArsenicCoreGCNGhostAudioHelperComponent::VelocityAudioInputRange_Min' has a wrong offset!");
static_assert(offsetof(UArsenicCoreGCNGhostAudioHelperComponent, VelocityAudioInputRange_Max) == 0x0000B4, "Member 'UArsenicCoreGCNGhostAudioHelperComponent::VelocityAudioInputRange_Max' has a wrong offset!");
static_assert(offsetof(UArsenicCoreGCNGhostAudioHelperComponent, AudioInterpSpeed) == 0x0000B8, "Member 'UArsenicCoreGCNGhostAudioHelperComponent::AudioInterpSpeed' has a wrong offset!");
static_assert(offsetof(UArsenicCoreGCNGhostAudioHelperComponent, VelocitySoundMix) == 0x0000C0, "Member 'UArsenicCoreGCNGhostAudioHelperComponent::VelocitySoundMix' has a wrong offset!");
static_assert(offsetof(UArsenicCoreGCNGhostAudioHelperComponent, VelocityThresholdForMixModActivation) == 0x0000C8, "Member 'UArsenicCoreGCNGhostAudioHelperComponent::VelocityThresholdForMixModActivation' has a wrong offset!");
static_assert(offsetof(UArsenicCoreGCNGhostAudioHelperComponent, AudioScalarParameterName) == 0x0000CC, "Member 'UArsenicCoreGCNGhostAudioHelperComponent::AudioScalarParameterName' has a wrong offset!");

// Class ArsenicCoreRuntime.ArsenicCorePlayerComponent
// 0x00A8 (0x0158 - 0x00B0)
class UArsenicCorePlayerComponent final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(const bool bIsVisible)> OnGhostVisibilityChange;                   // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnGhostScreamFoundNoSurvivors;                     // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const bool bIsInVehicle)> OnLocalGhostPlayerEnteredOrExitedVehicle; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AFortPlayerStateAthena* PlayerState, EArsenicCorePlayerStatus PlayerStatus)> ArsenicOnPlayerStatusChange; // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AFortPlayerStateAthena* PlayerState, EArsenicCorePlayerStatus PlayerStatus)> ArsenicOnPlayerSquadMemberStatusChanged; // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortAthenaMutator_ArsenicCore*         ManagingMutator;                                   // 0x0100(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  HideWhileLoadingGameplayTagContainer;              // 0x0110(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AArsenicCoreRespawnDrone*               LocalRespawnDrone;                                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EArsenicCorePlayerStatus                      CurrentPlayerStatus;                               // 0x0140(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         ScreamFoundNoSurvivors;                            // 0x0141(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FArsenicCoreSquadMemberPlayerStatus> SquadMemberPlayerStatuses;                    // 0x0148(0x0010)(Net, ZeroConstructor, Transient, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void GhostScreamFoundNoSurvivors();
	void OnRep_CurrentPlayerStatus();
	void OnRep_ManagingMutator();
	void OnRep_ScreamFoundNoSurvivors();
	void OnRep_SquadMemberPlayerStatuses(const TArray<struct FArsenicCoreSquadMemberPlayerStatus>& OldValue);
	void ServerClientIsReadyToSpawnAsGhost();
	void SetSquadMemberArsenicCorePlayerStatus(const class AFortPlayerStateAthena* PlayerState, EArsenicCorePlayerStatus NewPlayerStatus);
	void UpdateGhostVisibilityChange(const bool bIsVisibile);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArsenicCorePlayerComponent">();
	}
	static class UArsenicCorePlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArsenicCorePlayerComponent>();
	}
};
static_assert(alignof(UArsenicCorePlayerComponent) == 0x000008, "Wrong alignment on UArsenicCorePlayerComponent");
static_assert(sizeof(UArsenicCorePlayerComponent) == 0x000158, "Wrong size on UArsenicCorePlayerComponent");
static_assert(offsetof(UArsenicCorePlayerComponent, OnGhostVisibilityChange) == 0x0000B0, "Member 'UArsenicCorePlayerComponent::OnGhostVisibilityChange' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, OnGhostScreamFoundNoSurvivors) == 0x0000C0, "Member 'UArsenicCorePlayerComponent::OnGhostScreamFoundNoSurvivors' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, OnLocalGhostPlayerEnteredOrExitedVehicle) == 0x0000D0, "Member 'UArsenicCorePlayerComponent::OnLocalGhostPlayerEnteredOrExitedVehicle' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, ArsenicOnPlayerStatusChange) == 0x0000E0, "Member 'UArsenicCorePlayerComponent::ArsenicOnPlayerStatusChange' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, ArsenicOnPlayerSquadMemberStatusChanged) == 0x0000F0, "Member 'UArsenicCorePlayerComponent::ArsenicOnPlayerSquadMemberStatusChanged' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, ManagingMutator) == 0x000100, "Member 'UArsenicCorePlayerComponent::ManagingMutator' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, HideWhileLoadingGameplayTagContainer) == 0x000110, "Member 'UArsenicCorePlayerComponent::HideWhileLoadingGameplayTagContainer' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, LocalRespawnDrone) == 0x000138, "Member 'UArsenicCorePlayerComponent::LocalRespawnDrone' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, CurrentPlayerStatus) == 0x000140, "Member 'UArsenicCorePlayerComponent::CurrentPlayerStatus' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, ScreamFoundNoSurvivors) == 0x000141, "Member 'UArsenicCorePlayerComponent::ScreamFoundNoSurvivors' has a wrong offset!");
static_assert(offsetof(UArsenicCorePlayerComponent, SquadMemberPlayerStatuses) == 0x000148, "Member 'UArsenicCorePlayerComponent::SquadMemberPlayerStatuses' has a wrong offset!");

// Class ArsenicCoreRuntime.ArsenicCorePopulationTracker
// 0x0048 (0x0268 - 0x0220)
class AArsenicCorePopulationTracker final : public AActor
{
public:
	class AFortAthenaMutator_ArsenicCore*         ArsenicCoreMutator;                                // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortPoiGridInfo                       PopulationGridInfo;                                // 0x0228(0x0028)(Net, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FArsenicCorePopulationGridCellData> PopulationGrid;                                // 0x0250(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_260[0x8];                                      // 0x0260(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGameMemberRemoved(uint8 InSquadId, uint8 InTeamIndex, class AFortPlayerStateAthena* ChangedPS);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArsenicCorePopulationTracker">();
	}
	static class AArsenicCorePopulationTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArsenicCorePopulationTracker>();
	}
};
static_assert(alignof(AArsenicCorePopulationTracker) == 0x000008, "Wrong alignment on AArsenicCorePopulationTracker");
static_assert(sizeof(AArsenicCorePopulationTracker) == 0x000268, "Wrong size on AArsenicCorePopulationTracker");
static_assert(offsetof(AArsenicCorePopulationTracker, ArsenicCoreMutator) == 0x000220, "Member 'AArsenicCorePopulationTracker::ArsenicCoreMutator' has a wrong offset!");
static_assert(offsetof(AArsenicCorePopulationTracker, PopulationGridInfo) == 0x000228, "Member 'AArsenicCorePopulationTracker::PopulationGridInfo' has a wrong offset!");
static_assert(offsetof(AArsenicCorePopulationTracker, PopulationGrid) == 0x000250, "Member 'AArsenicCorePopulationTracker::PopulationGrid' has a wrong offset!");

// Class ArsenicCoreRuntime.FortAthenaAIBotEvaluator_Loot_ArsenicCore
// 0x0198 (0x04A8 - 0x0310)
class UFortAthenaAIBotEvaluator_Loot_ArsenicCore final : public UFortAthenaAIBotEvaluator_Loot
{
public:
	struct FScalableFloat                         CommonRarityLootScore;                             // 0x0310(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         UncommonRarityLootScore;                           // 0x0330(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RareRarityLootScore;                               // 0x0350(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LegendaryRarityLootScore;                          // 0x0370(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MythicRarityLootScore;                             // 0x0390(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TranscendentRarityLootScore;                       // 0x03B0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EFortRarity                                   MinRarityToLootWhenAboveLootConsumeHealth;         // 0x03D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BatchLootBlacklistDuration;                        // 0x03D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BatchLootBlacklistRadius;                          // 0x03F8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         LootConsumeHealthPercentThreshold;                 // 0x0418(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlacklistedLootTags;                               // 0x0438(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_458[0x50];                                     // 0x0458(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_Loot_ArsenicCore">();
	}
	static class UFortAthenaAIBotEvaluator_Loot_ArsenicCore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_Loot_ArsenicCore>();
	}
};
static_assert(alignof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore) == 0x000008, "Wrong alignment on UFortAthenaAIBotEvaluator_Loot_ArsenicCore");
static_assert(sizeof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore) == 0x0004A8, "Wrong size on UFortAthenaAIBotEvaluator_Loot_ArsenicCore");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, CommonRarityLootScore) == 0x000310, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::CommonRarityLootScore' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, UncommonRarityLootScore) == 0x000330, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::UncommonRarityLootScore' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, RareRarityLootScore) == 0x000350, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::RareRarityLootScore' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, LegendaryRarityLootScore) == 0x000370, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::LegendaryRarityLootScore' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, MythicRarityLootScore) == 0x000390, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::MythicRarityLootScore' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, TranscendentRarityLootScore) == 0x0003B0, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::TranscendentRarityLootScore' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, MinRarityToLootWhenAboveLootConsumeHealth) == 0x0003D0, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::MinRarityToLootWhenAboveLootConsumeHealth' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, BatchLootBlacklistDuration) == 0x0003D8, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::BatchLootBlacklistDuration' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, BatchLootBlacklistRadius) == 0x0003F8, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::BatchLootBlacklistRadius' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, LootConsumeHealthPercentThreshold) == 0x000418, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::LootConsumeHealthPercentThreshold' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_Loot_ArsenicCore, BlacklistedLootTags) == 0x000438, "Member 'UFortAthenaAIBotEvaluator_Loot_ArsenicCore::BlacklistedLootTags' has a wrong offset!");

// Class ArsenicCoreRuntime.ArsenicCoreRespawnDrone
// 0x0000 (0x0220 - 0x0220)
class AArsenicCoreRespawnDrone final : public AActor
{
public:
	void BeginGhostTransitionSequence(class AFortPlayerPawnAthena* PlayerPawn, class UArsenicCorePlayerComponent* ArsenicCorePlayerComponent, const struct FVector& RespawnLocation);

	class ACameraActor* GetCamera() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArsenicCoreRespawnDrone">();
	}
	static class AArsenicCoreRespawnDrone* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArsenicCoreRespawnDrone>();
	}
};
static_assert(alignof(AArsenicCoreRespawnDrone) == 0x000008, "Wrong alignment on AArsenicCoreRespawnDrone");
static_assert(sizeof(AArsenicCoreRespawnDrone) == 0x000220, "Wrong size on AArsenicCoreRespawnDrone");

// Class ArsenicCoreRuntime.FortCheatManager_ArsenicInterface
// 0x0010 (0x0048 - 0x0038)
class UFortCheatManager_ArsenicInterface final : public UFortCheatManager_Coupled
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ArsenicCoreConvertLookAtPawnToGhost();
	void ArsenicCoreConvertLookAtPawnToHuman();
	void ArsenicCoreConvertToGhost();
	void ArsenicCoreConvertToHuman();
	void ArsenicCoreKillAllGhosts();
	void ArsenicCoreKillAllNonGhosts();
	void ArsenicCoreLogPopulationGridData();
	void ArsenicCoreSetPopulationGridRedValue(int32 RedValue);
	void ArsenicCoreSpawnScriptedPawn(const class FString& ProfileName);
	void ArsenicCoreToggleDrawPopulationGridOnMap();
	void ArsenicCoreToggleHighlightAllBots();
	void TickHightlightAllBots();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_ArsenicInterface">();
	}
	static class UFortCheatManager_ArsenicInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_ArsenicInterface>();
	}
};
static_assert(alignof(UFortCheatManager_ArsenicInterface) == 0x000008, "Wrong alignment on UFortCheatManager_ArsenicInterface");
static_assert(sizeof(UFortCheatManager_ArsenicInterface) == 0x000048, "Wrong size on UFortCheatManager_ArsenicInterface");

// Class ArsenicCoreRuntime.ArsenicGameModeMutatorInterface
// 0x0000 (0x0000 - 0x0000)
class IArsenicGameModeMutatorInterface final
{
public:
	void BroadcastArsenicOnPlayerStatusChange(const class AFortPlayerStateAthena* PlayerState, EArsenicCorePlayerStatus PlayerStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArsenicGameModeMutatorInterface">();
	}
	static class IArsenicGameModeMutatorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IArsenicGameModeMutatorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IArsenicGameModeMutatorInterface) == 0x000001, "Wrong alignment on IArsenicGameModeMutatorInterface");
static_assert(sizeof(IArsenicGameModeMutatorInterface) == 0x000001, "Wrong size on IArsenicGameModeMutatorInterface");

// Class ArsenicCoreRuntime.FortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore
// 0x0010 (0x01D0 - 0x01C0)
class UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore final : public UFortAthenaAIBotEvaluator_MeleeAttack
{
public:
	float                                         MaxDistanceToEngageMeleeDefensive;                 // 0x01C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DashExecutionStatusName;                           // 0x01C4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore">();
	}
	static class UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore>();
	}
};
static_assert(alignof(UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore) == 0x000008, "Wrong alignment on UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore");
static_assert(sizeof(UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore) == 0x0001D0, "Wrong size on UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore");
static_assert(offsetof(UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore, MaxDistanceToEngageMeleeDefensive) == 0x0001C0, "Member 'UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore::MaxDistanceToEngageMeleeDefensive' has a wrong offset!");
static_assert(offsetof(UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore, DashExecutionStatusName) == 0x0001C4, "Member 'UFortAthenaAIBotEvaluator_MeleeAttack_ArsenicCore::DashExecutionStatusName' has a wrong offset!");

// Class ArsenicCoreRuntime.FortAthenaBTService_Dash_ArsenicCore
// 0x0030 (0x00A0 - 0x0070)
class UFortAthenaBTService_Dash_ArsenicCore final : public UBTService
{
public:
	class FName                                   DashExecutionStatusName;                           // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DashAbilityTagContainer;                           // 0x0080(0x0020)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaBTService_Dash_ArsenicCore">();
	}
	static class UFortAthenaBTService_Dash_ArsenicCore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaBTService_Dash_ArsenicCore>();
	}
};
static_assert(alignof(UFortAthenaBTService_Dash_ArsenicCore) == 0x000008, "Wrong alignment on UFortAthenaBTService_Dash_ArsenicCore");
static_assert(sizeof(UFortAthenaBTService_Dash_ArsenicCore) == 0x0000A0, "Wrong size on UFortAthenaBTService_Dash_ArsenicCore");
static_assert(offsetof(UFortAthenaBTService_Dash_ArsenicCore, DashExecutionStatusName) == 0x000070, "Member 'UFortAthenaBTService_Dash_ArsenicCore::DashExecutionStatusName' has a wrong offset!");
static_assert(offsetof(UFortAthenaBTService_Dash_ArsenicCore, DashAbilityTagContainer) == 0x000080, "Member 'UFortAthenaBTService_Dash_ArsenicCore::DashAbilityTagContainer' has a wrong offset!");

// Class ArsenicCoreRuntime.FortAthenaBTService_PickUpLoot_ArsenicCore
// 0x0028 (0x00D8 - 0x00B0)
class UFortAthenaBTService_PickUpLoot_ArsenicCore final : public UFortAthenaBTService_PickUpLoot
{
public:
	struct FGameplayTagContainer                  AttackInsteadOfInteractContainerTags;              // 0x00B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   TargetActorName;                                   // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaBTService_PickUpLoot_ArsenicCore">();
	}
	static class UFortAthenaBTService_PickUpLoot_ArsenicCore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaBTService_PickUpLoot_ArsenicCore>();
	}
};
static_assert(alignof(UFortAthenaBTService_PickUpLoot_ArsenicCore) == 0x000008, "Wrong alignment on UFortAthenaBTService_PickUpLoot_ArsenicCore");
static_assert(sizeof(UFortAthenaBTService_PickUpLoot_ArsenicCore) == 0x0000D8, "Wrong size on UFortAthenaBTService_PickUpLoot_ArsenicCore");
static_assert(offsetof(UFortAthenaBTService_PickUpLoot_ArsenicCore, AttackInsteadOfInteractContainerTags) == 0x0000B0, "Member 'UFortAthenaBTService_PickUpLoot_ArsenicCore::AttackInsteadOfInteractContainerTags' has a wrong offset!");
static_assert(offsetof(UFortAthenaBTService_PickUpLoot_ArsenicCore, TargetActorName) == 0x0000D0, "Member 'UFortAthenaBTService_PickUpLoot_ArsenicCore::TargetActorName' has a wrong offset!");

// Class ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore
// 0x04D0 (0x0850 - 0x0380)
class AFortAthenaMutator_ArsenicCore final : public AFortAthenaMutator_GameModeBase
{
public:
	uint8                                         Pad_380[0x30];                                     // 0x0380(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bEnablePopulationTracker;                          // 0x03B0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         PopulationTrackerGridSpacing;                      // 0x03D0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         PopulationTrackerMaxGridUpdatesPerFrame;           // 0x03F0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bBotsUseOwnScreamData;                             // 0x0410(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bBotsUsePlayerScreamData;                          // 0x0430(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bBotsUseOtherBotsScreamData;                       // 0x0450(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         BotScreamDataShareRadius;                          // 0x0470(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxBotScreamStimDistance;                          // 0x0490(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         BotChanceToIgnoreScreamStimFromPlayerScream;       // 0x04B0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         BotChanceToIgnoreScreamStimFromOtherBotScream;     // 0x04D0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         BotChanceToIgnoreScreamStimFromOwnScream;          // 0x04F0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxNearbyGhostHumanRatioForBotScreamStim;          // 0x0510(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxNearbyPopulationForBotScreamStim;               // 0x0530(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         BotScreamStimNearbyRadius;                         // 0x0550(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSubclassOf<class UArsenicCorePlayerComponent> ArsenicCorePlayerComponentClass;                  // 0x0570(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaMutator_ConsumePickups*      ConsumePickupsMutator;                             // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAllowBotRespawnAsGhost;                           // 0x0580(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AArsenicCoreRespawnDrone>   ArsenicCoreRespawnDroneClass;                      // 0x05A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         GhostRespawnHeight;                                // 0x05A8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumGhostRespawnDistanceFromStormShieldBorder;  // 0x05C8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DroneViewTargetBlendDuration;                      // 0x05E8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PlayerRespawnCountdownTimerStartValue;             // 0x0608(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BotRespawnTimerValue;                              // 0x0628(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FItemAndCount>                  GhostItemList;                                     // 0x0648(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSkyDiveContrailItemDefinition*   GhostContrails;                                    // 0x0658(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           GhostHealthBarColorA;                              // 0x0660(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           GhostHealthBarColorB;                              // 0x0670(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           HumanHealthBarColorA;                              // 0x0680(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           HumanHealthBarColorB;                              // 0x0690(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bShouldHideGhostShieldBar;                         // 0x06A0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UTexture2D*                             GhostPortrait;                                     // 0x06C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWeaponItemDefinition*              GhostWeaponItemDefinition;                         // 0x06C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           BotGhostPawnTag;                                   // 0x06D0(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   VehiclePossessionContextText;                      // 0x06D8(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UGameplayEffect>>    PossessionGameplayEffectsForVehicle;               // 0x06F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PossessionGameplayCueTagForVehicle;                // 0x0700(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             GhostInteractAllowedClasses;                       // 0x0708(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  GhostInteractDisallowedTags;                       // 0x0718(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UAmbientAudioDataAsset*                 AmbientAudioBank;                                  // 0x0738(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AmbientAudioBankPriority;                          // 0x0740(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bEnableBotRespawnControlSystem;                    // 0x0748(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bBotRespawnControlSystem_UsePopulationTracker;     // 0x0768(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BotRespawnControlSystem_PopulationTrackerHumanGhostCountRadius; // 0x0788(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BotRespawnControlSystem_DesiredRatioOfHumanToGhostThreshold; // 0x07A8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bTheGhostTeamHasWon;                               // 0x07C8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ArsenicOnGhostTeamWon;                             // 0x07D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const class AFortPlayerStateAthena* VictimPlayerState, const struct FFortPlayerDeathReport& DeathReport)> ArsenicOnLocalPlayerDiedAsHuman; // 0x07E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_7F0[0x8];                                      // 0x07F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerStateAthena*>         GhostPlayerStates;                                 // 0x07F8(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FArsenicCoreHumanPawnData>      HumanPlayerPawnDataList;                           // 0x0808(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_818[0x28];                                     // 0x0818(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class AArsenicCorePopulationTracker*          PopulationTracker;                                 // 0x0840(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateGhostBotStimuliFromScream(class AFortPlayerPawnAthena* ScreamerPawn, const TArray<class AFortPlayerPawnAthena*>& RevealedHumans);
	float GetGhostHumanRatioInRadius(const struct FVector& CenterLocation, float Radius);
	void GetPopulationAndGhostHumanRatioInRadius(const struct FVector& CenterLocation, float Radius, float* OutPopulation, float* OutGhostHumanRatio);
	float GetPopulationInRadius(const struct FVector& CenterLocation, float Radius);
	void OnRep_bTheGhostTeamHasWon();
	void UpdateAnalyticsDataOnPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);

	uint8 GetEliminatedPlayersTeamId() const;
	uint8 GetGhostTeam(uint8 TeamId) const;
	bool HasTheGhostTeamWon() const;
	bool IsALivingTeam(uint8 TeamId) const;
	bool IsGhostTeam(uint8 TeamId) const;
	bool IsGhostThatPermaDiedTeam(uint8 TeamId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_ArsenicCore">();
	}
	static class AFortAthenaMutator_ArsenicCore* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_ArsenicCore>();
	}
};
static_assert(alignof(AFortAthenaMutator_ArsenicCore) == 0x000008, "Wrong alignment on AFortAthenaMutator_ArsenicCore");
static_assert(sizeof(AFortAthenaMutator_ArsenicCore) == 0x000850, "Wrong size on AFortAthenaMutator_ArsenicCore");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, bEnablePopulationTracker) == 0x0003B0, "Member 'AFortAthenaMutator_ArsenicCore::bEnablePopulationTracker' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, PopulationTrackerGridSpacing) == 0x0003D0, "Member 'AFortAthenaMutator_ArsenicCore::PopulationTrackerGridSpacing' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, PopulationTrackerMaxGridUpdatesPerFrame) == 0x0003F0, "Member 'AFortAthenaMutator_ArsenicCore::PopulationTrackerMaxGridUpdatesPerFrame' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, bBotsUseOwnScreamData) == 0x000410, "Member 'AFortAthenaMutator_ArsenicCore::bBotsUseOwnScreamData' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, bBotsUsePlayerScreamData) == 0x000430, "Member 'AFortAthenaMutator_ArsenicCore::bBotsUsePlayerScreamData' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, bBotsUseOtherBotsScreamData) == 0x000450, "Member 'AFortAthenaMutator_ArsenicCore::bBotsUseOtherBotsScreamData' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, BotScreamDataShareRadius) == 0x000470, "Member 'AFortAthenaMutator_ArsenicCore::BotScreamDataShareRadius' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, MaxBotScreamStimDistance) == 0x000490, "Member 'AFortAthenaMutator_ArsenicCore::MaxBotScreamStimDistance' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, BotChanceToIgnoreScreamStimFromPlayerScream) == 0x0004B0, "Member 'AFortAthenaMutator_ArsenicCore::BotChanceToIgnoreScreamStimFromPlayerScream' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, BotChanceToIgnoreScreamStimFromOtherBotScream) == 0x0004D0, "Member 'AFortAthenaMutator_ArsenicCore::BotChanceToIgnoreScreamStimFromOtherBotScream' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, BotChanceToIgnoreScreamStimFromOwnScream) == 0x0004F0, "Member 'AFortAthenaMutator_ArsenicCore::BotChanceToIgnoreScreamStimFromOwnScream' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, MaxNearbyGhostHumanRatioForBotScreamStim) == 0x000510, "Member 'AFortAthenaMutator_ArsenicCore::MaxNearbyGhostHumanRatioForBotScreamStim' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, MaxNearbyPopulationForBotScreamStim) == 0x000530, "Member 'AFortAthenaMutator_ArsenicCore::MaxNearbyPopulationForBotScreamStim' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, BotScreamStimNearbyRadius) == 0x000550, "Member 'AFortAthenaMutator_ArsenicCore::BotScreamStimNearbyRadius' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, ArsenicCorePlayerComponentClass) == 0x000570, "Member 'AFortAthenaMutator_ArsenicCore::ArsenicCorePlayerComponentClass' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, ConsumePickupsMutator) == 0x000578, "Member 'AFortAthenaMutator_ArsenicCore::ConsumePickupsMutator' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, bAllowBotRespawnAsGhost) == 0x000580, "Member 'AFortAthenaMutator_ArsenicCore::bAllowBotRespawnAsGhost' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, ArsenicCoreRespawnDroneClass) == 0x0005A0, "Member 'AFortAthenaMutator_ArsenicCore::ArsenicCoreRespawnDroneClass' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostRespawnHeight) == 0x0005A8, "Member 'AFortAthenaMutator_ArsenicCore::GhostRespawnHeight' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, MinimumGhostRespawnDistanceFromStormShieldBorder) == 0x0005C8, "Member 'AFortAthenaMutator_ArsenicCore::MinimumGhostRespawnDistanceFromStormShieldBorder' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, DroneViewTargetBlendDuration) == 0x0005E8, "Member 'AFortAthenaMutator_ArsenicCore::DroneViewTargetBlendDuration' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, PlayerRespawnCountdownTimerStartValue) == 0x000608, "Member 'AFortAthenaMutator_ArsenicCore::PlayerRespawnCountdownTimerStartValue' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, BotRespawnTimerValue) == 0x000628, "Member 'AFortAthenaMutator_ArsenicCore::BotRespawnTimerValue' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostItemList) == 0x000648, "Member 'AFortAthenaMutator_ArsenicCore::GhostItemList' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostContrails) == 0x000658, "Member 'AFortAthenaMutator_ArsenicCore::GhostContrails' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostHealthBarColorA) == 0x000660, "Member 'AFortAthenaMutator_ArsenicCore::GhostHealthBarColorA' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostHealthBarColorB) == 0x000670, "Member 'AFortAthenaMutator_ArsenicCore::GhostHealthBarColorB' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, HumanHealthBarColorA) == 0x000680, "Member 'AFortAthenaMutator_ArsenicCore::HumanHealthBarColorA' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, HumanHealthBarColorB) == 0x000690, "Member 'AFortAthenaMutator_ArsenicCore::HumanHealthBarColorB' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, bShouldHideGhostShieldBar) == 0x0006A0, "Member 'AFortAthenaMutator_ArsenicCore::bShouldHideGhostShieldBar' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostPortrait) == 0x0006C0, "Member 'AFortAthenaMutator_ArsenicCore::GhostPortrait' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostWeaponItemDefinition) == 0x0006C8, "Member 'AFortAthenaMutator_ArsenicCore::GhostWeaponItemDefinition' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, BotGhostPawnTag) == 0x0006D0, "Member 'AFortAthenaMutator_ArsenicCore::BotGhostPawnTag' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, VehiclePossessionContextText) == 0x0006D8, "Member 'AFortAthenaMutator_ArsenicCore::VehiclePossessionContextText' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, PossessionGameplayEffectsForVehicle) == 0x0006F0, "Member 'AFortAthenaMutator_ArsenicCore::PossessionGameplayEffectsForVehicle' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, PossessionGameplayCueTagForVehicle) == 0x000700, "Member 'AFortAthenaMutator_ArsenicCore::PossessionGameplayCueTagForVehicle' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostInteractAllowedClasses) == 0x000708, "Member 'AFortAthenaMutator_ArsenicCore::GhostInteractAllowedClasses' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostInteractDisallowedTags) == 0x000718, "Member 'AFortAthenaMutator_ArsenicCore::GhostInteractDisallowedTags' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, AmbientAudioBank) == 0x000738, "Member 'AFortAthenaMutator_ArsenicCore::AmbientAudioBank' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, AmbientAudioBankPriority) == 0x000740, "Member 'AFortAthenaMutator_ArsenicCore::AmbientAudioBankPriority' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, bEnableBotRespawnControlSystem) == 0x000748, "Member 'AFortAthenaMutator_ArsenicCore::bEnableBotRespawnControlSystem' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, bBotRespawnControlSystem_UsePopulationTracker) == 0x000768, "Member 'AFortAthenaMutator_ArsenicCore::bBotRespawnControlSystem_UsePopulationTracker' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, BotRespawnControlSystem_PopulationTrackerHumanGhostCountRadius) == 0x000788, "Member 'AFortAthenaMutator_ArsenicCore::BotRespawnControlSystem_PopulationTrackerHumanGhostCountRadius' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, BotRespawnControlSystem_DesiredRatioOfHumanToGhostThreshold) == 0x0007A8, "Member 'AFortAthenaMutator_ArsenicCore::BotRespawnControlSystem_DesiredRatioOfHumanToGhostThreshold' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, bTheGhostTeamHasWon) == 0x0007C8, "Member 'AFortAthenaMutator_ArsenicCore::bTheGhostTeamHasWon' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, ArsenicOnGhostTeamWon) == 0x0007D0, "Member 'AFortAthenaMutator_ArsenicCore::ArsenicOnGhostTeamWon' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, ArsenicOnLocalPlayerDiedAsHuman) == 0x0007E0, "Member 'AFortAthenaMutator_ArsenicCore::ArsenicOnLocalPlayerDiedAsHuman' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, GhostPlayerStates) == 0x0007F8, "Member 'AFortAthenaMutator_ArsenicCore::GhostPlayerStates' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, HumanPlayerPawnDataList) == 0x000808, "Member 'AFortAthenaMutator_ArsenicCore::HumanPlayerPawnDataList' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicCore, PopulationTracker) == 0x000840, "Member 'AFortAthenaMutator_ArsenicCore::PopulationTracker' has a wrong offset!");

// Class ArsenicCoreRuntime.FortAthenaMutator_ArsenicInventoryOverride
// 0x0088 (0x0510 - 0x0488)
class AFortAthenaMutator_ArsenicInventoryOverride final : public AFortAthenaMutator_InventoryOverride
{
public:
	uint8                                         Pad_488[0x18];                                     // 0x0488(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FItemLoadoutContainer>          PostSkyDiveInventoryLoadouts;                      // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FItemLoadoutContainer>          ParachuteDisabledInventoryLoadout;                 // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C0[0x50];                                     // 0x04C0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGamePhaseChanged(EAthenaGamePhase NewPhase);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_ArsenicInventoryOverride">();
	}
	static class AFortAthenaMutator_ArsenicInventoryOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_ArsenicInventoryOverride>();
	}
};
static_assert(alignof(AFortAthenaMutator_ArsenicInventoryOverride) == 0x000008, "Wrong alignment on AFortAthenaMutator_ArsenicInventoryOverride");
static_assert(sizeof(AFortAthenaMutator_ArsenicInventoryOverride) == 0x000510, "Wrong size on AFortAthenaMutator_ArsenicInventoryOverride");
static_assert(offsetof(AFortAthenaMutator_ArsenicInventoryOverride, PostSkyDiveInventoryLoadouts) == 0x0004A0, "Member 'AFortAthenaMutator_ArsenicInventoryOverride::PostSkyDiveInventoryLoadouts' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_ArsenicInventoryOverride, ParachuteDisabledInventoryLoadout) == 0x0004B0, "Member 'AFortAthenaMutator_ArsenicInventoryOverride::ParachuteDisabledInventoryLoadout' has a wrong offset!");

// Class ArsenicCoreRuntime.ConsumePickupsManager
// 0x0000 (0x0000 - 0x0000)
class IConsumePickupsManager final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConsumePickupsManager">();
	}
	static class IConsumePickupsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<IConsumePickupsManager>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IConsumePickupsManager) == 0x000001, "Wrong alignment on IConsumePickupsManager");
static_assert(sizeof(IConsumePickupsManager) == 0x000001, "Wrong size on IConsumePickupsManager");

// Class ArsenicCoreRuntime.FortCheatManager_ConsumePickups
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_ConsumePickups final : public UFortCheatManager_Coupled
{
public:
	void ConsumePickupsToggleEnabled();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_ConsumePickups">();
	}
	static class UFortCheatManager_ConsumePickups* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_ConsumePickups>();
	}
};
static_assert(alignof(UFortCheatManager_ConsumePickups) == 0x000008, "Wrong alignment on UFortCheatManager_ConsumePickups");
static_assert(sizeof(UFortCheatManager_ConsumePickups) == 0x000038, "Wrong size on UFortCheatManager_ConsumePickups");

// Class ArsenicCoreRuntime.FortAthenaMutator_ConsumePickups
// 0x00E0 (0x0350 - 0x0270)
class AFortAthenaMutator_ConsumePickups : public AFortAthenaMutator
{
public:
	struct FScalableFloat                         bCanConsumeWhenHealthIsFull;                       // 0x0270(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ConsumePickupInteractionTime;                      // 0x0290(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxConsumedItemsToDropOnDeath;                     // 0x02B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<EConsumePickupsDropOnDeathFilterRule>  DropOnDeathFilterRules;                            // 0x02D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EConsumePickupsDropOnDeathFilterRule_Definitive DefinitiveDropOnDeathFilterRule;                 // 0x02E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GameplayEffectClassesToApplyByRarity[0x8];         // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortControllerComponent_ConsumePickups> ConsumePickupsControllerComponentClass; // 0x0328(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFindAndSetManagerMutatorAutomatically;            // 0x0330(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
