#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicCoreUI

#include "Basic.hpp"

#include "ArsenicCoreRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ArsenicCoreUI.ArsenicCoreActivatablePanelBase.OnPlayerStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged) == 0x000008, "Wrong alignment on ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged");
static_assert(sizeof(ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged) == 0x000010, "Wrong size on ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged");
static_assert(offsetof(ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged, PlayerState) == 0x000000, "Member 'ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged::PlayerState' has a wrong offset!");
static_assert(offsetof(ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged, NewStatus) == 0x000008, "Member 'ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged::NewStatus' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreWidgetBase.OnLocalGhostPlayerEnteredOrExitedVehicle
// 0x0001 (0x0001 - 0x0000)
struct ArsenicCoreWidgetBase_OnLocalGhostPlayerEnteredOrExitedVehicle final
{
public:
	bool                                          bIsInVehicle;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArsenicCoreWidgetBase_OnLocalGhostPlayerEnteredOrExitedVehicle) == 0x000001, "Wrong alignment on ArsenicCoreWidgetBase_OnLocalGhostPlayerEnteredOrExitedVehicle");
static_assert(sizeof(ArsenicCoreWidgetBase_OnLocalGhostPlayerEnteredOrExitedVehicle) == 0x000001, "Wrong size on ArsenicCoreWidgetBase_OnLocalGhostPlayerEnteredOrExitedVehicle");
static_assert(offsetof(ArsenicCoreWidgetBase_OnLocalGhostPlayerEnteredOrExitedVehicle, bIsInVehicle) == 0x000000, "Member 'ArsenicCoreWidgetBase_OnLocalGhostPlayerEnteredOrExitedVehicle::bIsInVehicle' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreWidgetBase.OnLocalPlayerGhostVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct ArsenicCoreWidgetBase_OnLocalPlayerGhostVisibilityChanged final
{
public:
	bool                                          bIsVisibile;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArsenicCoreWidgetBase_OnLocalPlayerGhostVisibilityChanged) == 0x000001, "Wrong alignment on ArsenicCoreWidgetBase_OnLocalPlayerGhostVisibilityChanged");
static_assert(sizeof(ArsenicCoreWidgetBase_OnLocalPlayerGhostVisibilityChanged) == 0x000001, "Wrong size on ArsenicCoreWidgetBase_OnLocalPlayerGhostVisibilityChanged");
static_assert(offsetof(ArsenicCoreWidgetBase_OnLocalPlayerGhostVisibilityChanged, bIsVisibile) == 0x000000, "Member 'ArsenicCoreWidgetBase_OnLocalPlayerGhostVisibilityChanged::bIsVisibile' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreWidgetBase.OnPlayerStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCoreWidgetBase_OnPlayerStatusChanged final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArsenicCoreWidgetBase_OnPlayerStatusChanged) == 0x000008, "Wrong alignment on ArsenicCoreWidgetBase_OnPlayerStatusChanged");
static_assert(sizeof(ArsenicCoreWidgetBase_OnPlayerStatusChanged) == 0x000010, "Wrong size on ArsenicCoreWidgetBase_OnPlayerStatusChanged");
static_assert(offsetof(ArsenicCoreWidgetBase_OnPlayerStatusChanged, PlayerState) == 0x000000, "Member 'ArsenicCoreWidgetBase_OnPlayerStatusChanged::PlayerState' has a wrong offset!");
static_assert(offsetof(ArsenicCoreWidgetBase_OnPlayerStatusChanged, NewStatus) == 0x000008, "Member 'ArsenicCoreWidgetBase_OnPlayerStatusChanged::NewStatus' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreHUD.HandleGhostVisibilityChange_BP
// 0x0001 (0x0001 - 0x0000)
struct ArsenicCoreHUD_HandleGhostVisibilityChange_BP final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArsenicCoreHUD_HandleGhostVisibilityChange_BP) == 0x000001, "Wrong alignment on ArsenicCoreHUD_HandleGhostVisibilityChange_BP");
static_assert(sizeof(ArsenicCoreHUD_HandleGhostVisibilityChange_BP) == 0x000001, "Wrong size on ArsenicCoreHUD_HandleGhostVisibilityChange_BP");
static_assert(offsetof(ArsenicCoreHUD_HandleGhostVisibilityChange_BP, bIsVisible) == 0x000000, "Member 'ArsenicCoreHUD_HandleGhostVisibilityChange_BP::bIsVisible' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreHumansAndGhostsLeftBase.SetGhostsLeftText
// 0x0018 (0x0018 - 0x0000)
struct ArsenicCoreHumansAndGhostsLeftBase_SetGhostsLeftText final
{
public:
	class FText                                   GhostsText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArsenicCoreHumansAndGhostsLeftBase_SetGhostsLeftText) == 0x000008, "Wrong alignment on ArsenicCoreHumansAndGhostsLeftBase_SetGhostsLeftText");
static_assert(sizeof(ArsenicCoreHumansAndGhostsLeftBase_SetGhostsLeftText) == 0x000018, "Wrong size on ArsenicCoreHumansAndGhostsLeftBase_SetGhostsLeftText");
static_assert(offsetof(ArsenicCoreHumansAndGhostsLeftBase_SetGhostsLeftText, GhostsText) == 0x000000, "Member 'ArsenicCoreHumansAndGhostsLeftBase_SetGhostsLeftText::GhostsText' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreHumansAndGhostsLeftBase.SetHumansLeftText
// 0x0018 (0x0018 - 0x0000)
struct ArsenicCoreHumansAndGhostsLeftBase_SetHumansLeftText final
{
public:
	class FText                                   HumansText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArsenicCoreHumansAndGhostsLeftBase_SetHumansLeftText) == 0x000008, "Wrong alignment on ArsenicCoreHumansAndGhostsLeftBase_SetHumansLeftText");
static_assert(sizeof(ArsenicCoreHumansAndGhostsLeftBase_SetHumansLeftText) == 0x000018, "Wrong size on ArsenicCoreHumansAndGhostsLeftBase_SetHumansLeftText");
static_assert(offsetof(ArsenicCoreHumansAndGhostsLeftBase_SetHumansLeftText, HumansText) == 0x000000, "Member 'ArsenicCoreHumansAndGhostsLeftBase_SetHumansLeftText::HumansText' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreInventoryReplacementScreen.OnOwningPlayerStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct ArsenicCoreInventoryReplacementScreen_OnOwningPlayerStatusChanged final
{
public:
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArsenicCoreInventoryReplacementScreen_OnOwningPlayerStatusChanged) == 0x000001, "Wrong alignment on ArsenicCoreInventoryReplacementScreen_OnOwningPlayerStatusChanged");
static_assert(sizeof(ArsenicCoreInventoryReplacementScreen_OnOwningPlayerStatusChanged) == 0x000001, "Wrong size on ArsenicCoreInventoryReplacementScreen_OnOwningPlayerStatusChanged");
static_assert(offsetof(ArsenicCoreInventoryReplacementScreen_OnOwningPlayerStatusChanged, NewStatus) == 0x000000, "Member 'ArsenicCoreInventoryReplacementScreen_OnOwningPlayerStatusChanged::NewStatus' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreKillerInfoScreen.OnLocalPlayerDiedAsHuman
// 0x0080 (0x0080 - 0x0000)
struct ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman final
{
public:
	const class AFortPlayerStateAthena*           VictimPlayerState;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortPlayerDeathReport                 DeathReport;                                       // 0x0008(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman) == 0x000008, "Wrong alignment on ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman");
static_assert(sizeof(ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman) == 0x000080, "Wrong size on ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman");
static_assert(offsetof(ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman, VictimPlayerState) == 0x000000, "Member 'ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman::VictimPlayerState' has a wrong offset!");
static_assert(offsetof(ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman, DeathReport) == 0x000008, "Member 'ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman::DeathReport' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreSquadMemberStatusTrackingWidget.OnSquadMemberPlayerStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged) == 0x000008, "Wrong alignment on ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged");
static_assert(sizeof(ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged) == 0x000010, "Wrong size on ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged");
static_assert(offsetof(ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged, PlayerState) == 0x000000, "Member 'ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged::PlayerState' has a wrong offset!");
static_assert(offsetof(ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged, NewStatus) == 0x000008, "Member 'ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged::NewStatus' has a wrong offset!");

// Function ArsenicCoreUI.ArsenicCoreSquadMemberGameplayMessageWidget.OnSquadMemberPlayerStatusChanged_BP
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP) == 0x000008, "Wrong alignment on ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP");
static_assert(sizeof(ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP) == 0x000010, "Wrong size on ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP");
static_assert(offsetof(ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP, PlayerState) == 0x000000, "Member 'ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP::PlayerState' has a wrong offset!");
static_assert(offsetof(ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP, NewStatus) == 0x000008, "Member 'ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP::NewStatus' has a wrong offset!");

}

