#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_ParentBuildingContainerBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DayPhaseFloats_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_ParentBuildingContainerBlueprint.Athena_Prop_ParentBuildingContainerBlueprint_C
// 0x00E0 (0x0CB8 - 0x0BD8)
class AAthena_Prop_ParentBuildingContainerBlueprint_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DebugWind;                                         // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE1[0x7];                                      // 0x0BE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             IntenseWindMaterialsForPreview;                    // 0x0BE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wind_Intensity_Debug_Mesh;                         // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             OriginalMaterials;                                 // 0x0C00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Debug_TempMaterial;                                // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugWindYaw;                                      // 0x0C18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Debug_Wind_Intensity;                              // 0x0C1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Set_Max_Actor_Scale;                               // 0x0C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C21[0x3];                                      // 0x0C21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Max_Scale;                                         // 0x0C24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_TOD_Lights_and_Material_Emissive_Values;   // 0x0C28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active; // 0x0C29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Use_An_Alternate_Shadow_Mesh_When_The_Light_is_On_; // 0x0C2A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2B[0x5];                                      // 0x0C2B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            AlternateShadowStaticMesh;                         // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_Emissive_and_Lights_Over_Time;             // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C39[0x7];                                      // 0x0C39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   CodeControlled_EmissiveColor;                      // 0x0C40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<float>                                 CodeControlled_LightConeOpacity;                   // 0x0C50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDayPhaseFloats                        Light_Intensity_Over_Time_of_Day_;                 // 0x0C60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Day_Phase_Transition_Length;                       // 0x0C70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDayPhaseFloats                        Emissive_Intensity_Over_Time_of_Day;               // 0x0C74(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Volumetric_Light_Scattering_Intensity;             // 0x0C84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Volumetric_Shadows;                           // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Animate_Lights_With_A_Curve___Disables_time_of_day_light_controls; // 0x0C89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Animate_Mesh_MID_Emissive_Value_with_a_Curve___Disables_time_of_day_light_controls; // 0x0C8A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8B[0x5];                                      // 0x0C8B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            LightAnimationCurve;                               // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CodeControlled_Animation_Curve_Animation_Length;   // 0x0C98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CodeControlled_NumberOfMaterials;                  // 0x0C9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 NewVar_0;                                          // 0x0CA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         Random_Time_Scale_Percent;                         // 0x0CB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CodeControlled_CurrentPlayLength;                  // 0x0CB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Prop_ParentBuildingContainerBlueprint(int32 EntryPoint);
	void OnSetSearched();
	void OnBounceAnimationUpdate(const struct FFortBounceData& Data);
	void Loop_Animation_Curve();
	void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void GetTimeOfDayBlueprintDefaultVariables(struct FTimeOfDayBlueprintDefaultVariables* OutVariables);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_ParentBuildingContainerBlueprint_C">();
	}
	static class AAthena_Prop_ParentBuildingContainerBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_ParentBuildingContainerBlueprint_C>();
	}
};
static_assert(alignof(AAthena_Prop_ParentBuildingContainerBlueprint_C) == 0x000008, "Wrong alignment on AAthena_Prop_ParentBuildingContainerBlueprint_C");
static_assert(sizeof(AAthena_Prop_ParentBuildingContainerBlueprint_C) == 0x000CB8, "Wrong size on AAthena_Prop_ParentBuildingContainerBlueprint_C");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, UberGraphFrame) == 0x000BD8, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, DebugWind) == 0x000BE0, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::DebugWind' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, IntenseWindMaterialsForPreview) == 0x000BE8, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::IntenseWindMaterialsForPreview' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Wind_Intensity_Debug_Mesh) == 0x000BF8, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Wind_Intensity_Debug_Mesh' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, OriginalMaterials) == 0x000C00, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::OriginalMaterials' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Debug_TempMaterial) == 0x000C10, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Debug_TempMaterial' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, DebugWindYaw) == 0x000C18, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::DebugWindYaw' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Debug_Wind_Intensity) == 0x000C1C, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Debug_Wind_Intensity' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Set_Max_Actor_Scale) == 0x000C20, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Set_Max_Actor_Scale' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Max_Scale) == 0x000C24, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Max_Scale' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Disable_TOD_Lights_and_Material_Emissive_Values) == 0x000C28, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Disable_TOD_Lights_and_Material_Emissive_Values' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active) == 0x000C29, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Use_An_Alternate_Shadow_Mesh_When_The_Light_is_On_) == 0x000C2A, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Use_An_Alternate_Shadow_Mesh_When_The_Light_is_On_' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, AlternateShadowStaticMesh) == 0x000C30, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::AlternateShadowStaticMesh' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Animate_Emissive_and_Lights_Over_Time) == 0x000C38, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Animate_Emissive_and_Lights_Over_Time' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, CodeControlled_EmissiveColor) == 0x000C40, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::CodeControlled_EmissiveColor' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, CodeControlled_LightConeOpacity) == 0x000C50, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::CodeControlled_LightConeOpacity' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Light_Intensity_Over_Time_of_Day_) == 0x000C60, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Light_Intensity_Over_Time_of_Day_' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Day_Phase_Transition_Length) == 0x000C70, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Day_Phase_Transition_Length' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Emissive_Intensity_Over_Time_of_Day) == 0x000C74, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Emissive_Intensity_Over_Time_of_Day' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Volumetric_Light_Scattering_Intensity) == 0x000C84, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Volumetric_Light_Scattering_Intensity' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Cast_Volumetric_Shadows) == 0x000C88, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Cast_Volumetric_Shadows' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Animate_Lights_With_A_Curve___Disables_time_of_day_light_controls) == 0x000C89, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Animate_Lights_With_A_Curve___Disables_time_of_day_light_controls' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Animate_Mesh_MID_Emissive_Value_with_a_Curve___Disables_time_of_day_light_controls) == 0x000C8A, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Animate_Mesh_MID_Emissive_Value_with_a_Curve___Disables_time_of_day_light_controls' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, LightAnimationCurve) == 0x000C90, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::LightAnimationCurve' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, CodeControlled_Animation_Curve_Animation_Length) == 0x000C98, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::CodeControlled_Animation_Curve_Animation_Length' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, CodeControlled_NumberOfMaterials) == 0x000C9C, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::CodeControlled_NumberOfMaterials' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, NewVar_0) == 0x000CA0, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, Random_Time_Scale_Percent) == 0x000CB0, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::Random_Time_Scale_Percent' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_ParentBuildingContainerBlueprint_C, CodeControlled_CurrentPlayLength) == 0x000CB4, "Member 'AAthena_Prop_ParentBuildingContainerBlueprint_C::CodeControlled_CurrentPlayLength' has a wrong offset!");

}

