#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionMTXDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C
// 0x0128 (0x0868 - 0x0740)
class UAthenaDirectAcquisitionMTXDetails_C final : public UFortStoreFrontOfferDetailsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0740(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          AffilateInfo;                                      // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AffiliateName;                                     // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDirectAcquisitonDetails_RefundDisclaimer_C* AthenaDirectAcquisitonDetails_RefundDisclaimer; // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColor;                                         // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColorDetails;                                  // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BonusCurrencySB;                                   // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BPImage;                                           // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_4;                                    // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BaseQuantity;                           // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BonusQuantity;                          // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         DescriptionBox;                                    // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      GiftButton;                                        // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       KeyArt;                                            // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MtxCurrency;                                       // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradient;                                   // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradientDetails;                            // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseButton;                                    // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxDetails;                                  // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonNumberLarge;                                 // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute;                   // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute_C_0;               // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ChapterName;                                  // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SeasonName;                                   // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxOfferInfo;                                     // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         PlaceholderVariable;                               // 0x0850(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsItemCompletelyFree;                              // 0x0860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsBattlepass;                                      // 0x0861(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails(int32 EntryPoint);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnActivated();
	void BndEvt__GiftButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void HandlePurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const class FString& OfferId);
	void BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void HandleBack(bool* PassThrough);
	void Init();
	void PopDetails();
	void InitPurchaseButton();
	class UWidget* GetWidgetForFramingViewedItem();
	void InitAffiliateInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionMTXDetails_C">();
	}
	static class UAthenaDirectAcquisitionMTXDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionMTXDetails_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionMTXDetails_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionMTXDetails_C");
static_assert(sizeof(UAthenaDirectAcquisitionMTXDetails_C) == 0x000868, "Wrong size on UAthenaDirectAcquisitionMTXDetails_C");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, UberGraphFrame) == 0x000740, "Member 'UAthenaDirectAcquisitionMTXDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, AffilateInfo) == 0x000748, "Member 'UAthenaDirectAcquisitionMTXDetails_C::AffilateInfo' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, AffiliateName) == 0x000750, "Member 'UAthenaDirectAcquisitionMTXDetails_C::AffiliateName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, AthenaDirectAcquisitonDetails_RefundDisclaimer) == 0x000758, "Member 'UAthenaDirectAcquisitionMTXDetails_C::AthenaDirectAcquisitonDetails_RefundDisclaimer' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, BaseColor) == 0x000760, "Member 'UAthenaDirectAcquisitionMTXDetails_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, BaseColorDetails) == 0x000768, "Member 'UAthenaDirectAcquisitionMTXDetails_C::BaseColorDetails' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, BonusCurrencySB) == 0x000770, "Member 'UAthenaDirectAcquisitionMTXDetails_C::BonusCurrencySB' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, BPImage) == 0x000778, "Member 'UAthenaDirectAcquisitionMTXDetails_C::BPImage' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, CloseButton) == 0x000780, "Member 'UAthenaDirectAcquisitionMTXDetails_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, CommonBorder_4) == 0x000788, "Member 'UAthenaDirectAcquisitionMTXDetails_C::CommonBorder_4' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, CommonText_BaseQuantity) == 0x000790, "Member 'UAthenaDirectAcquisitionMTXDetails_C::CommonText_BaseQuantity' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, CommonText_BonusQuantity) == 0x000798, "Member 'UAthenaDirectAcquisitionMTXDetails_C::CommonText_BonusQuantity' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, DescriptionBox) == 0x0007A0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::DescriptionBox' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, GiftButton) == 0x0007A8, "Member 'UAthenaDirectAcquisitionMTXDetails_C::GiftButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, KeyArt) == 0x0007B0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, MTXButton) == 0x0007B8, "Member 'UAthenaDirectAcquisitionMTXDetails_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, MtxCurrency) == 0x0007C0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::MtxCurrency' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, OverlayGradient) == 0x0007C8, "Member 'UAthenaDirectAcquisitionMTXDetails_C::OverlayGradient' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, OverlayGradientDetails) == 0x0007D0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::OverlayGradientDetails' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, OverlaySalePrice) == 0x0007D8, "Member 'UAthenaDirectAcquisitionMTXDetails_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, PurchaseButton) == 0x0007E0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, SafeZone_0) == 0x0007E8, "Member 'UAthenaDirectAcquisitionMTXDetails_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, SafeZone_1) == 0x0007F0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, ScrollBoxDetails) == 0x0007F8, "Member 'UAthenaDirectAcquisitionMTXDetails_C::ScrollBoxDetails' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, SeasonNumberLarge) == 0x000800, "Member 'UAthenaDirectAcquisitionMTXDetails_C::SeasonNumberLarge' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, StoreMain_OfferDetailsAttribute) == 0x000808, "Member 'UAthenaDirectAcquisitionMTXDetails_C::StoreMain_OfferDetailsAttribute' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, StoreMain_OfferDetailsAttribute_C_0) == 0x000810, "Member 'UAthenaDirectAcquisitionMTXDetails_C::StoreMain_OfferDetailsAttribute_C_0' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, Text_ChapterName) == 0x000818, "Member 'UAthenaDirectAcquisitionMTXDetails_C::Text_ChapterName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, Text_SeasonName) == 0x000820, "Member 'UAthenaDirectAcquisitionMTXDetails_C::Text_SeasonName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, TextDescription) == 0x000828, "Member 'UAthenaDirectAcquisitionMTXDetails_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, TextName) == 0x000830, "Member 'UAthenaDirectAcquisitionMTXDetails_C::TextName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, TextOfferDisplayPrice) == 0x000838, "Member 'UAthenaDirectAcquisitionMTXDetails_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, TextOriginalPrice) == 0x000840, "Member 'UAthenaDirectAcquisitionMTXDetails_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, VBoxOfferInfo) == 0x000848, "Member 'UAthenaDirectAcquisitionMTXDetails_C::VBoxOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, PlaceholderVariable) == 0x000850, "Member 'UAthenaDirectAcquisitionMTXDetails_C::PlaceholderVariable' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, IsItemCompletelyFree) == 0x000860, "Member 'UAthenaDirectAcquisitionMTXDetails_C::IsItemCompletelyFree' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, IsBattlepass) == 0x000861, "Member 'UAthenaDirectAcquisitionMTXDetails_C::IsBattlepass' has a wrong offset!");

}

