#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_ArsenicCore_Claws

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_ArsenicCore_Claws.B_ArsenicCore_Claws_C.ExecuteUbergraph_B_ArsenicCore_Claws
// 0x0008 (0x0008 - 0x0000)
struct B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws) == 0x000004, "Wrong alignment on B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws");
static_assert(sizeof(B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws) == 0x000008, "Wrong size on B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws");
static_assert(offsetof(B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws, EntryPoint) == 0x000000, "Member 'B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'B_ArsenicCore_Claws_C_ExecuteUbergraph_B_ArsenicCore_Claws::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

