#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Assault_Stark_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Assault_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Assault_Stark_Athena.B_Assault_Stark_Athena_C
// 0x0040 (0x1298 - 0x1258)
class AB_Assault_Stark_Athena_C final : public AB_Assault_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Assault_Stark_Athena_C;           // 0x1258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsTargetting;                                      // 0x1260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1261[0x7];                                     // 0x1261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             TransformIntoADSAudio;                             // 0x1268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TransformOutOfADSAudio;                            // 0x1270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ADSColor;                                          // 0x1278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HipfireColor;                                      // 0x1288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Assault_Stark_Athena(int32 EntryPoint);
	void K2_OnUnEquip();
	void OnSetTargeting(bool bNewIsTargeting);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Assault_Stark_Athena_C">();
	}
	static class AB_Assault_Stark_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Assault_Stark_Athena_C>();
	}
};
static_assert(alignof(AB_Assault_Stark_Athena_C) == 0x000008, "Wrong alignment on AB_Assault_Stark_Athena_C");
static_assert(sizeof(AB_Assault_Stark_Athena_C) == 0x001298, "Wrong size on AB_Assault_Stark_Athena_C");
static_assert(offsetof(AB_Assault_Stark_Athena_C, UberGraphFrame_B_Assault_Stark_Athena_C) == 0x001258, "Member 'AB_Assault_Stark_Athena_C::UberGraphFrame_B_Assault_Stark_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Assault_Stark_Athena_C, IsTargetting) == 0x001260, "Member 'AB_Assault_Stark_Athena_C::IsTargetting' has a wrong offset!");
static_assert(offsetof(AB_Assault_Stark_Athena_C, TransformIntoADSAudio) == 0x001268, "Member 'AB_Assault_Stark_Athena_C::TransformIntoADSAudio' has a wrong offset!");
static_assert(offsetof(AB_Assault_Stark_Athena_C, TransformOutOfADSAudio) == 0x001270, "Member 'AB_Assault_Stark_Athena_C::TransformOutOfADSAudio' has a wrong offset!");
static_assert(offsetof(AB_Assault_Stark_Athena_C, ADSColor) == 0x001278, "Member 'AB_Assault_Stark_Athena_C::ADSColor' has a wrong offset!");
static_assert(offsetof(AB_Assault_Stark_Athena_C, HipfireColor) == 0x001288, "Member 'AB_Assault_Stark_Athena_C::HipfireColor' has a wrong offset!");

}

