#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Flopper_Thermal_CameraModifier

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_Flopper_Thermal_CameraModifier.B_Athena_Flopper_Thermal_CameraModifier_C.BlueprintModifyPostProcess
// 0x0AC0 (0x0AC0 - 0x0000)
struct B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0550)(Parm, OutParm)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0560(0x0010)()
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0570(0x0550)()
};
static_assert(alignof(B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess");
static_assert(sizeof(B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess) == 0x000AC0, "Wrong size on B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess");
static_assert(offsetof(B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess, PostProcessBlendWeight) == 0x000004, "Member 'B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess::PostProcessBlendWeight' has a wrong offset!");
static_assert(offsetof(B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess, PostProcessSettings) == 0x000010, "Member 'B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess::PostProcessSettings' has a wrong offset!");
static_assert(offsetof(B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess, K2Node_MakeStruct_WeightedBlendables) == 0x000560, "Member 'B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");
static_assert(offsetof(B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess, K2Node_MakeStruct_PostProcessSettings) == 0x000570, "Member 'B_Athena_Flopper_Thermal_CameraModifier_C_BlueprintModifyPostProcess::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");

}

