#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CCPM_Base_Niagara

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.ExecuteUbergraph_B_CCPM_Base_Niagara
// 0x0208 (0x0208 - 0x0000)
struct B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StatName, int32 StatValue)> K2Node_CreateDelegate_OutputDelegate;     // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_StatName;                       // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StatValue;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_WaitManagedParticles*  CallFunc_SpawnManagedParticlesWithCallback_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0050(0x0020)()
	bool                                          CallFunc_IsInFrontend_ReturnValue;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container_1; // 0x0078(0x0020)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Stat_Name;                      // 0x00A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Stat_Value;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CosmeticAdaptiveStatWatcher* CallFunc_WatchCosmeticStat_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_At_Creation_3;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_At_Creation_2;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_At_Creation_1;                  // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_At_Creation;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 K2Node_Event_CurrentDayPhase;                      // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_Event_PreviousDayPhase;                     // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAtCreation;                          // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_getIsDriving_isDriving;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_Event_VehicleEntered;                       // 0x00D0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_getIsDriving_isDriving_1;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_1;    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsHidden)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity)> K2Node_CreateDelegate_OutputDelegate_3; // 0x010C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_2;    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_3;    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x014C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_OldLocation;                    // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_OldVelocity;                    // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container_2; // 0x0190(0x0020)()
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container_3; // 0x01B0(0x0020)()
	bool                                          K2Node_CustomEvent_isHidden;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container_4; // 0x01E0(0x0020)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_getIsFrontEnd_IsInFrontEnd;               // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara");
static_assert(sizeof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara) == 0x000208, "Wrong size on B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, EntryPoint) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_StatName) == 0x000014, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_StatName' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_StatValue) == 0x00001C, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_StatValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, Temp_int_Variable) == 0x000020, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, Temp_name_Variable) == 0x000024, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_SpawnManagedParticlesWithCallback_ReturnValue) == 0x000040, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_SpawnManagedParticlesWithCallback_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_Event_EndPlayReason) == 0x000048, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_getNiagaraParticles_Gameplay_Tag_Container) == 0x000050, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_getNiagaraParticles_Gameplay_Tag_Container' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_IsInFrontend_ReturnValue) == 0x000070, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_IsInFrontend_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_getNiagaraParticles_Gameplay_Tag_Container_1) == 0x000078, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_getNiagaraParticles_Gameplay_Tag_Container_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_BooleanAND_ReturnValue_1) == 0x000099, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x0000A0, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_Stat_Name) == 0x0000A8, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_Stat_Name' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_Stat_Value) == 0x0000B0, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_Stat_Value' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_WatchCosmeticStat_ReturnValue) == 0x0000B8, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_WatchCosmeticStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_At_Creation_3) == 0x0000C0, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_At_Creation_3' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_At_Creation_2) == 0x0000C2, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_At_Creation_2' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_At_Creation_1) == 0x0000C3, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_At_Creation_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_At_Creation) == 0x0000C4, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_At_Creation' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_Event_CurrentDayPhase) == 0x0000C5, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_Event_CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_Event_PreviousDayPhase) == 0x0000C6, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_Event_PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_Event_bAtCreation) == 0x0000C7, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_Event_bAtCreation' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, Temp_bool_Has_Been_Initd_Variable) == 0x0000C8, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_SwitchEnum_CmpSuccess) == 0x0000C9, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_getIsDriving_isDriving) == 0x0000CA, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_getIsDriving_isDriving' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_Event_VehicleEntered) == 0x0000D0, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_Event_VehicleEntered' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_getIsDriving_isDriving_1) == 0x0000E0, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_getIsDriving_isDriving_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_GetAssociatedPlayerPawn_ReturnValue_1) == 0x0000E8, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_GetAssociatedPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0000F0, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000FC, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CreateDelegate_OutputDelegate_3) == 0x00010C, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_GetAssociatedPlayerPawn_ReturnValue_2) == 0x000120, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_GetAssociatedPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000128, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_IsValid_ReturnValue_2) == 0x000129, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_GetAssociatedPlayerPawn_ReturnValue_3) == 0x000130, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_GetAssociatedPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_BooleanAND_ReturnValue_2) == 0x000138, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x000140, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CreateDelegate_OutputDelegate_4) == 0x00014C, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CreateDelegate_OutputDelegate_5) == 0x00015C, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_DeltaSeconds) == 0x00016C, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_OldLocation) == 0x000170, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_OldLocation' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_OldVelocity) == 0x00017C, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_OldVelocity' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, Temp_bool_Has_Been_Initd_Variable_1) == 0x000188, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_getNiagaraParticles_Gameplay_Tag_Container_2) == 0x000190, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_getNiagaraParticles_Gameplay_Tag_Container_2' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_getNiagaraParticles_Gameplay_Tag_Container_3) == 0x0001B0, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_getNiagaraParticles_Gameplay_Tag_Container_3' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, K2Node_CustomEvent_isHidden) == 0x0001D0, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::K2Node_CustomEvent_isHidden' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_BooleanAND_ReturnValue_3) == 0x0001D1, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x0001D8, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_getNiagaraParticles_Gameplay_Tag_Container_4) == 0x0001E0, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_getNiagaraParticles_Gameplay_Tag_Container_4' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, Temp_bool_IsClosed_Variable) == 0x000200, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_getIsFrontEnd_IsInFrontEnd) == 0x000201, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_getIsFrontEnd_IsInFrontEnd' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, Temp_bool_IsClosed_Variable_1) == 0x000202, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_Not_PreBool_ReturnValue) == 0x000203, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara, CallFunc_BooleanAND_ReturnValue_4) == 0x000204, "Member 'B_CCPM_Base_Niagara_C_ExecuteUbergraph_B_CCPM_Base_Niagara::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.isHiddenInProp
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_C_isHiddenInProp final
{
public:
	bool                                          IsHidden;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_isHiddenInProp) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_C_isHiddenInProp");
static_assert(sizeof(B_CCPM_Base_Niagara_C_isHiddenInProp) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_C_isHiddenInProp");
static_assert(offsetof(B_CCPM_Base_Niagara_C_isHiddenInProp, IsHidden) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_isHiddenInProp::IsHidden' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.Character Movement Updated
// 0x001C (0x001C - 0x0000)
struct B_CCPM_Base_Niagara_C_Character_Movement_Updated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldLocation;                                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldVelocity;                                       // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_Character_Movement_Updated) == 0x000004, "Wrong alignment on B_CCPM_Base_Niagara_C_Character_Movement_Updated");
static_assert(sizeof(B_CCPM_Base_Niagara_C_Character_Movement_Updated) == 0x00001C, "Wrong size on B_CCPM_Base_Niagara_C_Character_Movement_Updated");
static_assert(offsetof(B_CCPM_Base_Niagara_C_Character_Movement_Updated, DeltaSeconds) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_Character_Movement_Updated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_Character_Movement_Updated, OldLocation) == 0x000004, "Member 'B_CCPM_Base_Niagara_C_Character_Movement_Updated::OldLocation' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_Character_Movement_Updated, OldVelocity) == 0x000010, "Member 'B_CCPM_Base_Niagara_C_Character_Movement_Updated::OldVelocity' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.OnEnterVehicle
// 0x0010 (0x0010 - 0x0000)
struct B_CCPM_Base_Niagara_C_OnEnterVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> VehicleEntered;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_OnEnterVehicle) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_OnEnterVehicle");
static_assert(sizeof(B_CCPM_Base_Niagara_C_OnEnterVehicle) == 0x000010, "Wrong size on B_CCPM_Base_Niagara_C_OnEnterVehicle");
static_assert(offsetof(B_CCPM_Base_Niagara_C_OnEnterVehicle, VehicleEntered) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_OnEnterVehicle::VehicleEntered' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.OnDayPhaseChanged
// 0x0003 (0x0003 - 0x0000)
struct B_CCPM_Base_Niagara_C_OnDayPhaseChanged final
{
public:
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 PreviousDayPhase;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAtCreation;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_OnDayPhaseChanged) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_C_OnDayPhaseChanged");
static_assert(sizeof(B_CCPM_Base_Niagara_C_OnDayPhaseChanged) == 0x000003, "Wrong size on B_CCPM_Base_Niagara_C_OnDayPhaseChanged");
static_assert(offsetof(B_CCPM_Base_Niagara_C_OnDayPhaseChanged, CurrentDayPhase) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_OnDayPhaseChanged::CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_OnDayPhaseChanged, PreviousDayPhase) == 0x000001, "Member 'B_CCPM_Base_Niagara_C_OnDayPhaseChanged::PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_OnDayPhaseChanged, bAtCreation) == 0x000002, "Member 'B_CCPM_Base_Niagara_C_OnDayPhaseChanged::bAtCreation' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.Night Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_C_Night_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_Night_Phase) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_C_Night_Phase");
static_assert(sizeof(B_CCPM_Base_Niagara_C_Night_Phase) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_C_Night_Phase");
static_assert(offsetof(B_CCPM_Base_Niagara_C_Night_Phase, At_Creation) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_Night_Phase::At_Creation' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.Evening Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_C_Evening_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_Evening_Phase) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_C_Evening_Phase");
static_assert(sizeof(B_CCPM_Base_Niagara_C_Evening_Phase) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_C_Evening_Phase");
static_assert(offsetof(B_CCPM_Base_Niagara_C_Evening_Phase, At_Creation) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_Evening_Phase::At_Creation' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.Day Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_C_Day_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_Day_Phase) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_C_Day_Phase");
static_assert(sizeof(B_CCPM_Base_Niagara_C_Day_Phase) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_C_Day_Phase");
static_assert(offsetof(B_CCPM_Base_Niagara_C_Day_Phase, At_Creation) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_Day_Phase::At_Creation' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.Morning Phase
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_C_Morning_Phase final
{
public:
	bool                                          At_Creation;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_Morning_Phase) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_C_Morning_Phase");
static_assert(sizeof(B_CCPM_Base_Niagara_C_Morning_Phase) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_C_Morning_Phase");
static_assert(offsetof(B_CCPM_Base_Niagara_C_Morning_Phase, At_Creation) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_Morning_Phase::At_Creation' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.On Stat Canged
// 0x000C (0x000C - 0x0000)
struct B_CCPM_Base_Niagara_C_On_Stat_Canged final
{
public:
	class FName                                   Stat_Name;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stat_Value;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_On_Stat_Canged) == 0x000004, "Wrong alignment on B_CCPM_Base_Niagara_C_On_Stat_Canged");
static_assert(sizeof(B_CCPM_Base_Niagara_C_On_Stat_Canged) == 0x00000C, "Wrong size on B_CCPM_Base_Niagara_C_On_Stat_Canged");
static_assert(offsetof(B_CCPM_Base_Niagara_C_On_Stat_Canged, Stat_Name) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_On_Stat_Canged::Stat_Name' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_On_Stat_Canged, Stat_Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_C_On_Stat_Canged::Stat_Value' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_C_ReceiveEndPlay");
static_assert(sizeof(B_CCPM_Base_Niagara_C_ReceiveEndPlay) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_C_ReceiveEndPlay");
static_assert(offsetof(B_CCPM_Base_Niagara_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420
// 0x000C (0x000C - 0x0000)
struct B_CCPM_Base_Niagara_C_OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420 final
{
public:
	class FName                                   StatName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatValue;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420) == 0x000004, "Wrong alignment on B_CCPM_Base_Niagara_C_OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420");
static_assert(sizeof(B_CCPM_Base_Niagara_C_OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420) == 0x00000C, "Wrong size on B_CCPM_Base_Niagara_C_OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420");
static_assert(offsetof(B_CCPM_Base_Niagara_C_OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420, StatName) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420::StatName' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420, StatValue) == 0x000008, "Member 'B_CCPM_Base_Niagara_C_OnStatChanged_B170ACAB47DC1A9DBE8D138BF0A01420::StatValue' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.getNiagaraParticles
// 0x0050 (0x0050 - 0x0000)
struct B_CCPM_Base_Niagara_C_getNiagaraParticles final
{
public:
	struct FGameplayTagContainer                  Gameplay_Tag_Container;                            // 0x0000(0x0020)(Parm, OutParm)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0030(0x0020)()
};
static_assert(alignof(B_CCPM_Base_Niagara_C_getNiagaraParticles) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_getNiagaraParticles");
static_assert(sizeof(B_CCPM_Base_Niagara_C_getNiagaraParticles) == 0x000050, "Wrong size on B_CCPM_Base_Niagara_C_getNiagaraParticles");
static_assert(offsetof(B_CCPM_Base_Niagara_C_getNiagaraParticles, Gameplay_Tag_Container) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_getNiagaraParticles::Gameplay_Tag_Container' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_getNiagaraParticles, K2Node_MakeArray_Array) == 0x000020, "Member 'B_CCPM_Base_Niagara_C_getNiagaraParticles::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_getNiagaraParticles, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000030, "Member 'B_CCPM_Base_Niagara_C_getNiagaraParticles::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.getIsDriving
// 0x0001 (0x0001 - 0x0000)
struct B_CCPM_Base_Niagara_C_getIsDriving final
{
public:
	bool                                          isDriving_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_getIsDriving) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_C_getIsDriving");
static_assert(sizeof(B_CCPM_Base_Niagara_C_getIsDriving) == 0x000001, "Wrong size on B_CCPM_Base_Niagara_C_getIsDriving");
static_assert(offsetof(B_CCPM_Base_Niagara_C_getIsDriving, isDriving_0) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_getIsDriving::isDriving_0' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.set Niagara System User Variable (Float)
// 0x0030 (0x0030 - 0x0000)
struct B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0010(0x0020)()
};
static_assert(alignof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_");
static_assert(sizeof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_) == 0x000030, "Wrong size on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_, Name_0) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_::Name_0' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_::Value' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_, CallFunc_getNiagaraParticles_Gameplay_Tag_Container) == 0x000010, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Float_::CallFunc_getNiagaraParticles_Gameplay_Tag_Container' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.set Niagara System User Variable (Int)
// 0x0030 (0x0030 - 0x0000)
struct B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0010(0x0020)()
};
static_assert(alignof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_");
static_assert(sizeof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_) == 0x000030, "Wrong size on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_, Name_0) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_::Name_0' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_::Value' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_, CallFunc_getNiagaraParticles_Gameplay_Tag_Container) == 0x000010, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Int_::CallFunc_getNiagaraParticles_Gameplay_Tag_Container' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.set Niagara System User Variable (Vector)
// 0x0038 (0x0038 - 0x0000)
struct B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Value;                                             // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0018(0x0020)()
};
static_assert(alignof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_");
static_assert(sizeof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_) == 0x000038, "Wrong size on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_, Name_0) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_::Name_0' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_::Value' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_, CallFunc_getNiagaraParticles_Gameplay_Tag_Container) == 0x000018, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Vector_::CallFunc_getNiagaraParticles_Gameplay_Tag_Container' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.set Niagara System User Variable (Color)
// 0x0038 (0x0038 - 0x0000)
struct B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0018(0x0020)()
};
static_assert(alignof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_");
static_assert(sizeof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_) == 0x000038, "Wrong size on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_, Name_0) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_::Name_0' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_::Value' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_, CallFunc_getNiagaraParticles_Gameplay_Tag_Container) == 0x000018, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Color_::CallFunc_getNiagaraParticles_Gameplay_Tag_Container' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.set Niagara System User Variable (Bool)
// 0x0030 (0x0030 - 0x0000)
struct B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_ final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_getNiagaraParticles_Gameplay_Tag_Container; // 0x0010(0x0020)()
};
static_assert(alignof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_");
static_assert(sizeof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_) == 0x000030, "Wrong size on B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_, Name_0) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_::Name_0' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_, Value) == 0x000008, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_::Value' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_, CallFunc_getNiagaraParticles_Gameplay_Tag_Container) == 0x000010, "Member 'B_CCPM_Base_Niagara_C_set_Niagara_System_User_Variable__Bool_::CallFunc_getNiagaraParticles_Gameplay_Tag_Container' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.getIsFrontEnd
// 0x0002 (0x0002 - 0x0000)
struct B_CCPM_Base_Niagara_C_getIsFrontEnd final
{
public:
	bool                                          IsInFrontEnd_0;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFrontend_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_getIsFrontEnd) == 0x000001, "Wrong alignment on B_CCPM_Base_Niagara_C_getIsFrontEnd");
static_assert(sizeof(B_CCPM_Base_Niagara_C_getIsFrontEnd) == 0x000002, "Wrong size on B_CCPM_Base_Niagara_C_getIsFrontEnd");
static_assert(offsetof(B_CCPM_Base_Niagara_C_getIsFrontEnd, IsInFrontEnd_0) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_getIsFrontEnd::IsInFrontEnd_0' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_getIsFrontEnd, CallFunc_IsInFrontend_ReturnValue) == 0x000001, "Member 'B_CCPM_Base_Niagara_C_getIsFrontEnd::CallFunc_IsInFrontend_ReturnValue' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.debug FX
// 0x0010 (0x0010 - 0x0000)
struct B_CCPM_Base_Niagara_C_debug_FX final
{
public:
	class FString                                 Print_String;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CCPM_Base_Niagara_C_debug_FX) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_debug_FX");
static_assert(sizeof(B_CCPM_Base_Niagara_C_debug_FX) == 0x000010, "Wrong size on B_CCPM_Base_Niagara_C_debug_FX");
static_assert(offsetof(B_CCPM_Base_Niagara_C_debug_FX, Print_String) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_debug_FX::Print_String' has a wrong offset!");

// Function B_CCPM_Base_Niagara.B_CCPM_Base_Niagara_C.getNiagaraSuperLevelParticles
// 0x0050 (0x0050 - 0x0000)
struct B_CCPM_Base_Niagara_C_getNiagaraSuperLevelParticles final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0030(0x0020)()
};
static_assert(alignof(B_CCPM_Base_Niagara_C_getNiagaraSuperLevelParticles) == 0x000008, "Wrong alignment on B_CCPM_Base_Niagara_C_getNiagaraSuperLevelParticles");
static_assert(sizeof(B_CCPM_Base_Niagara_C_getNiagaraSuperLevelParticles) == 0x000050, "Wrong size on B_CCPM_Base_Niagara_C_getNiagaraSuperLevelParticles");
static_assert(offsetof(B_CCPM_Base_Niagara_C_getNiagaraSuperLevelParticles, ReturnValue) == 0x000000, "Member 'B_CCPM_Base_Niagara_C_getNiagaraSuperLevelParticles::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CCPM_Base_Niagara_C_getNiagaraSuperLevelParticles, K2Node_MakeArray_Array) == 0x000020, "Member 'B_CCPM_Base_Niagara_C_getNiagaraSuperLevelParticles::K2Node_MakeArray_Array' has a wrong offset!");
