#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FireExtinguisherWeapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "B_Ranged_Generic_Athena_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_FireExtinguisherWeapon.B_FireExtinguisherWeapon_C
// 0x00B0 (0x1260 - 0x11B0)
class AB_FireExtinguisherWeapon_C final : public AB_Ranged_Generic_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_FireExtinguisherWeapon_C;         // 0x11B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABGA_FireExtinguisher_Pickup_C*         AttachedBGAActor;                                  // 0x11B8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachSocket;                                      // 0x11C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C8[0x8];                                     // 0x11C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             AttachedBGARelativeTransform;                      // 0x11D0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableAmmoMod;                                     // 0x1200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1201[0x7];                                     // 0x1201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         IsShootableWhileHeld;                              // 0x1208(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGuid                                  InventoryGUID;                                     // 0x1228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            WeaponReference;                                   // 0x1238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortInventoryOwnerInterface> InventoryInterface;                         // 0x1240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowHUDKeyActions;                                 // 0x1250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1251[0x3];                                     // 0x1251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AttachedBGAScale;                                  // 0x1254(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_FireExtinguisherWeapon(int32 EntryPoint);
	void OnUnholstered();
	void HUDKeyAction_Targeting(bool IsTargeting);
	void ReplicateOnUnholstered();
	void OnWeaponAttached();
	void UpdateAndAttachBGA();
	void ReplicateOnHolstered();
	void OnHolstered();
	void K2_OnUnEquip();
	void UnbindHolsterEvents();
	void BindHolsterEvents();
	void BGADestroyedWhileHeld();
	void ReceiveBeginPlay();
	void OnRep_AttachedBGAActor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_FireExtinguisherWeapon_C">();
	}
	static class AB_FireExtinguisherWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_FireExtinguisherWeapon_C>();
	}
};
static_assert(alignof(AB_FireExtinguisherWeapon_C) == 0x000010, "Wrong alignment on AB_FireExtinguisherWeapon_C");
static_assert(sizeof(AB_FireExtinguisherWeapon_C) == 0x001260, "Wrong size on AB_FireExtinguisherWeapon_C");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, UberGraphFrame_B_FireExtinguisherWeapon_C) == 0x0011B0, "Member 'AB_FireExtinguisherWeapon_C::UberGraphFrame_B_FireExtinguisherWeapon_C' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, AttachedBGAActor) == 0x0011B8, "Member 'AB_FireExtinguisherWeapon_C::AttachedBGAActor' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, AttachSocket) == 0x0011C0, "Member 'AB_FireExtinguisherWeapon_C::AttachSocket' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, AttachedBGARelativeTransform) == 0x0011D0, "Member 'AB_FireExtinguisherWeapon_C::AttachedBGARelativeTransform' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, EnableAmmoMod) == 0x001200, "Member 'AB_FireExtinguisherWeapon_C::EnableAmmoMod' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, IsShootableWhileHeld) == 0x001208, "Member 'AB_FireExtinguisherWeapon_C::IsShootableWhileHeld' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, InventoryGUID) == 0x001228, "Member 'AB_FireExtinguisherWeapon_C::InventoryGUID' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, WeaponReference) == 0x001238, "Member 'AB_FireExtinguisherWeapon_C::WeaponReference' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, InventoryInterface) == 0x001240, "Member 'AB_FireExtinguisherWeapon_C::InventoryInterface' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, ShowHUDKeyActions) == 0x001250, "Member 'AB_FireExtinguisherWeapon_C::ShowHUDKeyActions' has a wrong offset!");
static_assert(offsetof(AB_FireExtinguisherWeapon_C, AttachedBGAScale) == 0x001254, "Member 'AB_FireExtinguisherWeapon_C::AttachedBGAScale' has a wrong offset!");

}

