#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Hightower_Wasabi_Claws

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function B_Hightower_Wasabi_Claws.B_Hightower_Wasabi_Claws_C.ExecuteUbergraph_B_Hightower_Wasabi_Claws
// 0x0410 (0x0410 - 0x0000)
struct B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0024(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1; // 0x00B0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_3;       // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0140(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              K2Node_Event_ImpactPhysicalSurface;                // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     K2Node_Event_SpawnedPSC;                           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x01D8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_266[0x2];                                      // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_CalculateDecalRotationFrom2Locations_DecalRotation; // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_CalculateDecalRotationFrom2Locations_DecalRotation_1; // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue;            // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372[0x2];                                      // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x03A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x03D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXAtLocation_ReturnValue_1;          // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws) == 0x000008, "Wrong alignment on B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws");
static_assert(sizeof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws) == 0x000410, "Wrong size on B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, EntryPoint) == 0x000000, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, K2Node_DynamicCast_AsFort_Pawn) == 0x000010, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00001A, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000020, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000024, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1) == 0x0000B0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x00013C, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_AttachToComponent_ReturnValue_3) == 0x00013D, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_AttachToComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, K2Node_Event_HitResult) == 0x000140, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, K2Node_Event_ImpactPhysicalSurface) == 0x0001CC, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::K2Node_Event_ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, K2Node_Event_SpawnedPSC) == 0x0001D0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::K2Node_Event_SpawnedPSC' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x0001D8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_bBlockingHit) == 0x000264, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_bInitialOverlap) == 0x000265, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_Time) == 0x000268, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_Distance) == 0x00026C, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_Location) == 0x000270, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_ImpactPoint) == 0x00027C, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_Normal) == 0x000288, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_ImpactNormal) == 0x000294, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_PhysMat) == 0x0002A0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_HitActor) == 0x0002A8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_HitComponent) == 0x0002B0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_HitBoneName) == 0x0002B8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_HitItem) == 0x0002C0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_ElementIndex) == 0x0002C4, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_FaceIndex) == 0x0002C8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_TraceStart) == 0x0002CC, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_BreakHitResult_TraceEnd) == 0x0002D8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_GetSocketLocation_ReturnValue) == 0x0002E4, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_CalculateDecalRotationFrom2Locations_DecalRotation) == 0x0002F0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_CalculateDecalRotationFrom2Locations_DecalRotation' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_CalculateDecalRotationFrom2Locations_DecalRotation_1) == 0x0002FC, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_CalculateDecalRotationFrom2Locations_DecalRotation_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_SpawnFXAtLocation_ReturnValue) == 0x000308, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_SpawnFXAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000310, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, Temp_bool_Has_Been_Initd_Variable) == 0x00031C, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_GetInstigator_ReturnValue_1) == 0x000320, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000328, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000334, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_GetInstigator_ReturnValue_2) == 0x000340, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000348, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000354, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Array_Length_ReturnValue) == 0x000360, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, Temp_int_Array_Index_Variable_1) == 0x000364, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Array_Length_ReturnValue_1) == 0x000368, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, Temp_int_Loop_Counter_Variable) == 0x00036C, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, Temp_bool_IsClosed_Variable) == 0x000370, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Less_IntInt_ReturnValue) == 0x000371, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Add_IntInt_ReturnValue) == 0x000374, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000378, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000388, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Add_VectorVector_ReturnValue) == 0x000390, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_SpawnDecalAtLocation_ReturnValue_1) == 0x0003A0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_SpawnDecalAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, K2Node_CreateDelegate_OutputDelegate) == 0x0003A8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003B8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003C8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, Temp_int_Loop_Counter_Variable_1) == 0x0003D0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0003D8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003E0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_Add_IntInt_ReturnValue_1) == 0x0003E4, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0003E8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_GetInstigator_ReturnValue_3) == 0x0003F0, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_GetInstigator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0003F8, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws, CallFunc_SpawnFXAtLocation_ReturnValue_1) == 0x000408, "Member 'B_Hightower_Wasabi_Claws_C_ExecuteUbergraph_B_Hightower_Wasabi_Claws::CallFunc_SpawnFXAtLocation_ReturnValue_1' has a wrong offset!");

// Function B_Hightower_Wasabi_Claws.B_Hightower_Wasabi_Claws_C.OnPlayImpactFX
// 0x0098 (0x0098 - 0x0000)
struct B_Hightower_Wasabi_Claws_C_OnPlayImpactFX final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              ImpactPhysicalSurface;                             // 0x008C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     SpawnedPSC;                                        // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Hightower_Wasabi_Claws_C_OnPlayImpactFX) == 0x000008, "Wrong alignment on B_Hightower_Wasabi_Claws_C_OnPlayImpactFX");
static_assert(sizeof(B_Hightower_Wasabi_Claws_C_OnPlayImpactFX) == 0x000098, "Wrong size on B_Hightower_Wasabi_Claws_C_OnPlayImpactFX");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_OnPlayImpactFX, HitResult) == 0x000000, "Member 'B_Hightower_Wasabi_Claws_C_OnPlayImpactFX::HitResult' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_OnPlayImpactFX, ImpactPhysicalSurface) == 0x00008C, "Member 'B_Hightower_Wasabi_Claws_C_OnPlayImpactFX::ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_OnPlayImpactFX, SpawnedPSC) == 0x000090, "Member 'B_Hightower_Wasabi_Claws_C_OnPlayImpactFX::SpawnedPSC' has a wrong offset!");

// Function B_Hightower_Wasabi_Claws.B_Hightower_Wasabi_Claws_C.Bind Dual Melee Swing Events
// 0x0118 (0x0118 - 0x0000)
struct B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerPawn_Generic_C*                  K2Node_DynamicCast_AsPlayer_Pawn_Generic;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events) == 0x000008, "Wrong alignment on B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events");
static_assert(sizeof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events) == 0x000118, "Wrong size on B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_5) == 0x000050, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_6) == 0x000060, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_7) == 0x000070, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_8) == 0x000080, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, CallFunc_GetInstigator_ReturnValue) == 0x000090, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, CallFunc_GetInstigator_ReturnValue_1) == 0x000098, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, CallFunc_Conv_ObjectToString_ReturnValue) == 0x0000A0, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_DynamicCast_AsPlayer_Pawn_Generic) == 0x0000B0, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_DynamicCast_AsPlayer_Pawn_Generic' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000D0, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000E0, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000F0, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, CallFunc_GetInstigator_ReturnValue_2) == 0x000100, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000108, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'B_Hightower_Wasabi_Claws_C_Bind_Dual_Melee_Swing_Events::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function B_Hightower_Wasabi_Claws.B_Hightower_Wasabi_Claws_C.CalculateDecalRotationFrom2Locations
// 0x0098 (0x0098 - 0x0000)
struct B_Hightower_Wasabi_Claws_C_CalculateDecalRotationFrom2Locations final
{
public:
	TArray<struct FVector>                        DecalLocations;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FRotator                               DecalRotation;                                     // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectPointOnToPlane_ReturnValue;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectPointOnToPlane_ReturnValue_1;      // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXY_ReturnValue;                // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Hightower_Wasabi_Claws_C_CalculateDecalRotationFrom2Locations) == 0x000008, "Wrong alignment on B_Hightower_Wasabi_Claws_C_CalculateDecalRotationFrom2Locations");
static_assert(sizeof(B_Hightower_Wasabi_Claws_C_CalculateDecalRotationFrom2Locations) == 0x000098, "Wrong size on B_Hightower_Wasabi_Claws_C_CalculateDecalRotationFrom2Locations");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_CalculateDecalRotationFrom2Locations, DecalLocations) == 0x000000, "Member 'B_Hightower_Wasabi_Claws_C_CalculateDecalRotationFrom2Locations::DecalLocations' has a wrong offset!");
static_assert(offsetof(B_Hightower_Wasabi_Claws_C_CalculateDecalRotationFrom2Locations, DecalRotation) == 0x000010, "Member 'B_Hightower_Wasabi_Claws_C_CalculateDecalRotationFrom2Locations::DecalRotation' has a wrong offset!");
