#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Hightower_Wasabi_Claws

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Mantis_Weapon_Parent_classes.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Hightower_Wasabi_Claws.B_Hightower_Wasabi_Claws_C
// 0x00E8 (0x0F40 - 0x0E58)
class AB_Hightower_Wasabi_Claws_C : public AB_Mantis_Weapon_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Hightower_Wasabi_Claws_C;         // 0x0E58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SwingFXNiagara_Offhand;                            // 0x0E60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         WeaponMesh_Offhand;                                // 0x0E68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SwingFXNiagara_Main;                               // 0x0E70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   OffhandSocketName;                                 // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               WeaponRelativeRotation_Main;                       // 0x0E80(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               WeaponRelativeRotation_Offhand;                    // 0x0E8C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   MainhandSocketName;                                // 0x0E98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeaponRelativeOffset_Main;                         // 0x0EA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeaponRelativeOffset_Offhand;                      // 0x0EAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SwingFXSocketName;                                 // 0x0EB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactLocation;                                    // 0x0EC0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ECC[0x4];                                      // 0x0ECC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ImpactDecal;                                       // 0x0ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ImpactDecalPositionSocketName;                     // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        MainHandDecalLocations;                            // 0x0EE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FVector>                        OffHandDecalLocations;                             // 0x0EF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          MainHandFirstDecalLocationIsSet;                   // 0x0F00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OffHandFirstDecalLocationIsSet;                    // 0x0F01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MainHandDecalLocationsReady;                       // 0x0F02(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OffHandDecalLocationsReady;                        // 0x0F03(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ReadyToAddImpactDecal;                             // 0x0F04(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F05[0x3];                                      // 0x0F05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecalOffset;                                       // 0x0F08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalScale;                                        // 0x0F0C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugDecals;                                       // 0x0F18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F19[0x3];                                      // 0x0F19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DualDecalGraceWindow;                              // 0x0F1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             UnequipSound;                                      // 0x0F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             EquipSound;                                        // 0x0F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         MainHandDirectionalImpactFX;                       // 0x0F30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         OffhandDirectionalImpactFX;                        // 0x0F38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Hightower_Wasabi_Claws(int32 EntryPoint);
	void SetReadyToAddImpactDecalsFalse();
	void TrySpawnDecal();
	void OnPlayImpactFX(const struct FHitResult& HitResult, EPhysicalSurface ImpactPhysicalSurface, class UFXSystemComponent* SpawnedPSC);
	void Swing_Right_2();
	void Swing_Right_End();
	void Swing_Right();
	void Swing_Left_2();
	void Swing_Left_End();
	void Swing_Left();
	void K2_OnUnEquip();
	void OnWeaponDetached();
	void OnWeaponAttached();
	void Bind_Dual_Melee_Swing_Events();
	void Unbind_Dual_Melee_Swing_Events();

	void CalculateDecalRotationFrom2Locations(TArray<struct FVector>& DecalLocations, struct FRotator* DecalRotation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Hightower_Wasabi_Claws_C">();
	}
	static class AB_Hightower_Wasabi_Claws_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Hightower_Wasabi_Claws_C>();
	}
};
static_assert(alignof(AB_Hightower_Wasabi_Claws_C) == 0x000008, "Wrong alignment on AB_Hightower_Wasabi_Claws_C");
static_assert(sizeof(AB_Hightower_Wasabi_Claws_C) == 0x000F40, "Wrong size on AB_Hightower_Wasabi_Claws_C");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, UberGraphFrame_B_Hightower_Wasabi_Claws_C) == 0x000E58, "Member 'AB_Hightower_Wasabi_Claws_C::UberGraphFrame_B_Hightower_Wasabi_Claws_C' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, SwingFXNiagara_Offhand) == 0x000E60, "Member 'AB_Hightower_Wasabi_Claws_C::SwingFXNiagara_Offhand' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, WeaponMesh_Offhand) == 0x000E68, "Member 'AB_Hightower_Wasabi_Claws_C::WeaponMesh_Offhand' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, SwingFXNiagara_Main) == 0x000E70, "Member 'AB_Hightower_Wasabi_Claws_C::SwingFXNiagara_Main' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, OffhandSocketName) == 0x000E78, "Member 'AB_Hightower_Wasabi_Claws_C::OffhandSocketName' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, WeaponRelativeRotation_Main) == 0x000E80, "Member 'AB_Hightower_Wasabi_Claws_C::WeaponRelativeRotation_Main' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, WeaponRelativeRotation_Offhand) == 0x000E8C, "Member 'AB_Hightower_Wasabi_Claws_C::WeaponRelativeRotation_Offhand' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, MainhandSocketName) == 0x000E98, "Member 'AB_Hightower_Wasabi_Claws_C::MainhandSocketName' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, WeaponRelativeOffset_Main) == 0x000EA0, "Member 'AB_Hightower_Wasabi_Claws_C::WeaponRelativeOffset_Main' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, WeaponRelativeOffset_Offhand) == 0x000EAC, "Member 'AB_Hightower_Wasabi_Claws_C::WeaponRelativeOffset_Offhand' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, SwingFXSocketName) == 0x000EB8, "Member 'AB_Hightower_Wasabi_Claws_C::SwingFXSocketName' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, ImpactLocation) == 0x000EC0, "Member 'AB_Hightower_Wasabi_Claws_C::ImpactLocation' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, ImpactDecal) == 0x000ED0, "Member 'AB_Hightower_Wasabi_Claws_C::ImpactDecal' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, ImpactDecalPositionSocketName) == 0x000ED8, "Member 'AB_Hightower_Wasabi_Claws_C::ImpactDecalPositionSocketName' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, MainHandDecalLocations) == 0x000EE0, "Member 'AB_Hightower_Wasabi_Claws_C::MainHandDecalLocations' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, OffHandDecalLocations) == 0x000EF0, "Member 'AB_Hightower_Wasabi_Claws_C::OffHandDecalLocations' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, MainHandFirstDecalLocationIsSet) == 0x000F00, "Member 'AB_Hightower_Wasabi_Claws_C::MainHandFirstDecalLocationIsSet' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, OffHandFirstDecalLocationIsSet) == 0x000F01, "Member 'AB_Hightower_Wasabi_Claws_C::OffHandFirstDecalLocationIsSet' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, MainHandDecalLocationsReady) == 0x000F02, "Member 'AB_Hightower_Wasabi_Claws_C::MainHandDecalLocationsReady' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, OffHandDecalLocationsReady) == 0x000F03, "Member 'AB_Hightower_Wasabi_Claws_C::OffHandDecalLocationsReady' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, ReadyToAddImpactDecal) == 0x000F04, "Member 'AB_Hightower_Wasabi_Claws_C::ReadyToAddImpactDecal' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, DecalOffset) == 0x000F08, "Member 'AB_Hightower_Wasabi_Claws_C::DecalOffset' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, DecalScale) == 0x000F0C, "Member 'AB_Hightower_Wasabi_Claws_C::DecalScale' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, DebugDecals) == 0x000F18, "Member 'AB_Hightower_Wasabi_Claws_C::DebugDecals' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, DualDecalGraceWindow) == 0x000F1C, "Member 'AB_Hightower_Wasabi_Claws_C::DualDecalGraceWindow' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, UnequipSound) == 0x000F20, "Member 'AB_Hightower_Wasabi_Claws_C::UnequipSound' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, EquipSound) == 0x000F28, "Member 'AB_Hightower_Wasabi_Claws_C::EquipSound' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, MainHandDirectionalImpactFX) == 0x000F30, "Member 'AB_Hightower_Wasabi_Claws_C::MainHandDirectionalImpactFX' has a wrong offset!");
static_assert(offsetof(AB_Hightower_Wasabi_Claws_C, OffhandDirectionalImpactFX) == 0x000F38, "Member 'AB_Hightower_Wasabi_Claws_C::OffhandDirectionalImpactFX' has a wrong offset!");

}

