#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HighTower_Date_Gauntlets_BoostJump

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_HighTower_Date_Gauntlets_BoostJump.B_HighTower_Date_Gauntlets_BoostJump_C.ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump
// 0x0080 (0x0080 - 0x0000)
struct B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0020(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0030(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump) == 0x000008, "Wrong alignment on B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump");
static_assert(sizeof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump) == 0x000080, "Wrong size on B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, EntryPoint) == 0x000000, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000014, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, K2Node_Event_HitActors) == 0x000020, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, K2Node_Event_HitResults) == 0x000030, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000040, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00004C, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000058, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000060, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, CallFunc_GetInstigator_ReturnValue) == 0x000070, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump, CallFunc_IsLocallyControlled_ReturnValue) == 0x000078, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_ExecuteUbergraph_B_HighTower_Date_Gauntlets_BoostJump::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function B_HighTower_Date_Gauntlets_BoostJump.B_HighTower_Date_Gauntlets_BoostJump_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct B_HighTower_Date_Gauntlets_BoostJump_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(B_HighTower_Date_Gauntlets_BoostJump_C_OnExploded) == 0x000008, "Wrong alignment on B_HighTower_Date_Gauntlets_BoostJump_C_OnExploded");
static_assert(sizeof(B_HighTower_Date_Gauntlets_BoostJump_C_OnExploded) == 0x000020, "Wrong size on B_HighTower_Date_Gauntlets_BoostJump_C_OnExploded");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_OnExploded, HitActors) == 0x000000, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_OnExploded, HitResults) == 0x000010, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_OnExploded::HitResults' has a wrong offset!");

// Function B_HighTower_Date_Gauntlets_BoostJump.B_HighTower_Date_Gauntlets_BoostJump_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct B_HighTower_Date_Gauntlets_BoostJump_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_HighTower_Date_Gauntlets_BoostJump_C_UserConstructionScript) == 0x000001, "Wrong alignment on B_HighTower_Date_Gauntlets_BoostJump_C_UserConstructionScript");
static_assert(sizeof(B_HighTower_Date_Gauntlets_BoostJump_C_UserConstructionScript) == 0x000001, "Wrong size on B_HighTower_Date_Gauntlets_BoostJump_C_UserConstructionScript");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function B_HighTower_Date_Gauntlets_BoostJump.B_HighTower_Date_Gauntlets_BoostJump_C.Handle Pawn Detach RC
// 0x0010 (0x0010 - 0x0000)
struct B_HighTower_Date_Gauntlets_BoostJump_C_Handle_Pawn_Detach_RC final
{
public:
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_HighTower_Date_Gauntlets_BoostJump_C_Handle_Pawn_Detach_RC) == 0x000008, "Wrong alignment on B_HighTower_Date_Gauntlets_BoostJump_C_Handle_Pawn_Detach_RC");
static_assert(sizeof(B_HighTower_Date_Gauntlets_BoostJump_C_Handle_Pawn_Detach_RC) == 0x000010, "Wrong size on B_HighTower_Date_Gauntlets_BoostJump_C_Handle_Pawn_Detach_RC");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_Handle_Pawn_Detach_RC, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000000, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_Handle_Pawn_Detach_RC::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_HighTower_Date_Gauntlets_BoostJump_C_Handle_Pawn_Detach_RC, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'B_HighTower_Date_Gauntlets_BoostJump_C_Handle_Pawn_Detach_RC::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

