#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_LowTower_HeldObject_Chaplin_ChargeProjectile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_LowTower_HeldObject_Chaplin_ChargeProjectile.B_LowTower_HeldObject_Chaplin_ChargeProjectile_C.ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile
// 0x0020 (0x0020 - 0x0000)
struct B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetMuzzleLocation_ReturnValue;            // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile) == 0x000008, "Wrong alignment on B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile");
static_assert(sizeof(B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile) == 0x000020, "Wrong size on B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile, EntryPoint) == 0x000000, "Member 'B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000008, "Member 'B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile, CallFunc_GetMuzzleLocation_ReturnValue) == 0x000014, "Member 'B_LowTower_HeldObject_Chaplin_ChargeProjectile_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin_ChargeProjectile::CallFunc_GetMuzzleLocation_ReturnValue' has a wrong offset!");

}

