#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_LowTower_HeldObject_Chaplin

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_LowTower_HeldObject_Chaplin.B_LowTower_HeldObject_Chaplin_C.ExecuteUbergraph_B_LowTower_HeldObject_Chaplin
// 0x0100 (0x0100 - 0x0000)
struct B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0048(0x00B8)(ContainsInstancedReference)
};
static_assert(alignof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin) == 0x000008, "Wrong alignment on B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin");
static_assert(sizeof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin) == 0x000100, "Wrong size on B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, EntryPoint) == 0x000000, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, Temp_bool_Variable) == 0x000004, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue) == 0x000020, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000028, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00003A, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00003C, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, K2Node_GameplayCueEvent_EventType) == 0x000040, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin, K2Node_GameplayCueEvent_Parameters) == 0x000048, "Member 'B_LowTower_HeldObject_Chaplin_C_ExecuteUbergraph_B_LowTower_HeldObject_Chaplin::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");

// Function B_LowTower_HeldObject_Chaplin.B_LowTower_HeldObject_Chaplin_C.GameplayCue.Abilities.LowTower.Chaplin.PrimaryShoot
// 0x00C0 (0x00C0 - 0x0000)
struct B_LowTower_HeldObject_Chaplin_C_GameplayCue_Abilities_LowTower_Chaplin_PrimaryShoot final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(B_LowTower_HeldObject_Chaplin_C_GameplayCue_Abilities_LowTower_Chaplin_PrimaryShoot) == 0x000008, "Wrong alignment on B_LowTower_HeldObject_Chaplin_C_GameplayCue_Abilities_LowTower_Chaplin_PrimaryShoot");
static_assert(sizeof(B_LowTower_HeldObject_Chaplin_C_GameplayCue_Abilities_LowTower_Chaplin_PrimaryShoot) == 0x0000C0, "Wrong size on B_LowTower_HeldObject_Chaplin_C_GameplayCue_Abilities_LowTower_Chaplin_PrimaryShoot");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_GameplayCue_Abilities_LowTower_Chaplin_PrimaryShoot, EventType) == 0x000000, "Member 'B_LowTower_HeldObject_Chaplin_C_GameplayCue_Abilities_LowTower_Chaplin_PrimaryShoot::EventType' has a wrong offset!");
static_assert(offsetof(B_LowTower_HeldObject_Chaplin_C_GameplayCue_Abilities_LowTower_Chaplin_PrimaryShoot, Parameters) == 0x000008, "Member 'B_LowTower_HeldObject_Chaplin_C_GameplayCue_Abilities_LowTower_Chaplin_PrimaryShoot::Parameters' has a wrong offset!");

}

