#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Mantis_Weapon_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Mantis_Weapon_Parent.B_Mantis_Weapon_Parent_C.ExecuteUbergraph_B_Mantis_Weapon_Parent
// 0x0078 (0x0078 - 0x0000)
struct B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hide;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent) == 0x000008, "Wrong alignment on B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent");
static_assert(sizeof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent) == 0x000078, "Wrong size on B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, EntryPoint) == 0x000000, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000018, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, K2Node_CustomEvent_Hide) == 0x000030, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::K2Node_CustomEvent_Hide' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, CallFunc_GetContext_ReturnValue_1) == 0x000050, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000058, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000060, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000070, "Member 'B_Mantis_Weapon_Parent_C_ExecuteUbergraph_B_Mantis_Weapon_Parent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function B_Mantis_Weapon_Parent.B_Mantis_Weapon_Parent_C.ReticleStatusDisplay
// 0x0001 (0x0001 - 0x0000)
struct B_Mantis_Weapon_Parent_C_ReticleStatusDisplay final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Mantis_Weapon_Parent_C_ReticleStatusDisplay) == 0x000001, "Wrong alignment on B_Mantis_Weapon_Parent_C_ReticleStatusDisplay");
static_assert(sizeof(B_Mantis_Weapon_Parent_C_ReticleStatusDisplay) == 0x000001, "Wrong size on B_Mantis_Weapon_Parent_C_ReticleStatusDisplay");
static_assert(offsetof(B_Mantis_Weapon_Parent_C_ReticleStatusDisplay, Hide) == 0x000000, "Member 'B_Mantis_Weapon_Parent_C_ReticleStatusDisplay::Hide' has a wrong offset!");

}

