#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Mantis_Weapon_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "B_Melee_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Mantis_Weapon_Parent.B_Mantis_Weapon_Parent_C
// 0x0060 (0x0E58 - 0x0DF8)
class AB_Mantis_Weapon_Parent_C : public AB_Melee_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Mantis_Weapon_Parent_C;           // 0x0DF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortMantisWeaponComponent*             FortMantisWeapon;                                  // 0x0E00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerCharacter;                                   // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_MeleeAttackAbility;                              // 0x0E10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x0E30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           Timer_ShowReticleStatus;                           // 0x0E50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Mantis_Weapon_Parent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ShowReticleStatusDisplay();
	void ReticleStatusDisplay(bool Hide);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Mantis_Weapon_Parent_C">();
	}
	static class AB_Mantis_Weapon_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Mantis_Weapon_Parent_C>();
	}
};
static_assert(alignof(AB_Mantis_Weapon_Parent_C) == 0x000008, "Wrong alignment on AB_Mantis_Weapon_Parent_C");
static_assert(sizeof(AB_Mantis_Weapon_Parent_C) == 0x000E58, "Wrong size on AB_Mantis_Weapon_Parent_C");
static_assert(offsetof(AB_Mantis_Weapon_Parent_C, UberGraphFrame_B_Mantis_Weapon_Parent_C) == 0x000DF8, "Member 'AB_Mantis_Weapon_Parent_C::UberGraphFrame_B_Mantis_Weapon_Parent_C' has a wrong offset!");
static_assert(offsetof(AB_Mantis_Weapon_Parent_C, FortMantisWeapon) == 0x000E00, "Member 'AB_Mantis_Weapon_Parent_C::FortMantisWeapon' has a wrong offset!");
static_assert(offsetof(AB_Mantis_Weapon_Parent_C, PlayerCharacter) == 0x000E08, "Member 'AB_Mantis_Weapon_Parent_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(AB_Mantis_Weapon_Parent_C, T_MeleeAttackAbility) == 0x000E10, "Member 'AB_Mantis_Weapon_Parent_C::T_MeleeAttackAbility' has a wrong offset!");
static_assert(offsetof(AB_Mantis_Weapon_Parent_C, T_HudElementToHide) == 0x000E30, "Member 'AB_Mantis_Weapon_Parent_C::T_HudElementToHide' has a wrong offset!");
static_assert(offsetof(AB_Mantis_Weapon_Parent_C, Timer_ShowReticleStatus) == 0x000E50, "Member 'AB_Mantis_Weapon_Parent_C::Timer_ShowReticleStatus' has a wrong offset!");

}

