#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_FrostedTips_Fireballs

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_FrostedTips_Fireballs.B_Prj_Athena_FrostedTips_Fireballs_C.ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs
// 0x0270 (0x0270 - 0x0000)
struct B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x0048(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00D4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterBody*                             K2Node_DynamicCast_AsWater_Body;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate; // 0x025C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs) == 0x000008, "Wrong alignment on B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs");
static_assert(sizeof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs) == 0x000270, "Wrong size on B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_Event_MyComp) == 0x000008, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_Event_Other) == 0x000010, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_Event_OtherComp) == 0x000018, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_Event_bSelfMoved) == 0x000020, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_Event_HitLocation) == 0x000024, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_Event_HitNormal) == 0x000030, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_Event_NormalImpulse) == 0x00003C, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_Event_Hit_1) == 0x000048, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_Event_Hit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_Event_Hit) == 0x0000D4, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_bBlockingHit) == 0x000160, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_bInitialOverlap) == 0x000161, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_Time) == 0x000164, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_Distance) == 0x000168, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_Location) == 0x00016C, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_Normal) == 0x000184, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_ImpactNormal) == 0x000190, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_PhysMat) == 0x0001A0, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_HitActor) == 0x0001A8, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_HitComponent) == 0x0001B0, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_HitBoneName) == 0x0001B8, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_HitItem) == 0x0001C0, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_ElementIndex) == 0x0001C4, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_FaceIndex) == 0x0001C8, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_TraceStart) == 0x0001CC, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_DynamicCast_AsWater_Body) == 0x0001E8, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_DynamicCast_AsWater_Body' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_GetOwner_ReturnValue) == 0x0001F8, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x000200, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, CallFunc_IsServer_ReturnValue) == 0x000208, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_CustomEvent_DamagedActor) == 0x000210, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_CustomEvent_Damage) == 0x000218, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_CustomEvent_InstigatedBy) == 0x000220, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_CustomEvent_DamageCauser) == 0x000228, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_CustomEvent_HitLocation) == 0x000230, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_CustomEvent_FHitComponent) == 0x000240, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_CustomEvent_BoneName) == 0x000248, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_CustomEvent_Momentum) == 0x000250, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs, K2Node_CreateDelegate_OutputDelegate) == 0x00025C, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ExecuteUbergraph_B_Prj_Athena_FrostedTips_Fireballs::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function B_Prj_Athena_FrostedTips_Fireballs.B_Prj_Athena_FrostedTips_Fireballs_C.OnDied
// 0x0050 (0x0050 - 0x0000)
struct B_Prj_Athena_FrostedTips_Fireballs_C_OnDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied) == 0x000008, "Wrong alignment on B_Prj_Athena_FrostedTips_Fireballs_C_OnDied");
static_assert(sizeof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied) == 0x000050, "Wrong size on B_Prj_Athena_FrostedTips_Fireballs_C_OnDied");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied, DamagedActor) == 0x000000, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_OnDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied, Damage) == 0x000008, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_OnDied::Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied, InstigatedBy) == 0x000010, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_OnDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied, DamageCauser) == 0x000018, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_OnDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied, HitLocation) == 0x000020, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_OnDied::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied, FHitComponent) == 0x000030, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_OnDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied, BoneName) == 0x000038, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_OnDied::BoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_OnDied, Momentum) == 0x000040, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_OnDied::Momentum' has a wrong offset!");

// Function B_Prj_Athena_FrostedTips_Fireballs.B_Prj_Athena_FrostedTips_Fireballs_C.OnStop
// 0x008C (0x008C - 0x0000)
struct B_Prj_Athena_FrostedTips_Fireballs_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_FrostedTips_Fireballs_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_Athena_FrostedTips_Fireballs_C_OnStop");
static_assert(sizeof(B_Prj_Athena_FrostedTips_Fireballs_C_OnStop) == 0x00008C, "Wrong size on B_Prj_Athena_FrostedTips_Fireballs_C_OnStop");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Athena_FrostedTips_Fireballs.B_Prj_Athena_FrostedTips_Fireballs_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct B_Prj_Athena_FrostedTips_Fireballs_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_FrostedTips_Fireballs_C_ReceiveHit) == 0x000008, "Wrong alignment on B_Prj_Athena_FrostedTips_Fireballs_C_ReceiveHit");
static_assert(sizeof(B_Prj_Athena_FrostedTips_Fireballs_C_ReceiveHit) == 0x0000D0, "Wrong size on B_Prj_Athena_FrostedTips_Fireballs_C_ReceiveHit");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_FrostedTips_Fireballs_C_ReceiveHit, Other) == 0x000008, "Member 'B_Prj_Athena_FrostedTips_Fireballs_C_ReceiveHit::Other' has a wrong offset!");
