#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Grenade_MolotovCocktail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "B_Prj_Athena_Grenade_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_Grenade_MolotovCocktail.B_Prj_Athena_Grenade_MolotovCocktail_C
// 0x0190 (0x0AD0 - 0x0940)
class AB_Prj_Athena_Grenade_MolotovCocktail_C final : public AB_Prj_Athena_Grenade_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_Grenade_MolotovCocktail_C; // 0x0940(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara_Projectile_Particles;                      // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hit_Location;                                      // 0x0950(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95C[0x4];                                      // 0x095C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Bottle_Smash_Audio_Cue;                            // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Ignite_Audio_Cue;                                  // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hit_Normal;                                        // 0x0970(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97C[0x4];                                      // 0x097C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ProjectileSpawnVectors;                            // 0x0980(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         SpawnedProjectileMinSpeed;                         // 0x0990(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SpawnedProjectileMaxSpeed;                         // 0x09B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ConeHalfAngleInDegrees;                            // 0x09D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         FireBallsToSpawn;                                  // 0x09F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CurieActivated;                                    // 0x0A10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11[0x7];                                      // 0x0A11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DoWeUseHomingProjectile;                           // 0x0A18(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                ReflectionVector;                                  // 0x0A38(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireflyProjectileAngleExtreme;                     // 0x0A44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireflyProjectileDirection;                        // 0x0A48(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireflyProjectileRadius_Min;                       // 0x0A54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireflyProjectileRadius_Max;                       // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireflyProjectileEndPoint;                         // 0x0A5C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumProjectileSpawned;                              // 0x0A68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumProjectilesToSpawn;                             // 0x0A6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewTemp;                                           // 0x0A70(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnteredWater;                                      // 0x0A7C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Hit;                                               // 0x0A7D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A7E[0x2];                                      // 0x0A7E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         Sound_EnterWater;                                  // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemToSpawn_Molotov;                               // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInteractWithWater;                              // 0x0A90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A91[0xF];                                      // 0x0A91(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnBGATransform;                                 // 0x0AA0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Athena_Grenade_MolotovCocktail(int32 EntryPoint);
	void Defer_BGA_Spawn();
	void HasEnteredWater();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit_0);
	void ReceiveBeginPlay();
	void OnCurieActive_7575DCC3440AA42836D7988BCA6485E5();
	void Drunk_Projectiles();
	void FireflyProjectileLogic();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_Grenade_MolotovCocktail_C">();
	}
	static class AB_Prj_Athena_Grenade_MolotovCocktail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_Grenade_MolotovCocktail_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_Grenade_MolotovCocktail_C) == 0x000010, "Wrong alignment on AB_Prj_Athena_Grenade_MolotovCocktail_C");
static_assert(sizeof(AB_Prj_Athena_Grenade_MolotovCocktail_C) == 0x000AD0, "Wrong size on AB_Prj_Athena_Grenade_MolotovCocktail_C");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, UberGraphFrame_B_Prj_Athena_Grenade_MolotovCocktail_C) == 0x000940, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::UberGraphFrame_B_Prj_Athena_Grenade_MolotovCocktail_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Niagara_Projectile_Particles) == 0x000948, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Niagara_Projectile_Particles' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Hit_Location) == 0x000950, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Hit_Location' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Bottle_Smash_Audio_Cue) == 0x000960, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Bottle_Smash_Audio_Cue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Ignite_Audio_Cue) == 0x000968, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Ignite_Audio_Cue' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Hit_Normal) == 0x000970, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Hit_Normal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ProjectileSpawnVectors) == 0x000980, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ProjectileSpawnVectors' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, SpawnedProjectileMinSpeed) == 0x000990, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::SpawnedProjectileMinSpeed' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, SpawnedProjectileMaxSpeed) == 0x0009B0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::SpawnedProjectileMaxSpeed' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ConeHalfAngleInDegrees) == 0x0009D0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ConeHalfAngleInDegrees' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireBallsToSpawn) == 0x0009F0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireBallsToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, CurieActivated) == 0x000A10, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::CurieActivated' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, DoWeUseHomingProjectile) == 0x000A18, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::DoWeUseHomingProjectile' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ReflectionVector) == 0x000A38, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ReflectionVector' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileAngleExtreme) == 0x000A44, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileAngleExtreme' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileDirection) == 0x000A48, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileDirection' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileRadius_Min) == 0x000A54, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileRadius_Min' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileRadius_Max) == 0x000A58, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileRadius_Max' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, FireflyProjectileEndPoint) == 0x000A5C, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::FireflyProjectileEndPoint' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, NumProjectileSpawned) == 0x000A68, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::NumProjectileSpawned' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, NumProjectilesToSpawn) == 0x000A6C, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::NumProjectilesToSpawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, NewTemp) == 0x000A70, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::NewTemp' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, EnteredWater) == 0x000A7C, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::EnteredWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Hit) == 0x000A7D, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Hit' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, Sound_EnterWater) == 0x000A80, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::Sound_EnterWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, ItemToSpawn_Molotov) == 0x000A88, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::ItemToSpawn_Molotov' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, CanInteractWithWater) == 0x000A90, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::CanInteractWithWater' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_Grenade_MolotovCocktail_C, SpawnBGATransform) == 0x000AA0, "Member 'AB_Prj_Athena_Grenade_MolotovCocktail_C::SpawnBGATransform' has a wrong offset!");

}

