#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_HighTower_Tapas_SkyStrike

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_HighTower_Tapas_SkyStrike.B_Prj_HighTower_Tapas_SkyStrike_C
// 0x00F0 (0x0968 - 0x0878)
class AB_Prj_HighTower_Tapas_SkyStrike_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        InAirSound;                                        // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 HighTower_Tapas_Axe;                               // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HitDamagable;                                      // 0x0898(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         OverlapBuildingRadius;                             // 0x08A0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      OverlapBuildingObjectType;                         // 0x08C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AActor*>                         OverlapBuildingActorsToIgnore;                     // 0x08D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 GE_EnvironmentalDamage;                            // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DestroyBuildingsTimer;                             // 0x08E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ProjectileVelocity;                                // 0x08F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DestroyBuildsTick;                                 // 0x0910(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DestroyBuildsBuffer;                               // 0x0914(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewVar_0;                                          // 0x0918(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_924[0x4];                                      // 0x0924(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Water_Impact_Sound;                                // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_KnockBack;                                      // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_PlayerDamage;                                   // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DamagePlayersWhileFalling;                         // 0x0940(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Stopped;                                           // 0x0960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HitWater;                                          // 0x0961(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_HighTower_Tapas_SkyStrike(int32 EntryPoint);
	void ApplyHammerEffects(TArray<class AActor*>& Array, bool AlwaysDamagePlayers);
	void HitGround(const struct FVector& GroundPos);
	void SnapToGround();
	void ReceiveBeginPlay();
	void DestroyOnTick();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_HighTower_Tapas_SkyStrike_C">();
	}
	static class AB_Prj_HighTower_Tapas_SkyStrike_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_HighTower_Tapas_SkyStrike_C>();
	}
};
static_assert(alignof(AB_Prj_HighTower_Tapas_SkyStrike_C) == 0x000008, "Wrong alignment on AB_Prj_HighTower_Tapas_SkyStrike_C");
static_assert(sizeof(AB_Prj_HighTower_Tapas_SkyStrike_C) == 0x000968, "Wrong size on AB_Prj_HighTower_Tapas_SkyStrike_C");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, UberGraphFrame) == 0x000878, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, InAirSound) == 0x000880, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::InAirSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, ParticleSystem) == 0x000888, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, HighTower_Tapas_Axe) == 0x000890, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::HighTower_Tapas_Axe' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, HitDamagable) == 0x000898, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::HitDamagable' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, OverlapBuildingRadius) == 0x0008A0, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::OverlapBuildingRadius' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, OverlapBuildingObjectType) == 0x0008C0, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::OverlapBuildingObjectType' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, OverlapBuildingActorsToIgnore) == 0x0008D0, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::OverlapBuildingActorsToIgnore' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, GE_EnvironmentalDamage) == 0x0008E0, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::GE_EnvironmentalDamage' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, DestroyBuildingsTimer) == 0x0008E8, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::DestroyBuildingsTimer' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, ProjectileVelocity) == 0x0008F0, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::ProjectileVelocity' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, DestroyBuildsTick) == 0x000910, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::DestroyBuildsTick' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, DestroyBuildsBuffer) == 0x000914, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::DestroyBuildsBuffer' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, NewVar_0) == 0x000918, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, Water_Impact_Sound) == 0x000928, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::Water_Impact_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, GE_KnockBack) == 0x000930, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::GE_KnockBack' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, GE_PlayerDamage) == 0x000938, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::GE_PlayerDamage' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, DamagePlayersWhileFalling) == 0x000940, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::DamagePlayersWhileFalling' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, Stopped) == 0x000960, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::Stopped' has a wrong offset!");
static_assert(offsetof(AB_Prj_HighTower_Tapas_SkyStrike_C, HitWater) == 0x000961, "Member 'AB_Prj_HighTower_Tapas_SkyStrike_C::HitWater' has a wrong offset!");

}

