#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Dual_Generic_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "En_ShellTypes_01_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Ranged_Dual_Generic_Athena.B_Ranged_Dual_Generic_Athena_C
// 0x0230 (0x12C8 - 0x1098)
class AB_Ranged_Dual_Generic_Athena_C : public AFortWeaponRangedDual
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               LeftReload_Empty_;                                 // 0x10A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LeftMuzzle_Empty_;                                 // 0x10A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Reload_Empty_;                                     // 0x10B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ScopeMesh1P;                                       // 0x10B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Muzzle_Empty_;                                     // 0x10C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AnimateScopePostProcess_DownSightPostProcessAmount_BF13147D4D2F78A8F8CECFABA0F6D055; // 0x10C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AnimateScopePostProcess__Direction_BF13147D4D2F78A8F8CECFABA0F6D055; // 0x10CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10CD[0x3];                                     // 0x10CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AnimateScopePostProcess;                           // 0x10D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem;                              // 0x10D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffect;                     // 0x10E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffectIcon;                 // 0x10E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDestroyEffect;                                  // 0x10F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Use_Reload_Particles;                              // 0x10F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F2[0x6];                                     // 0x10F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Reload_ParticleSystem;                             // 0x10F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPlayFXTime;                                    // 0x1100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinPlayFXTime;                                     // 0x1104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnedShellsPS_R;                                 // 0x1108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnedShellsPS_L;                                 // 0x1110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnFire_;                                  // 0x1118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseShellsOnReload_;                                // 0x1119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseShellsOnPump_;                                  // 0x111A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111B[0x5];                                     // 0x111B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ShellsParticleSystemTemplate;                      // 0x1120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReloadSocketName;                                  // 0x1128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortAIPawn*>                    Array_Of_Active_Enemy_AI;                          // 0x1130(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Scope___Render_Enemies_To_Custom_Depth_Buffer;     // 0x1140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_1141[0x3];                                     // 0x1141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Shells_Socket_Name;                                // 0x1144(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	En_ShellTypes_01                              ShellTypeSelect;                                   // 0x114C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114D[0x3];                                     // 0x114D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Shells_Spawn_Rate_Scale;                           // 0x1150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShellsRotationRate;                                // 0x1154(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Velocity;                                   // 0x1160(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Gravity;                                    // 0x116C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Lifetime;                                   // 0x1178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Size;                                       // 0x117C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Time_Dilation;                              // 0x1188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_Scope_Vignette_Blur_Screen_Percentage;      // 0x118C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scope_Camera_Offset_Amount;                        // 0x1190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SmallShells;                                       // 0x1194(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MediumShells;                                      // 0x1195(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LargeShells;                                       // 0x1196(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShotgunShells;                                     // 0x1197(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnergyShells;                                      // 0x1198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1199[0x3];                                     // 0x1199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Inherit_Parent_Velocity;                           // 0x119C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Radius;                                // 0x11A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Height;                                // 0x11A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugShellsSocket_;                                // 0x11A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A9[0x7];                                     // 0x11A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_ScopeZoomIn;                                 // 0x11B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_ScopeZoomOut;                                // 0x11B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ReticleHUDElementTags;                             // 0x11C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_Wind_Enabled;                                   // 0x11E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11E1[0x7];                                     // 0x11E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        MuzzleWindParticleSystem;                          // 0x11E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem1P;                            // 0x11F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHideReticleAfterDelay;                       // 0x11F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11F9[0x7];                                     // 0x11F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               MuzzleWindParticleSpawned;                         // 0x1200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StencilBufferValue;                                // 0x1208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDualWeaponHand                               LastHandFired;                                     // 0x120C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldReEnableLeftWeapVis;                        // 0x120D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bForceFeedbackShouldPersist;                       // 0x120E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_120F[0x1];                                     // 0x120F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Shell_Color;                                       // 0x1210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_PS_Max_Draw_Distance;                       // 0x1220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1224[0x4];                                     // 0x1224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<En_ShellTypes_01, bool>                  Shell_Bools;                                       // 0x1228(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<En_ShellTypes_01, class FName>           Shell_Burst_Names;                                 // 0x1278(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Ranged_Dual_Generic_Athena(int32 EntryPoint);
	void ShellEjectionOff();
	void Bind_on_Effects_Quality();
	void ShellEjectionFixOn();
	void BindOnHandFired();
	void HandFired(EDualWeaponHand Hand, bool bPersistantFire);
	void ForceScopeFX();
	void UnhideFirstPersonStuffPart1();
	void UnhideFirstPersonStuffPart2();
	void HideThirdPersonStuff();
	void AbortScopeFX();
	void HideFirstPersonStuff();
	void PlayScopePP();
	void UnhideThirdPersonStuff();
	void ResetDoonceScopeSound();
	void ReverseScopePP();
	void ShowWeapon();
	void HideWeapon();
	void ShowWeaponMesh();
	void HideWeaponMesh();
	void ReceiveBeginPlay();
	void SetWeaponPierceThrough_ClientRep(bool Enable, int32 TargetLimit);
	void SetWeaponPierceThrough(bool Enable, int32 TargetLimit);
	void OnEquippedWeaponDestory();
	void ShellsON__onPump_();
	void OnWeaponAttached();
	void Update_Enemy_Custom_Depths(bool Enable_Or_Disable, int32 StencilBufferValue_0);
	void InitializeScopeVariables();
	void K2_OnUnEquip();
	void OnSetTargeting(bool bNewIsTargeting);
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void OnStopWeaponFireFX();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void AnimateScopePostProcess__UpdateFunc();
	void AnimateScopePostProcess__FinishedFunc();
	void UserConstructionScript();
	void AddRandomScale(bool OffHand);
	void SetWpnRarity();
	void Muzzle_Flash_FX(bool Persistent_Fire, bool OffHand);
	void Muzzle_Play_Reload_FX(EFortReloadFXState Selection);
	void UpdateShellEmittersFX(class UFXSystemComponent* Target);
	void SetupShellFX(bool OffHand);
	void DeactivateShellsFX();
	void ActivateShellsFX(bool Bool, bool OffHand);
	void ActivateReloadSmokeFX();
	void DeactivateReloadSmokeFX();
	void DeactivateMuzzleFX();
	void ActivateOrDeactivateWindParticle(bool bNewActive);
	void HideReticle();
	void ShowReticle();
	void SetPostProcessParams(float InputPin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Ranged_Dual_Generic_Athena_C">();
	}
	static class AB_Ranged_Dual_Generic_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Ranged_Dual_Generic_Athena_C>();
	}
};
static_assert(alignof(AB_Ranged_Dual_Generic_Athena_C) == 0x000008, "Wrong alignment on AB_Ranged_Dual_Generic_Athena_C");
static_assert(sizeof(AB_Ranged_Dual_Generic_Athena_C) == 0x0012C8, "Wrong size on AB_Ranged_Dual_Generic_Athena_C");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UberGraphFrame) == 0x001098, "Member 'AB_Ranged_Dual_Generic_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LeftReload_Empty_) == 0x0010A0, "Member 'AB_Ranged_Dual_Generic_Athena_C::LeftReload_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LeftMuzzle_Empty_) == 0x0010A8, "Member 'AB_Ranged_Dual_Generic_Athena_C::LeftMuzzle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Reload_Empty_) == 0x0010B0, "Member 'AB_Ranged_Dual_Generic_Athena_C::Reload_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ScopeMesh1P) == 0x0010B8, "Member 'AB_Ranged_Dual_Generic_Athena_C::ScopeMesh1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Muzzle_Empty_) == 0x0010C0, "Member 'AB_Ranged_Dual_Generic_Athena_C::Muzzle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, AnimateScopePostProcess_DownSightPostProcessAmount_BF13147D4D2F78A8F8CECFABA0F6D055) == 0x0010C8, "Member 'AB_Ranged_Dual_Generic_Athena_C::AnimateScopePostProcess_DownSightPostProcessAmount_BF13147D4D2F78A8F8CECFABA0F6D055' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, AnimateScopePostProcess__Direction_BF13147D4D2F78A8F8CECFABA0F6D055) == 0x0010CC, "Member 'AB_Ranged_Dual_Generic_Athena_C::AnimateScopePostProcess__Direction_BF13147D4D2F78A8F8CECFABA0F6D055' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, AnimateScopePostProcess) == 0x0010D0, "Member 'AB_Ranged_Dual_Generic_Athena_C::AnimateScopePostProcess' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MuzzleParticleSystem) == 0x0010D8, "Member 'AB_Ranged_Dual_Generic_Athena_C::MuzzleParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, WeaponDurabilityDestroyEffect) == 0x0010E0, "Member 'AB_Ranged_Dual_Generic_Athena_C::WeaponDurabilityDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, WeaponDurabilityDestroyEffectIcon) == 0x0010E8, "Member 'AB_Ranged_Dual_Generic_Athena_C::WeaponDurabilityDestroyEffectIcon' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UseDestroyEffect) == 0x0010F0, "Member 'AB_Ranged_Dual_Generic_Athena_C::UseDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Use_Reload_Particles) == 0x0010F1, "Member 'AB_Ranged_Dual_Generic_Athena_C::Use_Reload_Particles' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Reload_ParticleSystem) == 0x0010F8, "Member 'AB_Ranged_Dual_Generic_Athena_C::Reload_ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LastPlayFXTime) == 0x001100, "Member 'AB_Ranged_Dual_Generic_Athena_C::LastPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MinPlayFXTime) == 0x001104, "Member 'AB_Ranged_Dual_Generic_Athena_C::MinPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, SpawnedShellsPS_R) == 0x001108, "Member 'AB_Ranged_Dual_Generic_Athena_C::SpawnedShellsPS_R' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, SpawnedShellsPS_L) == 0x001110, "Member 'AB_Ranged_Dual_Generic_Athena_C::SpawnedShellsPS_L' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UseShellsOnFire_) == 0x001118, "Member 'AB_Ranged_Dual_Generic_Athena_C::UseShellsOnFire_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UseShellsOnReload_) == 0x001119, "Member 'AB_Ranged_Dual_Generic_Athena_C::UseShellsOnReload_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, UseShellsOnPump_) == 0x00111A, "Member 'AB_Ranged_Dual_Generic_Athena_C::UseShellsOnPump_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShellsParticleSystemTemplate) == 0x001120, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShellsParticleSystemTemplate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ReloadSocketName) == 0x001128, "Member 'AB_Ranged_Dual_Generic_Athena_C::ReloadSocketName' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Array_Of_Active_Enemy_AI) == 0x001130, "Member 'AB_Ranged_Dual_Generic_Athena_C::Array_Of_Active_Enemy_AI' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Scope___Render_Enemies_To_Custom_Depth_Buffer) == 0x001140, "Member 'AB_Ranged_Dual_Generic_Athena_C::Scope___Render_Enemies_To_Custom_Depth_Buffer' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Socket_Name) == 0x001144, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShellTypeSelect) == 0x00114C, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShellTypeSelect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Spawn_Rate_Scale) == 0x001150, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Spawn_Rate_Scale' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShellsRotationRate) == 0x001154, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShellsRotationRate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Velocity) == 0x001160, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Gravity) == 0x00116C, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Gravity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Lifetime) == 0x001178, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Size) == 0x00117C, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Size' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_Time_Dilation) == 0x001188, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_Time_Dilation' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Target_Scope_Vignette_Blur_Screen_Percentage) == 0x00118C, "Member 'AB_Ranged_Dual_Generic_Athena_C::Target_Scope_Vignette_Blur_Screen_Percentage' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Scope_Camera_Offset_Amount) == 0x001190, "Member 'AB_Ranged_Dual_Generic_Athena_C::Scope_Camera_Offset_Amount' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, SmallShells) == 0x001194, "Member 'AB_Ranged_Dual_Generic_Athena_C::SmallShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MediumShells) == 0x001195, "Member 'AB_Ranged_Dual_Generic_Athena_C::MediumShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LargeShells) == 0x001196, "Member 'AB_Ranged_Dual_Generic_Athena_C::LargeShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShotgunShells) == 0x001197, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShotgunShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, EnergyShells) == 0x001198, "Member 'AB_Ranged_Dual_Generic_Athena_C::EnergyShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Inherit_Parent_Velocity) == 0x00119C, "Member 'AB_Ranged_Dual_Generic_Athena_C::Inherit_Parent_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Cylindrical_Radius) == 0x0011A0, "Member 'AB_Ranged_Dual_Generic_Athena_C::Cylindrical_Radius' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Cylindrical_Height) == 0x0011A4, "Member 'AB_Ranged_Dual_Generic_Athena_C::Cylindrical_Height' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, DebugShellsSocket_) == 0x0011A8, "Member 'AB_Ranged_Dual_Generic_Athena_C::DebugShellsSocket_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Sound_ScopeZoomIn) == 0x0011B0, "Member 'AB_Ranged_Dual_Generic_Athena_C::Sound_ScopeZoomIn' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Sound_ScopeZoomOut) == 0x0011B8, "Member 'AB_Ranged_Dual_Generic_Athena_C::Sound_ScopeZoomOut' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ReticleHUDElementTags) == 0x0011C0, "Member 'AB_Ranged_Dual_Generic_Athena_C::ReticleHUDElementTags' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Is_Wind_Enabled) == 0x0011E0, "Member 'AB_Ranged_Dual_Generic_Athena_C::Is_Wind_Enabled' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MuzzleWindParticleSystem) == 0x0011E8, "Member 'AB_Ranged_Dual_Generic_Athena_C::MuzzleWindParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MuzzleParticleSystem1P) == 0x0011F0, "Member 'AB_Ranged_Dual_Generic_Athena_C::MuzzleParticleSystem1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, ShouldHideReticleAfterDelay) == 0x0011F8, "Member 'AB_Ranged_Dual_Generic_Athena_C::ShouldHideReticleAfterDelay' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, MuzzleWindParticleSpawned) == 0x001200, "Member 'AB_Ranged_Dual_Generic_Athena_C::MuzzleWindParticleSpawned' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, StencilBufferValue) == 0x001208, "Member 'AB_Ranged_Dual_Generic_Athena_C::StencilBufferValue' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, LastHandFired) == 0x00120C, "Member 'AB_Ranged_Dual_Generic_Athena_C::LastHandFired' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, bShouldReEnableLeftWeapVis) == 0x00120D, "Member 'AB_Ranged_Dual_Generic_Athena_C::bShouldReEnableLeftWeapVis' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, bForceFeedbackShouldPersist) == 0x00120E, "Member 'AB_Ranged_Dual_Generic_Athena_C::bForceFeedbackShouldPersist' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shell_Color) == 0x001210, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shell_Color' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shells_PS_Max_Draw_Distance) == 0x001220, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shells_PS_Max_Draw_Distance' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shell_Bools) == 0x001228, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shell_Bools' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_Athena_C, Shell_Burst_Names) == 0x001278, "Member 'AB_Ranged_Dual_Generic_Athena_C::Shell_Burst_Names' has a wrong offset!");

}

