#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battlepass_MusicController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_TimeSynthController_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Battlepass_MusicController.Battlepass_MusicController_C
// 0x0030 (0x02C0 - 0x0290)
class ABattlepass_MusicController_C final : public ABP_TimeSynthController_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Battlepass_MusicController_C;       // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_TimeSynthTrackComponent_C*          BP_TimeSynthTrackComponent;                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Fade_In_Time_Volume_847BDC9D4F3F7CD31E902F8FB845FE8C; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Fade_In_Time__Direction_847BDC9D4F3F7CD31E902F8FB845FE8C; // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Fade_In_Time;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeSynthClip*                         Clip1;                                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeSynthClip*                         Clip2;                                             // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Battlepass_MusicController(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Fade_In_Time__UpdateFunc();
	void Fade_In_Time__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battlepass_MusicController_C">();
	}
	static class ABattlepass_MusicController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattlepass_MusicController_C>();
	}
};
static_assert(alignof(ABattlepass_MusicController_C) == 0x000008, "Wrong alignment on ABattlepass_MusicController_C");
static_assert(sizeof(ABattlepass_MusicController_C) == 0x0002C0, "Wrong size on ABattlepass_MusicController_C");
static_assert(offsetof(ABattlepass_MusicController_C, UberGraphFrame_Battlepass_MusicController_C) == 0x000290, "Member 'ABattlepass_MusicController_C::UberGraphFrame_Battlepass_MusicController_C' has a wrong offset!");
static_assert(offsetof(ABattlepass_MusicController_C, BP_TimeSynthTrackComponent) == 0x000298, "Member 'ABattlepass_MusicController_C::BP_TimeSynthTrackComponent' has a wrong offset!");
static_assert(offsetof(ABattlepass_MusicController_C, Fade_In_Time_Volume_847BDC9D4F3F7CD31E902F8FB845FE8C) == 0x0002A0, "Member 'ABattlepass_MusicController_C::Fade_In_Time_Volume_847BDC9D4F3F7CD31E902F8FB845FE8C' has a wrong offset!");
static_assert(offsetof(ABattlepass_MusicController_C, Fade_In_Time__Direction_847BDC9D4F3F7CD31E902F8FB845FE8C) == 0x0002A4, "Member 'ABattlepass_MusicController_C::Fade_In_Time__Direction_847BDC9D4F3F7CD31E902F8FB845FE8C' has a wrong offset!");
static_assert(offsetof(ABattlepass_MusicController_C, Fade_In_Time) == 0x0002A8, "Member 'ABattlepass_MusicController_C::Fade_In_Time' has a wrong offset!");
static_assert(offsetof(ABattlepass_MusicController_C, Clip1) == 0x0002B0, "Member 'ABattlepass_MusicController_C::Clip1' has a wrong offset!");
static_assert(offsetof(ABattlepass_MusicController_C, Clip2) == 0x0002B8, "Member 'ABattlepass_MusicController_C::Clip2' has a wrong offset!");

}

