#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_HeldWeapon_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BGA_HeldObject_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C
// 0x0020 (0x09C0 - 0x09A0)
#pragma pack(push, 0x1)
class alignas(0x10) ABGA_HeldWeapon_Parent_C : public ABGA_HeldObject_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_HeldWeapon_Parent_C;            // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bHeldWeaponEquipped;                               // 0x09A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          bHeldWeaponVisiblePropagateToChildren;             // 0x09A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9AA[0x6];                                      // 0x09AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        HeldWeaponVisualComponent;                         // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_HeldWeapon_Parent(int32 EntryPoint);
	void OnHeldWeaponEquipToggled(bool bEquipped);
	void HeldWeaponSetEquipped(bool bEquipped);
	void OnRep_bHeldWeaponEquipped();
	void SetHeldWeaponVisualComponent(class USceneComponent* HeldWeaponVisualComponent_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_HeldWeapon_Parent_C">();
	}
	static class ABGA_HeldWeapon_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_HeldWeapon_Parent_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABGA_HeldWeapon_Parent_C) == 0x000010, "Wrong alignment on ABGA_HeldWeapon_Parent_C");
static_assert(sizeof(ABGA_HeldWeapon_Parent_C) == 0x0009C0, "Wrong size on ABGA_HeldWeapon_Parent_C");
static_assert(offsetof(ABGA_HeldWeapon_Parent_C, UberGraphFrame_BGA_HeldWeapon_Parent_C) == 0x0009A0, "Member 'ABGA_HeldWeapon_Parent_C::UberGraphFrame_BGA_HeldWeapon_Parent_C' has a wrong offset!");
static_assert(offsetof(ABGA_HeldWeapon_Parent_C, bHeldWeaponEquipped) == 0x0009A8, "Member 'ABGA_HeldWeapon_Parent_C::bHeldWeaponEquipped' has a wrong offset!");
static_assert(offsetof(ABGA_HeldWeapon_Parent_C, bHeldWeaponVisiblePropagateToChildren) == 0x0009A9, "Member 'ABGA_HeldWeapon_Parent_C::bHeldWeaponVisiblePropagateToChildren' has a wrong offset!");
static_assert(offsetof(ABGA_HeldWeapon_Parent_C, HeldWeaponVisualComponent) == 0x0009B0, "Member 'ABGA_HeldWeapon_Parent_C::HeldWeaponVisualComponent' has a wrong offset!");

}

