#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_HighTower_Date_BallLightning_FireMesh

#include "Basic.hpp"


namespace SDK::Params
{

// Function BGA_HighTower_Date_BallLightning_FireMesh.BGA_HighTower_Date_BallLightning_FireMesh_C.ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh
// 0x0004 (0x0004 - 0x0000)
struct BGA_HighTower_Date_BallLightning_FireMesh_C_ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_HighTower_Date_BallLightning_FireMesh_C_ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh) == 0x000004, "Wrong alignment on BGA_HighTower_Date_BallLightning_FireMesh_C_ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh");
static_assert(sizeof(BGA_HighTower_Date_BallLightning_FireMesh_C_ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh) == 0x000004, "Wrong size on BGA_HighTower_Date_BallLightning_FireMesh_C_ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh");
static_assert(offsetof(BGA_HighTower_Date_BallLightning_FireMesh_C_ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh, EntryPoint) == 0x000000, "Member 'BGA_HighTower_Date_BallLightning_FireMesh_C_ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh::EntryPoint' has a wrong offset!");

// Function BGA_HighTower_Date_BallLightning_FireMesh.BGA_HighTower_Date_BallLightning_FireMesh_C.UserConstructionScript
// 0x0014 (0x0014 - 0x0000)
struct BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript) == 0x000004, "Wrong alignment on BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript");
static_assert(sizeof(BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript) == 0x000014, "Wrong size on BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript");
static_assert(offsetof(BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000004, "Member 'BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000008, "Member 'BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x00000C, "Member 'BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

}

