#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_HighTower_Grape_BrambleShield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_HighTower_Grape_BrambleShield.BGA_HighTower_Grape_BrambleShield_C
// 0x03B0 (0x0B70 - 0x07C0)
class ABGA_HighTower_Grape_BrambleShield_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       FortProjectileMovement;                            // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x07E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DirectHitThresholdWalls;                           // 0x07E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DirectHitThresholdFloor;                           // 0x0808(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Ended;                                             // 0x0828(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Destroyed;                                         // 0x0829(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A[0x2];                                      // 0x082A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Delay_EndBeforeDeath;                              // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Destroyed;                                      // 0x0830(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Spawn;                                          // 0x0838(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Despawn;                                        // 0x0840(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Damaged;                                        // 0x0848(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Impact;                                         // 0x0850(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delay_DamageGC;                                    // 0x0858(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastPos;                                           // 0x085C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SphereRadius;                                      // 0x0868(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OneOverSphereRadius;                               // 0x086C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MinVelocityForDestruction;                         // 0x0870(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         BreakingWallBounceMultiplier;                      // 0x0890(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NonBreakingWallBounceMultiplier;                   // 0x08B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         BreakingFloorBounceMultiplier;                     // 0x08D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NonBreakingFloorBounceMultiplier;                  // 0x08F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         LookForwardSecondsInterval;                        // 0x0910(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookForwardAmount;                                 // 0x0914(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0918(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      TraceObjectTypes;                                  // 0x0928(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UClass*>                         GE_BuildingDestroy;                                // 0x0938(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UClass*>                         GE_KnockBack;                                      // 0x0948(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AActor*                                 AttachedParent;                                    // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebug;                                         // 0x0960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961[0x3];                                      // 0x0961(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SphereColorThisUpdate;                             // 0x0964(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GE_Location;                                       // 0x0974(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GE_ImpactLocation;                                 // 0x0980(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GE_ImpactNormal;                                   // 0x098C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusReductionForAvoidingFloors;                  // 0x0998(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAheadWorldOffset;                              // 0x099C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebugLaunch;                                   // 0x09A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A9[0x3];                                      // 0x09A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugDurationThisFrame;                            // 0x09AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Att_MaxHealth;                                     // 0x09B0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                     Att_CurrentHealth;                                 // 0x09E8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         MaxImpactFrequency;                                // 0x0A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ImpactEnabled;                                     // 0x0A24(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A25[0x3];                                      // 0x0A25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThicknessMult;                                     // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2C[0x4];                                      // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinVertSpeedForBounce;                             // 0x0A30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          BreakOnDirectWallHit;                              // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BreakOnDirectFloorHit;                             // 0x0A51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BreakOnIndirectWallHit;                            // 0x0A52(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BreakOnIndirectFloorHit;                           // 0x0A53(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FHitResult                             NullHit;                                           // 0x0A54(0x008C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTimerHandle                           Timer_RollingBallLookAheadUpdate;                  // 0x0AE0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanImpactAffectVelocity;                           // 0x0AE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE9[0x3];                                      // 0x0AE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BallPostLaunchCollisionDelay;                      // 0x0AEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasSetLastPos;                                    // 0x0AF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF1[0x3];                                      // 0x0AF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VelThisFrame;                                      // 0x0AF4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactGCFrequencyDelay;                            // 0x0B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B04[0x4];                                      // 0x0B04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_TimeBeforeFirstHeal;                           // 0x0B08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_TimeBetweenHeals;                              // 0x0B28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_NumberOfHeals;                                 // 0x0B48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         AddedFailsafeTime;                                 // 0x0B68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield(int32 EntryPoint);
	void SetFailsafeLifeSpan();
	void StartDespawnFX();
	void TurnOnGravity(const struct FVector& VelocityIn);
	void ExecuteImpactGCN(const struct FVector& ImpactLoc, const struct FVector& ImpactNomral);
	void SetCanBounce();
	void SendQuestProgress();
	void UpdateBallRolling();
	void LookAheadUpdateTimer();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();
	void EndBramble(bool StartEndFXOnly);
	void OnRep_Hide();
	void Get_Rot_Axis_from_Delta(const struct FVector& FrameLocDelta, struct FVector* RotAxis);
	void Handle_Surface_Impact(class AActor* Optional_HitActor, const struct FVector& ImpactLocation, const struct FVector& ImpactNormal, const struct FVector& CurrentVelocityNormalized, const struct FVector& CurrentVelocity, bool* Bounced);
	void Damage_Or_Destroy_Building_Piece(class AActor* BuildingPieceActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_HighTower_Grape_BrambleShield_C">();
	}
	static class ABGA_HighTower_Grape_BrambleShield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_HighTower_Grape_BrambleShield_C>();
	}
};
static_assert(alignof(ABGA_HighTower_Grape_BrambleShield_C) == 0x000008, "Wrong alignment on ABGA_HighTower_Grape_BrambleShield_C");
static_assert(sizeof(ABGA_HighTower_Grape_BrambleShield_C) == 0x000B70, "Wrong size on ABGA_HighTower_Grape_BrambleShield_C");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, UberGraphFrame) == 0x0007C0, "Member 'ABGA_HighTower_Grape_BrambleShield_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Sphere) == 0x0007C8, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, FortProjectileMovement) == 0x0007D0, "Member 'ABGA_HighTower_Grape_BrambleShield_C::FortProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Niagara) == 0x0007D8, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Hide) == 0x0007E0, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Hide' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, DirectHitThresholdWalls) == 0x0007E8, "Member 'ABGA_HighTower_Grape_BrambleShield_C::DirectHitThresholdWalls' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, DirectHitThresholdFloor) == 0x000808, "Member 'ABGA_HighTower_Grape_BrambleShield_C::DirectHitThresholdFloor' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Ended) == 0x000828, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Ended' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Destroyed) == 0x000829, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Destroyed' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Delay_EndBeforeDeath) == 0x00082C, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Delay_EndBeforeDeath' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GC_Destroyed) == 0x000830, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GC_Destroyed' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GC_Spawn) == 0x000838, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GC_Spawn' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GC_Despawn) == 0x000840, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GC_Despawn' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GC_Damaged) == 0x000848, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GC_Damaged' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GC_Impact) == 0x000850, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GC_Impact' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Delay_DamageGC) == 0x000858, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Delay_DamageGC' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, LastPos) == 0x00085C, "Member 'ABGA_HighTower_Grape_BrambleShield_C::LastPos' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, SphereRadius) == 0x000868, "Member 'ABGA_HighTower_Grape_BrambleShield_C::SphereRadius' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, OneOverSphereRadius) == 0x00086C, "Member 'ABGA_HighTower_Grape_BrambleShield_C::OneOverSphereRadius' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, MinVelocityForDestruction) == 0x000870, "Member 'ABGA_HighTower_Grape_BrambleShield_C::MinVelocityForDestruction' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, BreakingWallBounceMultiplier) == 0x000890, "Member 'ABGA_HighTower_Grape_BrambleShield_C::BreakingWallBounceMultiplier' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, NonBreakingWallBounceMultiplier) == 0x0008B0, "Member 'ABGA_HighTower_Grape_BrambleShield_C::NonBreakingWallBounceMultiplier' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, BreakingFloorBounceMultiplier) == 0x0008D0, "Member 'ABGA_HighTower_Grape_BrambleShield_C::BreakingFloorBounceMultiplier' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, NonBreakingFloorBounceMultiplier) == 0x0008F0, "Member 'ABGA_HighTower_Grape_BrambleShield_C::NonBreakingFloorBounceMultiplier' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, LookForwardSecondsInterval) == 0x000910, "Member 'ABGA_HighTower_Grape_BrambleShield_C::LookForwardSecondsInterval' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, LookForwardAmount) == 0x000914, "Member 'ABGA_HighTower_Grape_BrambleShield_C::LookForwardAmount' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, ActorsToIgnore) == 0x000918, "Member 'ABGA_HighTower_Grape_BrambleShield_C::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, TraceObjectTypes) == 0x000928, "Member 'ABGA_HighTower_Grape_BrambleShield_C::TraceObjectTypes' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GE_BuildingDestroy) == 0x000938, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GE_BuildingDestroy' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GE_KnockBack) == 0x000948, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GE_KnockBack' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, AttachedParent) == 0x000958, "Member 'ABGA_HighTower_Grape_BrambleShield_C::AttachedParent' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, DrawDebug) == 0x000960, "Member 'ABGA_HighTower_Grape_BrambleShield_C::DrawDebug' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, SphereColorThisUpdate) == 0x000964, "Member 'ABGA_HighTower_Grape_BrambleShield_C::SphereColorThisUpdate' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GE_Location) == 0x000974, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GE_Location' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GE_ImpactLocation) == 0x000980, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GE_ImpactLocation' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, GE_ImpactNormal) == 0x00098C, "Member 'ABGA_HighTower_Grape_BrambleShield_C::GE_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, RadiusReductionForAvoidingFloors) == 0x000998, "Member 'ABGA_HighTower_Grape_BrambleShield_C::RadiusReductionForAvoidingFloors' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, LookAheadWorldOffset) == 0x00099C, "Member 'ABGA_HighTower_Grape_BrambleShield_C::LookAheadWorldOffset' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, DrawDebugLaunch) == 0x0009A8, "Member 'ABGA_HighTower_Grape_BrambleShield_C::DrawDebugLaunch' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, DebugDurationThisFrame) == 0x0009AC, "Member 'ABGA_HighTower_Grape_BrambleShield_C::DebugDurationThisFrame' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Att_MaxHealth) == 0x0009B0, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Att_MaxHealth' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Att_CurrentHealth) == 0x0009E8, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Att_CurrentHealth' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, MaxImpactFrequency) == 0x000A20, "Member 'ABGA_HighTower_Grape_BrambleShield_C::MaxImpactFrequency' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, ImpactEnabled) == 0x000A24, "Member 'ABGA_HighTower_Grape_BrambleShield_C::ImpactEnabled' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, ThicknessMult) == 0x000A28, "Member 'ABGA_HighTower_Grape_BrambleShield_C::ThicknessMult' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, MinVertSpeedForBounce) == 0x000A30, "Member 'ABGA_HighTower_Grape_BrambleShield_C::MinVertSpeedForBounce' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, BreakOnDirectWallHit) == 0x000A50, "Member 'ABGA_HighTower_Grape_BrambleShield_C::BreakOnDirectWallHit' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, BreakOnDirectFloorHit) == 0x000A51, "Member 'ABGA_HighTower_Grape_BrambleShield_C::BreakOnDirectFloorHit' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, BreakOnIndirectWallHit) == 0x000A52, "Member 'ABGA_HighTower_Grape_BrambleShield_C::BreakOnIndirectWallHit' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, BreakOnIndirectFloorHit) == 0x000A53, "Member 'ABGA_HighTower_Grape_BrambleShield_C::BreakOnIndirectFloorHit' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, NullHit) == 0x000A54, "Member 'ABGA_HighTower_Grape_BrambleShield_C::NullHit' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Timer_RollingBallLookAheadUpdate) == 0x000AE0, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Timer_RollingBallLookAheadUpdate' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, CanImpactAffectVelocity) == 0x000AE8, "Member 'ABGA_HighTower_Grape_BrambleShield_C::CanImpactAffectVelocity' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, BallPostLaunchCollisionDelay) == 0x000AEC, "Member 'ABGA_HighTower_Grape_BrambleShield_C::BallPostLaunchCollisionDelay' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, bHasSetLastPos) == 0x000AF0, "Member 'ABGA_HighTower_Grape_BrambleShield_C::bHasSetLastPos' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, VelThisFrame) == 0x000AF4, "Member 'ABGA_HighTower_Grape_BrambleShield_C::VelThisFrame' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, ImpactGCFrequencyDelay) == 0x000B00, "Member 'ABGA_HighTower_Grape_BrambleShield_C::ImpactGCFrequencyDelay' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Row_TimeBeforeFirstHeal) == 0x000B08, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Row_TimeBeforeFirstHeal' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Row_TimeBetweenHeals) == 0x000B28, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Row_TimeBetweenHeals' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, Row_NumberOfHeals) == 0x000B48, "Member 'ABGA_HighTower_Grape_BrambleShield_C::Row_NumberOfHeals' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Grape_BrambleShield_C, AddedFailsafeTime) == 0x000B68, "Member 'ABGA_HighTower_Grape_BrambleShield_C::AddedFailsafeTime' has a wrong offset!");

}

