#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_HighTower_Grape_BrambleShield

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_HighTower_Grape_BrambleShield.BGA_HighTower_Grape_BrambleShield_C.ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield
// 0x0738 (0x0738 - 0x0000)
struct BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_1;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x0008(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x0034(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x00D0(0x0018)()
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0178(0x00B8)(ContainsInstancedReference)
	float                                         K2Node_Event_Damage;                               // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0238(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0264(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0300(0x0018)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x035C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_StartEndFXOnly;                 // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_386[0x2];                                      // 0x0386(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03DC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EE[0x2];                                      // 0x03EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0400(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_413[0x1];                                      // 0x0413(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_ImpactLoc;                      // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpactNomral;                   // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_VelocityIn;                     // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x045C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_485[0x3];                                      // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x04A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x04C0(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x04D4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0565(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_566[0x2];                                      // 0x0566(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0588(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0594(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x05CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Handle_Surface_Impact_Bounced;            // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FA[0x2];                                      // 0x05FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x05FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_HighTower_Grape_BrambleShield_C*   K2Node_DynamicCast_AsBGA_High_Tower_Grape_Bramble_Shield; // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_DynamicCast_AsFort_Athena_Vehicle;          // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0638(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642[0x6];                                      // 0x0642(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0648(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701[0x3];                                      // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_709[0x3];                                      // 0x0709(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0724(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_725[0x3];                                      // 0x0725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield) == 0x000008, "Wrong alignment on BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield");
static_assert(sizeof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield) == 0x000738, "Wrong size on BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, EntryPoint) == 0x000000, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_Damage_1) == 0x000004, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_DamageTags_1) == 0x000008, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_Momentum_1) == 0x000028, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_HitInfo_1) == 0x000034, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_InstigatedBy_1) == 0x0000C0, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_DamageCauser_1) == 0x0000C8, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_EffectContext_1) == 0x0000D0, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000E8, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F0, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000F1, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_Time) == 0x0000F4, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_Distance) == 0x0000F8, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_Location) == 0x0000FC, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_ImpactPoint) == 0x000108, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_Normal) == 0x000114, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_ImpactNormal) == 0x000120, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_PhysMat) == 0x000130, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_HitActor) == 0x000138, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_HitComponent) == 0x000140, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_HitBoneName) == 0x000148, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_HitItem) == 0x000150, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_ElementIndex) == 0x000154, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_FaceIndex) == 0x000158, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_TraceStart) == 0x00015C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BreakHitResult_TraceEnd) == 0x000168, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000178, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_Damage) == 0x000230, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_DamageTags) == 0x000238, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_Momentum) == 0x000258, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_HitInfo) == 0x000264, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_InstigatedBy) == 0x0002F0, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_DamageCauser) == 0x0002F8, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_Event_EffectContext) == 0x000300, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, Temp_bool_Has_Been_Initd_Variable) == 0x000318, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00031C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, Temp_bool_IsClosed_Variable) == 0x000320, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetAttachParentActor_ReturnValue) == 0x000328, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000330, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetVelocity_ReturnValue) == 0x00033C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_IsValid_ReturnValue) == 0x000348, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00034C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_HasAuthority_ReturnValue) == 0x000358, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_CreateDelegate_OutputDelegate) == 0x00035C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_IsServer_ReturnValue) == 0x00036C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000370, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000378, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, Temp_bool_IsClosed_Variable_1) == 0x000384, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_CustomEvent_StartEndFXOnly) == 0x000385, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_CustomEvent_StartEndFXOnly' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Array_Add_ReturnValue) == 0x000388, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Array_Add_ReturnValue_1) == 0x00038C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000390, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetFloatAttribute_ReturnValue) == 0x000394, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000398, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x00039C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetInstigator_ReturnValue) == 0x0003A0, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_BooleanAND_ReturnValue) == 0x0003A8, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0003B0, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_DynamicCast_bSuccess) == 0x0003B8, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0003C0, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_IsValid_ReturnValue_1) == 0x0003C8, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetQuestManager_ReturnValue) == 0x0003D0, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_SelectInt_ReturnValue) == 0x0003D8, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003DC, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x0003EC, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x0003ED, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003F0, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_GetValueAtLevel_ReturnValue) == 0x0003F8, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000400, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, Temp_bool_Has_Been_Initd_Variable_1) == 0x000408, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, Temp_int_Array_Index_Variable) == 0x00040C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, Temp_bool_Has_Been_Initd_Variable_2) == 0x000410, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, Temp_bool_IsClosed_Variable_2) == 0x000411, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_HasAuthority_ReturnValue_1) == 0x000412, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_CustomEvent_ImpactLoc) == 0x000414, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_CustomEvent_ImpactLoc' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_CustomEvent_ImpactNomral) == 0x000420, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_CustomEvent_ImpactNomral' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, Temp_bool_Has_Been_Initd_Variable_3) == 0x00042C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, K2Node_CustomEvent_VelocityIn) == 0x000430, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::K2Node_CustomEvent_VelocityIn' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00043C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Add_VectorVector_ReturnValue) == 0x000440, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, Temp_bool_Has_Been_Initd_Variable_4) == 0x00044C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000450, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00045C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000468, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_VSize_ReturnValue) == 0x000474, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Normal_ReturnValue) == 0x000478, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000484, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000488, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00048C, "Member 'BGA_HighTower_Grape_BrambleShield_C_ExecuteUbergraph_BGA_HighTower_Grape_BrambleShield::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
