#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_HighTower_Squash_Shield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_HighTower_Squash_Shield.BGA_HighTower_Squash_Shield_C
// 0x0038 (0x07F8 - 0x07C0)
class ABGA_HighTower_Squash_Shield_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x07D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          Ended;                                             // 0x07D1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Destroyed;                                         // 0x07D2(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D3[0x1];                                      // 0x07D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Delay_EndBeforeDeath;                              // 0x07D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Damaged;                                        // 0x07D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delay_DamageGC;                                    // 0x07E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SphereRadius;                                      // 0x07E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OneOverSphereRadius;                               // 0x07E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebug;                                         // 0x07EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7ED[0x3];                                      // 0x07ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThicknessMult;                                     // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_HighTower_Squash_Shield(int32 EntryPoint);
	void SetFailsafeLifeSpan();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void ReceiveBeginPlay();
	void EndShield(bool StartEndFXOnly);
	void OnRep_Hide();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_HighTower_Squash_Shield_C">();
	}
	static class ABGA_HighTower_Squash_Shield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_HighTower_Squash_Shield_C>();
	}
};
static_assert(alignof(ABGA_HighTower_Squash_Shield_C) == 0x000008, "Wrong alignment on ABGA_HighTower_Squash_Shield_C");
static_assert(sizeof(ABGA_HighTower_Squash_Shield_C) == 0x0007F8, "Wrong size on ABGA_HighTower_Squash_Shield_C");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, UberGraphFrame) == 0x0007C0, "Member 'ABGA_HighTower_Squash_Shield_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, Sphere) == 0x0007C8, "Member 'ABGA_HighTower_Squash_Shield_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, Hide) == 0x0007D0, "Member 'ABGA_HighTower_Squash_Shield_C::Hide' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, Ended) == 0x0007D1, "Member 'ABGA_HighTower_Squash_Shield_C::Ended' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, Destroyed) == 0x0007D2, "Member 'ABGA_HighTower_Squash_Shield_C::Destroyed' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, Delay_EndBeforeDeath) == 0x0007D4, "Member 'ABGA_HighTower_Squash_Shield_C::Delay_EndBeforeDeath' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, GC_Damaged) == 0x0007D8, "Member 'ABGA_HighTower_Squash_Shield_C::GC_Damaged' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, Delay_DamageGC) == 0x0007E0, "Member 'ABGA_HighTower_Squash_Shield_C::Delay_DamageGC' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, SphereRadius) == 0x0007E4, "Member 'ABGA_HighTower_Squash_Shield_C::SphereRadius' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, OneOverSphereRadius) == 0x0007E8, "Member 'ABGA_HighTower_Squash_Shield_C::OneOverSphereRadius' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, DrawDebug) == 0x0007EC, "Member 'ABGA_HighTower_Squash_Shield_C::DrawDebug' has a wrong offset!");
static_assert(offsetof(ABGA_HighTower_Squash_Shield_C, ThicknessMult) == 0x0007F0, "Member 'ABGA_HighTower_Squash_Shield_C::ThicknessMult' has a wrong offset!");

}

