#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blueprint_Paper_VIM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Blueprint_Paper_VIM.Blueprint_Paper_VIM_C
// 0x0510 (0x08B0 - 0x03A0)
class UBlueprint_Paper_VIM_C final : public UFortAnimInstance
{
public:
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_3;                        // 0x03B0(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_2;                        // 0x04D8(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x0600(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x0728(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0850(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0870(0x0030)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x08A0(0x0010)()

public:
	void ExecuteUbergraph_Blueprint_Paper_VIM(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Blueprint_Paper_VIM_C">();
	}
	static class UBlueprint_Paper_VIM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprint_Paper_VIM_C>();
	}
};
static_assert(alignof(UBlueprint_Paper_VIM_C) == 0x000010, "Wrong alignment on UBlueprint_Paper_VIM_C");
static_assert(sizeof(UBlueprint_Paper_VIM_C) == 0x0008B0, "Wrong size on UBlueprint_Paper_VIM_C");
static_assert(offsetof(UBlueprint_Paper_VIM_C, UberGraphFrame) == 0x0003A0, "Member 'UBlueprint_Paper_VIM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0003A8, "Member 'UBlueprint_Paper_VIM_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_3) == 0x0003B0, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_3' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_2) == 0x0004D8, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_2' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_1) == 0x000600, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_1' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone) == 0x000728, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_ComponentToLocalSpace) == 0x000850, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_Root) == 0x000870, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_MeshRefPose) == 0x0008A0, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_MeshRefPose' has a wrong offset!");

}

