#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmbientAudioController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AmbientAudioController.BP_AmbientAudioController_C
// 0x0068 (0x0148 - 0x00E0)
class UBP_AmbientAudioController_C final : public UFortAmbientAudioController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AmbientMixA;                                       // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientMixB;                                       // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckFrequency;                                    // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInsidePrevious;                                 // 0x00FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsInsideCurrent;                                  // 0x00FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AmbientMixIndoor;                                  // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetLPFFreq;                                     // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentLPFFreq;                                    // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InsideLPFFreq;                                     // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutsideLPFFreq;                                    // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentMPCValueInterp;                             // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAboveSnowAltitude;                                // 0x011C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPOIAmbientAudioBank*               WinterAudioBank;                                   // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSnowAltitudeEnabled;                              // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPOIAmbientAudioBank*               StormAudioBank;                                    // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AmbientAudioInsideTag;                             // 0x0138(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAmbientAudioDataAsset*                 CurieAudioBank;                                    // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AmbientAudioController(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Evaluate_Inside_State();
	void ReceiveBeginPlay();
	void OnCheckIfSurrounded();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	bool Trace(const struct FVector& Start, const struct FVector& Direction);
	void SetTargetLPFFreq(float Target);
	void UpdateSnowSetupBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AmbientAudioController_C">();
	}
	static class UBP_AmbientAudioController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AmbientAudioController_C>();
	}
};
static_assert(alignof(UBP_AmbientAudioController_C) == 0x000008, "Wrong alignment on UBP_AmbientAudioController_C");
static_assert(sizeof(UBP_AmbientAudioController_C) == 0x000148, "Wrong size on UBP_AmbientAudioController_C");
static_assert(offsetof(UBP_AmbientAudioController_C, UberGraphFrame) == 0x0000E0, "Member 'UBP_AmbientAudioController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, AmbientMixA) == 0x0000E8, "Member 'UBP_AmbientAudioController_C::AmbientMixA' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, AmbientMixB) == 0x0000F0, "Member 'UBP_AmbientAudioController_C::AmbientMixB' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CheckFrequency) == 0x0000F8, "Member 'UBP_AmbientAudioController_C::CheckFrequency' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bIsInsidePrevious) == 0x0000FC, "Member 'UBP_AmbientAudioController_C::bIsInsidePrevious' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bIsInsideCurrent) == 0x0000FD, "Member 'UBP_AmbientAudioController_C::bIsInsideCurrent' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, AmbientMixIndoor) == 0x000100, "Member 'UBP_AmbientAudioController_C::AmbientMixIndoor' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, TargetLPFFreq) == 0x000108, "Member 'UBP_AmbientAudioController_C::TargetLPFFreq' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CurrentLPFFreq) == 0x00010C, "Member 'UBP_AmbientAudioController_C::CurrentLPFFreq' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, InsideLPFFreq) == 0x000110, "Member 'UBP_AmbientAudioController_C::InsideLPFFreq' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, OutsideLPFFreq) == 0x000114, "Member 'UBP_AmbientAudioController_C::OutsideLPFFreq' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CurrentMPCValueInterp) == 0x000118, "Member 'UBP_AmbientAudioController_C::CurrentMPCValueInterp' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bAboveSnowAltitude) == 0x00011C, "Member 'UBP_AmbientAudioController_C::bAboveSnowAltitude' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, WinterAudioBank) == 0x000120, "Member 'UBP_AmbientAudioController_C::WinterAudioBank' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, bSnowAltitudeEnabled) == 0x000128, "Member 'UBP_AmbientAudioController_C::bSnowAltitudeEnabled' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, StormAudioBank) == 0x000130, "Member 'UBP_AmbientAudioController_C::StormAudioBank' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, AmbientAudioInsideTag) == 0x000138, "Member 'UBP_AmbientAudioController_C::AmbientAudioInsideTag' has a wrong offset!");
static_assert(offsetof(UBP_AmbientAudioController_C, CurieAudioBank) == 0x000140, "Member 'UBP_AmbientAudioController_C::CurieAudioBank' has a wrong offset!");

}

