#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattlePassUnlockAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_BattlePassUnlockAnim.BP_BattlePassUnlockAnim_C
// 0x0068 (0x0678 - 0x0610)
class UBP_BattlePassUnlockAnim_C final : public UFortItemReceivedPrePrompt
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnlockSequence;                                    // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_59;                                          // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_88;                                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_89;                                          // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_90;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_91;                                          // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_92;                                          // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SoundOnPlayIntro;                                  // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BattlePassUnlockAnim(int32 EntryPoint);
	void PlayIntro();
	void BP_OnActivated();
	void CustomEvent_0();
	void AnimComplete();
	void PreConstruct(bool IsDesignTime);
	class UWidget* GetWidgetForFramingViewedItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BattlePassUnlockAnim_C">();
	}
	static class UBP_BattlePassUnlockAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BattlePassUnlockAnim_C>();
	}
};
static_assert(alignof(UBP_BattlePassUnlockAnim_C) == 0x000008, "Wrong alignment on UBP_BattlePassUnlockAnim_C");
static_assert(sizeof(UBP_BattlePassUnlockAnim_C) == 0x000678, "Wrong size on UBP_BattlePassUnlockAnim_C");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, UberGraphFrame) == 0x000610, "Member 'UBP_BattlePassUnlockAnim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, UnlockSequence) == 0x000618, "Member 'UBP_BattlePassUnlockAnim_C::UnlockSequence' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Intro) == 0x000620, "Member 'UBP_BattlePassUnlockAnim_C::Intro' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Backing) == 0x000628, "Member 'UBP_BattlePassUnlockAnim_C::Backing' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Icon) == 0x000630, "Member 'UBP_BattlePassUnlockAnim_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_59) == 0x000638, "Member 'UBP_BattlePassUnlockAnim_C::Image_59' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_88) == 0x000640, "Member 'UBP_BattlePassUnlockAnim_C::Image_88' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_89) == 0x000648, "Member 'UBP_BattlePassUnlockAnim_C::Image_89' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_90) == 0x000650, "Member 'UBP_BattlePassUnlockAnim_C::Image_90' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_91) == 0x000658, "Member 'UBP_BattlePassUnlockAnim_C::Image_91' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_92) == 0x000660, "Member 'UBP_BattlePassUnlockAnim_C::Image_92' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, Image_93) == 0x000668, "Member 'UBP_BattlePassUnlockAnim_C::Image_93' has a wrong offset!");
static_assert(offsetof(UBP_BattlePassUnlockAnim_C, SoundOnPlayIntro) == 0x000670, "Member 'UBP_BattlePassUnlockAnim_C::SoundOnPlayIntro' has a wrong offset!");

}

