#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeSynthTrackComponent_Gasket_Wasabi

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "BP_TimeSynthTrackComponent_DataTracker_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TimeSynthTrackComponent_Gasket_Wasabi.BP_TimeSynthTrackComponent_Gasket_Wasabi_C
// 0x0018 (0x0228 - 0x0210)
class UBP_TimeSynthTrackComponent_Gasket_Wasabi_C final : public UBP_TimeSynthTrackComponent_DataTracker_C
{
public:
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpFloat_Unaware;                               // 0x020C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpFloat_Attacking;                             // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag_Unaware;                                  // 0x0214(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag_Attacking;                                // 0x021C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnDataTrackerUpdate();
	void GetRemainingEventCooldown(float* Cooldown);
	void HandleMixState();
	void OnDataTrackerStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TimeSynthTrackComponent_Gasket_Wasabi_C">();
	}
	static class UBP_TimeSynthTrackComponent_Gasket_Wasabi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TimeSynthTrackComponent_Gasket_Wasabi_C>();
	}
};
static_assert(alignof(UBP_TimeSynthTrackComponent_Gasket_Wasabi_C) == 0x000008, "Wrong alignment on UBP_TimeSynthTrackComponent_Gasket_Wasabi_C");
static_assert(sizeof(UBP_TimeSynthTrackComponent_Gasket_Wasabi_C) == 0x000228, "Wrong size on UBP_TimeSynthTrackComponent_Gasket_Wasabi_C");
static_assert(offsetof(UBP_TimeSynthTrackComponent_Gasket_Wasabi_C, InterpFloat_Unaware) == 0x00020C, "Member 'UBP_TimeSynthTrackComponent_Gasket_Wasabi_C::InterpFloat_Unaware' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_Gasket_Wasabi_C, InterpFloat_Attacking) == 0x000210, "Member 'UBP_TimeSynthTrackComponent_Gasket_Wasabi_C::InterpFloat_Attacking' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_Gasket_Wasabi_C, EventTag_Unaware) == 0x000214, "Member 'UBP_TimeSynthTrackComponent_Gasket_Wasabi_C::EventTag_Unaware' has a wrong offset!");
static_assert(offsetof(UBP_TimeSynthTrackComponent_Gasket_Wasabi_C, EventTag_Attacking) == 0x00021C, "Member 'UBP_TimeSynthTrackComponent_Gasket_Wasabi_C::EventTag_Attacking' has a wrong offset!");

}

