#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_HighTower_Tomato_Face

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CCPM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_HighTower_Tomato_Face.CCPM_HighTower_Tomato_Face_C
// 0x0030 (0x0430 - 0x0400)
class ACCPM_HighTower_Tomato_Face_C final : public ACCPM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_HighTower_Tomato_Face_C;       // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               HairEmote_MID;                                     // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               GlassEmote_MID;                                    // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HairOpaque_MID;                                    // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               GlassOpaque_MID;                                   // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentVariant;                                    // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_HighTower_Tomato_Face(int32 EntryPoint);
	void AnimNotify_MaskToCasual();
	void AnimNotify_SuitToMask();
	void AnimNotify_MaskToSuit();
	void AnimNotify_CasualToMask();
	void OnPawnAndPartChanged();
	void UserConstructionScript();
	void CreateMIDs();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_HighTower_Tomato_Face_C">();
	}
	static class ACCPM_HighTower_Tomato_Face_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_HighTower_Tomato_Face_C>();
	}
};
static_assert(alignof(ACCPM_HighTower_Tomato_Face_C) == 0x000008, "Wrong alignment on ACCPM_HighTower_Tomato_Face_C");
static_assert(sizeof(ACCPM_HighTower_Tomato_Face_C) == 0x000430, "Wrong size on ACCPM_HighTower_Tomato_Face_C");
static_assert(offsetof(ACCPM_HighTower_Tomato_Face_C, UberGraphFrame_CCPM_HighTower_Tomato_Face_C) == 0x000400, "Member 'ACCPM_HighTower_Tomato_Face_C::UberGraphFrame_CCPM_HighTower_Tomato_Face_C' has a wrong offset!");
static_assert(offsetof(ACCPM_HighTower_Tomato_Face_C, HairEmote_MID) == 0x000408, "Member 'ACCPM_HighTower_Tomato_Face_C::HairEmote_MID' has a wrong offset!");
static_assert(offsetof(ACCPM_HighTower_Tomato_Face_C, GlassEmote_MID) == 0x000410, "Member 'ACCPM_HighTower_Tomato_Face_C::GlassEmote_MID' has a wrong offset!");
static_assert(offsetof(ACCPM_HighTower_Tomato_Face_C, HairOpaque_MID) == 0x000418, "Member 'ACCPM_HighTower_Tomato_Face_C::HairOpaque_MID' has a wrong offset!");
static_assert(offsetof(ACCPM_HighTower_Tomato_Face_C, GlassOpaque_MID) == 0x000420, "Member 'ACCPM_HighTower_Tomato_Face_C::GlassOpaque_MID' has a wrong offset!");
static_assert(offsetof(ACCPM_HighTower_Tomato_Face_C, CurrentVariant) == 0x000428, "Member 'ACCPM_HighTower_Tomato_Face_C::CurrentVariant' has a wrong offset!");

}

