#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Elastic_Eyetrail_Female

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CCPM_Elastic_Eyetrail_Female.CCPM_Elastic_Eyetrail_Female_C.ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female
// 0x0018 (0x0018 - 0x0000)
struct CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_Event_CurrentDayPhase;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_Event_PreviousDayPhase;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAtCreation;                          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFrontend_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female) == 0x000008, "Wrong alignment on CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female");
static_assert(sizeof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female) == 0x000018, "Wrong size on CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female, EntryPoint) == 0x000000, "Member 'CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female, K2Node_Event_CurrentDayPhase) == 0x000004, "Member 'CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female::K2Node_Event_CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female, K2Node_Event_PreviousDayPhase) == 0x000005, "Member 'CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female::K2Node_Event_PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female, K2Node_Event_bAtCreation) == 0x000006, "Member 'CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female::K2Node_Event_bAtCreation' has a wrong offset!");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female, K2Node_SwitchEnum_CmpSuccess) == 0x000007, "Member 'CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000008, "Member 'CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000010, "Member 'CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female, CallFunc_IsInFrontend_ReturnValue) == 0x000011, "Member 'CCPM_Elastic_Eyetrail_Female_C_ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female::CallFunc_IsInFrontend_ReturnValue' has a wrong offset!");

// Function CCPM_Elastic_Eyetrail_Female.CCPM_Elastic_Eyetrail_Female_C.OnDayPhaseChanged
// 0x0003 (0x0003 - 0x0000)
struct CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged final
{
public:
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 PreviousDayPhase;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAtCreation;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged) == 0x000001, "Wrong alignment on CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged");
static_assert(sizeof(CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged) == 0x000003, "Wrong size on CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged, CurrentDayPhase) == 0x000000, "Member 'CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged::CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged, PreviousDayPhase) == 0x000001, "Member 'CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged::PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged, bAtCreation) == 0x000002, "Member 'CCPM_Elastic_Eyetrail_Female_C_OnDayPhaseChanged::bAtCreation' has a wrong offset!");

}

