#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_HoneyDew_Body_Optomized

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CCPM_Parent_WatchCosmeticStat_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_HoneyDew_Body_Optomized.CCPM_HoneyDew_Body_Optomized_C
// 0x0048 (0x0498 - 0x0450)
class ACCPM_HoneyDew_Body_Optomized_C : public ACCPM_Parent_WatchCosmeticStat_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_HoneyDew_Body_Optomized_C;     // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           EffectColor;                                       // 0x0458(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          AnimInstance;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteIntroDuration;                                // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteOutroDuration;                                // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EffectPositionOffset;                              // 0x0478(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteTimeQuant;                                    // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHoneyDewRedVariant;                              // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHoneyDewStage2;                                  // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    NewVar_0;                                          // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnPawnAndPartChanged();
	void OnPawnStoppedEmote(class UFortItemDefinition* MontageItemDef, class AFortPawn* PawnEmoting);
	void OnFinishedCharacterCustomization(class AFortPlayerPawn* Pawn);
	void BindOrUnbindOnPlayerEmoteStopped(bool Bind, class AFortPawn* Pawn);
	void Insert_Name_Here(class UMaterialInstanceDynamic** Head_Skeletal_Mesh_MID, class UMaterialInterface** Face_Skeletal_Mesh_Mat_Ind_0, class UMaterialInterface** Face_Skeletal_Mesh_Mat_Ind_1, class UMaterialInstanceDynamic** Body_Skeletal_Mesh_MID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_HoneyDew_Body_Optomized_C">();
	}
	static class ACCPM_HoneyDew_Body_Optomized_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_HoneyDew_Body_Optomized_C>();
	}
};
static_assert(alignof(ACCPM_HoneyDew_Body_Optomized_C) == 0x000008, "Wrong alignment on ACCPM_HoneyDew_Body_Optomized_C");
static_assert(sizeof(ACCPM_HoneyDew_Body_Optomized_C) == 0x000498, "Wrong size on ACCPM_HoneyDew_Body_Optomized_C");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, UberGraphFrame_CCPM_HoneyDew_Body_Optomized_C) == 0x000450, "Member 'ACCPM_HoneyDew_Body_Optomized_C::UberGraphFrame_CCPM_HoneyDew_Body_Optomized_C' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, EffectColor) == 0x000458, "Member 'ACCPM_HoneyDew_Body_Optomized_C::EffectColor' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, AnimInstance) == 0x000468, "Member 'ACCPM_HoneyDew_Body_Optomized_C::AnimInstance' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, EmoteIntroDuration) == 0x000470, "Member 'ACCPM_HoneyDew_Body_Optomized_C::EmoteIntroDuration' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, EmoteOutroDuration) == 0x000474, "Member 'ACCPM_HoneyDew_Body_Optomized_C::EmoteOutroDuration' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, EffectPositionOffset) == 0x000478, "Member 'ACCPM_HoneyDew_Body_Optomized_C::EffectPositionOffset' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, EmoteTimeQuant) == 0x000484, "Member 'ACCPM_HoneyDew_Body_Optomized_C::EmoteTimeQuant' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, IsHoneyDewRedVariant) == 0x000488, "Member 'ACCPM_HoneyDew_Body_Optomized_C::IsHoneyDewRedVariant' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, IsHoneyDewStage2) == 0x000489, "Member 'ACCPM_HoneyDew_Body_Optomized_C::IsHoneyDewStage2' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Body_Optomized_C, NewVar_0) == 0x000490, "Member 'ACCPM_HoneyDew_Body_Optomized_C::NewVar_0' has a wrong offset!");

}

