#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Hightower_Tapas_Backpack

#include "Basic.hpp"


namespace SDK::Params
{

// Function CCPM_Hightower_Tapas_Backpack.CCPM_Hightower_Tapas_Backpack_C.ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack
// 0x0030 (0x0030 - 0x0000)
struct CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack) == 0x000008, "Wrong alignment on CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack");
static_assert(sizeof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack) == 0x000030, "Wrong size on CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack");
static_assert(offsetof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack, EntryPoint) == 0x000000, "Member 'CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000008, "Member 'CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000011, "Member 'CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000012, "Member 'CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000018, "Member 'CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000020, "Member 'CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'CCPM_Hightower_Tapas_Backpack_C_ExecuteUbergraph_CCPM_Hightower_Tapas_Backpack::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

