#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_EyeFlash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CCPM_Parent_WatchCosmeticStat_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_EyeFlash.CCPM_EyeFlash_C
// 0x0038 (0x0488 - 0x0450)
class ACCPM_EyeFlash_C : public ACCPM_Parent_WatchCosmeticStat_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_EyeFlash_C;                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS;                                                // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EffectColor;                                       // 0x0460(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EffectPositionOffset;                              // 0x0470(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillCount;                                         // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FXgate;                                            // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CCPM_EyeFlash(int32 EntryPoint);
	void PreDestruction();
	void CE_FX_color_change(const struct FLinearColor& NewParam);
	void ReceiveDestroyed();
	void OnPawnAndPartChanged();
	void OnPostResIn();
	void CustomEvent(int32 StageNumBeingActivated);
	void UpdateBasedOnKills();
	void OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22(class FName StatName, int32 StatValue);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_EyeFlash_C">();
	}
	static class ACCPM_EyeFlash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_EyeFlash_C>();
	}
};
static_assert(alignof(ACCPM_EyeFlash_C) == 0x000008, "Wrong alignment on ACCPM_EyeFlash_C");
static_assert(sizeof(ACCPM_EyeFlash_C) == 0x000488, "Wrong size on ACCPM_EyeFlash_C");
static_assert(offsetof(ACCPM_EyeFlash_C, UberGraphFrame_CCPM_EyeFlash_C) == 0x000450, "Member 'ACCPM_EyeFlash_C::UberGraphFrame_CCPM_EyeFlash_C' has a wrong offset!");
static_assert(offsetof(ACCPM_EyeFlash_C, NS) == 0x000458, "Member 'ACCPM_EyeFlash_C::NS' has a wrong offset!");
static_assert(offsetof(ACCPM_EyeFlash_C, EffectColor) == 0x000460, "Member 'ACCPM_EyeFlash_C::EffectColor' has a wrong offset!");
static_assert(offsetof(ACCPM_EyeFlash_C, EffectPositionOffset) == 0x000470, "Member 'ACCPM_EyeFlash_C::EffectPositionOffset' has a wrong offset!");
static_assert(offsetof(ACCPM_EyeFlash_C, KillCount) == 0x00047C, "Member 'ACCPM_EyeFlash_C::KillCount' has a wrong offset!");
static_assert(offsetof(ACCPM_EyeFlash_C, FXgate) == 0x000480, "Member 'ACCPM_EyeFlash_C::FXgate' has a wrong offset!");

}

