#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Hightower_Tapas_Body

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CCPM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_Hightower_Tapas_Body.CCPM_Hightower_Tapas_Body_C
// 0x0018 (0x0418 - 0x0400)
class ACCPM_Hightower_Tapas_Body_C final : public ACCPM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_Hightower_Tapas_Body_C;        // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FX_Eyes_Idle;                                      // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Body_Sparkles;                                     // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_Hightower_Tapas_Body(int32 EntryPoint);
	void OnPawnAndPartChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_Hightower_Tapas_Body_C">();
	}
	static class ACCPM_Hightower_Tapas_Body_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_Hightower_Tapas_Body_C>();
	}
};
static_assert(alignof(ACCPM_Hightower_Tapas_Body_C) == 0x000008, "Wrong alignment on ACCPM_Hightower_Tapas_Body_C");
static_assert(sizeof(ACCPM_Hightower_Tapas_Body_C) == 0x000418, "Wrong size on ACCPM_Hightower_Tapas_Body_C");
static_assert(offsetof(ACCPM_Hightower_Tapas_Body_C, UberGraphFrame_CCPM_Hightower_Tapas_Body_C) == 0x000400, "Member 'ACCPM_Hightower_Tapas_Body_C::UberGraphFrame_CCPM_Hightower_Tapas_Body_C' has a wrong offset!");
static_assert(offsetof(ACCPM_Hightower_Tapas_Body_C, FX_Eyes_Idle) == 0x000408, "Member 'ACCPM_Hightower_Tapas_Body_C::FX_Eyes_Idle' has a wrong offset!");
static_assert(offsetof(ACCPM_Hightower_Tapas_Body_C, Body_Sparkles) == 0x000410, "Member 'ACCPM_Hightower_Tapas_Body_C::Body_Sparkles' has a wrong offset!");

}

