#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Hightower_Honeydew_Eyes

#include "Basic.hpp"


namespace SDK::Params
{

// Function CCPM_Hightower_Honeydew_Eyes.CCPM_Hightower_Honeydew_Eyes_C.ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes
// 0x0018 (0x0018 - 0x0000)
struct CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes) == 0x000008, "Wrong alignment on CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes");
static_assert(sizeof(CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes) == 0x000018, "Wrong size on CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes");
static_assert(offsetof(CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes, EntryPoint) == 0x000000, "Member 'CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000008, "Member 'CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000010, "Member 'CCPM_Hightower_Honeydew_Eyes_C_ExecuteUbergraph_CCPM_Hightower_Honeydew_Eyes::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function CCPM_Hightower_Honeydew_Eyes.CCPM_Hightower_Honeydew_Eyes_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CCPM_Hightower_Honeydew_Eyes_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_Hightower_Honeydew_Eyes_C_ReceiveTick) == 0x000004, "Wrong alignment on CCPM_Hightower_Honeydew_Eyes_C_ReceiveTick");
static_assert(sizeof(CCPM_Hightower_Honeydew_Eyes_C_ReceiveTick) == 0x000004, "Wrong size on CCPM_Hightower_Honeydew_Eyes_C_ReceiveTick");
static_assert(offsetof(CCPM_Hightower_Honeydew_Eyes_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CCPM_Hightower_Honeydew_Eyes_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

