#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_HoneyDew_Swole_Body

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CCPM_Parent_WatchCosmeticStat_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_HoneyDew_Swole_Body.CCPM_HoneyDew_Swole_Body_C
// 0x0038 (0x0488 - 0x0450)
class ACCPM_HoneyDew_Swole_Body_C final : public ACCPM_Parent_WatchCosmeticStat_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_HoneyDew_Swole_Body_C;         // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           EffectColor;                                       // 0x0458(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          AnimInstance;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteIntroDuration;                                // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteOutroDuration;                                // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EffectPositionOffset;                              // 0x0478(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteTimeQuant;                                    // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_HoneyDew_Swole_Body(int32 EntryPoint);
	void OnPawnStoppedEmote(class UFortItemDefinition* MontageItemDef, class AFortPawn* PawnEmoting);
	void OnPawnAndPartChanged();
	void ReceiveTick(float DeltaSeconds);
	void BindOrUnbindOnPlayerEmoteStopped(bool Bind, class AFortPawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_HoneyDew_Swole_Body_C">();
	}
	static class ACCPM_HoneyDew_Swole_Body_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_HoneyDew_Swole_Body_C>();
	}
};
static_assert(alignof(ACCPM_HoneyDew_Swole_Body_C) == 0x000008, "Wrong alignment on ACCPM_HoneyDew_Swole_Body_C");
static_assert(sizeof(ACCPM_HoneyDew_Swole_Body_C) == 0x000488, "Wrong size on ACCPM_HoneyDew_Swole_Body_C");
static_assert(offsetof(ACCPM_HoneyDew_Swole_Body_C, UberGraphFrame_CCPM_HoneyDew_Swole_Body_C) == 0x000450, "Member 'ACCPM_HoneyDew_Swole_Body_C::UberGraphFrame_CCPM_HoneyDew_Swole_Body_C' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Swole_Body_C, EffectColor) == 0x000458, "Member 'ACCPM_HoneyDew_Swole_Body_C::EffectColor' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Swole_Body_C, AnimInstance) == 0x000468, "Member 'ACCPM_HoneyDew_Swole_Body_C::AnimInstance' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Swole_Body_C, EmoteIntroDuration) == 0x000470, "Member 'ACCPM_HoneyDew_Swole_Body_C::EmoteIntroDuration' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Swole_Body_C, EmoteOutroDuration) == 0x000474, "Member 'ACCPM_HoneyDew_Swole_Body_C::EmoteOutroDuration' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Swole_Body_C, EffectPositionOffset) == 0x000478, "Member 'ACCPM_HoneyDew_Swole_Body_C::EffectPositionOffset' has a wrong offset!");
static_assert(offsetof(ACCPM_HoneyDew_Swole_Body_C, EmoteTimeQuant) == 0x000484, "Member 'ACCPM_HoneyDew_Swole_Body_C::EmoteTimeQuant' has a wrong offset!");

}

