#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_HoneyDew_Body_Optomized

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CCPM_HoneyDew_Body_Optomized.CCPM_HoneyDew_Body_Optomized_C.ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized
// 0x01F0 (0x01F0 - 0x0000)
struct CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Insert_Name_Here_Head_Skeletal_Mesh_MID;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_0; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Insert_Name_Here_Body_Skeletal_Mesh_MID;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_1;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UF_MED_HighTower_Honeydew_AnimBP_C*     K2Node_DynamicCast_AsF_MED_High_Tower_Honeydew_Anim_BP; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortPlayerPawn* Pawn)>  K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_CustomEvent_Pawn;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrontend_ReturnValue;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    K2Node_CustomEvent_MontageItemDef;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_PawnEmoting;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_2;    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetMID_MID;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_3;    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Insert_Name_Here_Head_Skeletal_Mesh_MID_1; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_0_1; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_1_1; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Insert_Name_Here_Body_Skeletal_Mesh_MID_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1;  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_4;    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue_1;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMcpVariantChannelInfo                 CallFunc_Array_Get_Item;                           // 0x0140(0x0048)()
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue_2;                 // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue_3;                 // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_GetPosition_ReturnValue;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RoundFloat_ReturnValue;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_5;    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_2; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetMID_MID_1;                             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingEmote_ReturnValue;               // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized) == 0x000008, "Wrong alignment on CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized");
static_assert(sizeof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized) == 0x0001F0, "Wrong size on CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, EntryPoint) == 0x000000, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Insert_Name_Here_Head_Skeletal_Mesh_MID) == 0x000008, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Insert_Name_Here_Head_Skeletal_Mesh_MID' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_0) == 0x000010, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_0' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_1) == 0x000018, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Insert_Name_Here_Body_Skeletal_Mesh_MID) == 0x000020, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Insert_Name_Here_Body_Skeletal_Mesh_MID' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000028, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000038, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000040, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetAnimInstance_ReturnValue) == 0x000050, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetAssociatedPlayerPawn_ReturnValue_1) == 0x000058, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetAssociatedPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_DynamicCast_AsF_MED_High_Tower_Honeydew_Anim_BP) == 0x000060, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_DynamicCast_AsF_MED_High_Tower_Honeydew_Anim_BP' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000080, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000088, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_CustomEvent_Pawn) == 0x000090, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_CustomEvent_Pawn' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_IsInFrontend_ReturnValue) == 0x000098, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_IsInFrontend_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_CustomEvent_MontageItemDef) == 0x0000A0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_CustomEvent_MontageItemDef' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_CustomEvent_PawnEmoting) == 0x0000A8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_CustomEvent_PawnEmoting' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetAssociatedPlayerPawn_ReturnValue_2) == 0x0000B0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetAssociatedPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1) == 0x0000B8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetCurrentMontage_ReturnValue) == 0x0000C0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetMID_MID) == 0x0000C8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetMID_MID' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000D0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetAssociatedPlayerPawn_ReturnValue_3) == 0x0000D8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetAssociatedPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Insert_Name_Here_Head_Skeletal_Mesh_MID_1) == 0x0000E0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Insert_Name_Here_Head_Skeletal_Mesh_MID_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_0_1) == 0x0000E8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_0_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_1_1) == 0x0000F0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Insert_Name_Here_Face_Skeletal_Mesh_Mat_Ind_1_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Insert_Name_Here_Body_Skeletal_Mesh_MID_1) == 0x0000F8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Insert_Name_Here_Body_Skeletal_Mesh_MID_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000100, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1) == 0x000110, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Add_FloatFloat_ReturnValue) == 0x00011C, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetAssociatedPlayerPawn_ReturnValue_4) == 0x000120, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetAssociatedPlayerPawn_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000128, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetCurrentMontage_ReturnValue_1) == 0x000130, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetCurrentMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, Temp_int_Array_Index_Variable) == 0x000138, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00013C, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Array_Get_Item) == 0x000140, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_MatchesTag_ReturnValue) == 0x000188, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_MatchesTag_ReturnValue_1) == 0x000189, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_MatchesTag_ReturnValue_2) == 0x00018A, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_MatchesTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_MatchesTag_ReturnValue_3) == 0x00018B, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_MatchesTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00018C, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Montage_GetPosition_ReturnValue) == 0x000190, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Montage_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000194, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, Temp_int_Loop_Counter_Variable) == 0x000198, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_RoundFloat_ReturnValue) == 0x00019C, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_RoundFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001A0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001A5, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_SelectFloat_ReturnValue) == 0x0001A8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_MapRangeClamped_ReturnValue) == 0x0001AC, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0001B0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0001B4, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_Add_IntInt_ReturnValue) == 0x0001B8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetAssociatedPlayerPawn_ReturnValue_5) == 0x0001C0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetAssociatedPlayerPawn_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_2) == 0x0001C8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0001D0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_GetMID_MID_1) == 0x0001D8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_GetMID_MID_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_IsValid_ReturnValue_1) == 0x0001E0, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_IsPlayingEmote_ReturnValue) == 0x0001E1, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_IsPlayingEmote_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, K2Node_Event_DeltaSeconds) == 0x0001E4, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_SelectFloat_ReturnValue_1) == 0x0001E8, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized, CallFunc_SelectFloat_ReturnValue_2) == 0x0001EC, "Member 'CCPM_HoneyDew_Body_Optomized_C_ExecuteUbergraph_CCPM_HoneyDew_Body_Optomized::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");

// Function CCPM_HoneyDew_Body_Optomized.CCPM_HoneyDew_Body_Optomized_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CCPM_HoneyDew_Body_Optomized_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_HoneyDew_Body_Optomized_C_ReceiveTick) == 0x000004, "Wrong alignment on CCPM_HoneyDew_Body_Optomized_C_ReceiveTick");
static_assert(sizeof(CCPM_HoneyDew_Body_Optomized_C_ReceiveTick) == 0x000004, "Wrong size on CCPM_HoneyDew_Body_Optomized_C_ReceiveTick");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CCPM_HoneyDew_Body_Optomized_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CCPM_HoneyDew_Body_Optomized.CCPM_HoneyDew_Body_Optomized_C.OnPawnStoppedEmote
// 0x0010 (0x0010 - 0x0000)
struct CCPM_HoneyDew_Body_Optomized_C_OnPawnStoppedEmote final
{
public:
	class UFortItemDefinition*                    MontageItemDef;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              PawnEmoting;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_HoneyDew_Body_Optomized_C_OnPawnStoppedEmote) == 0x000008, "Wrong alignment on CCPM_HoneyDew_Body_Optomized_C_OnPawnStoppedEmote");
static_assert(sizeof(CCPM_HoneyDew_Body_Optomized_C_OnPawnStoppedEmote) == 0x000010, "Wrong size on CCPM_HoneyDew_Body_Optomized_C_OnPawnStoppedEmote");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_OnPawnStoppedEmote, MontageItemDef) == 0x000000, "Member 'CCPM_HoneyDew_Body_Optomized_C_OnPawnStoppedEmote::MontageItemDef' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_OnPawnStoppedEmote, PawnEmoting) == 0x000008, "Member 'CCPM_HoneyDew_Body_Optomized_C_OnPawnStoppedEmote::PawnEmoting' has a wrong offset!");

// Function CCPM_HoneyDew_Body_Optomized.CCPM_HoneyDew_Body_Optomized_C.OnFinishedCharacterCustomization
// 0x0008 (0x0008 - 0x0000)
struct CCPM_HoneyDew_Body_Optomized_C_OnFinishedCharacterCustomization final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_HoneyDew_Body_Optomized_C_OnFinishedCharacterCustomization) == 0x000008, "Wrong alignment on CCPM_HoneyDew_Body_Optomized_C_OnFinishedCharacterCustomization");
static_assert(sizeof(CCPM_HoneyDew_Body_Optomized_C_OnFinishedCharacterCustomization) == 0x000008, "Wrong size on CCPM_HoneyDew_Body_Optomized_C_OnFinishedCharacterCustomization");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_OnFinishedCharacterCustomization, Pawn) == 0x000000, "Member 'CCPM_HoneyDew_Body_Optomized_C_OnFinishedCharacterCustomization::Pawn' has a wrong offset!");

// Function CCPM_HoneyDew_Body_Optomized.CCPM_HoneyDew_Body_Optomized_C.BindOrUnbindOnPlayerEmoteStopped
// 0x0028 (0x0028 - 0x0000)
struct CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped final
{
public:
	bool                                          Bind;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              Pawn;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortItemDefinition* MontageItemDef, class AFortPawn* PawnEmoting)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped) == 0x000008, "Wrong alignment on CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped");
static_assert(sizeof(CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped) == 0x000028, "Wrong size on CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped, Bind) == 0x000000, "Member 'CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped::Bind' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped, Pawn) == 0x000008, "Member 'CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped::Pawn' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped, CallFunc_HasAuthority_ReturnValue) == 0x000021, "Member 'CCPM_HoneyDew_Body_Optomized_C_BindOrUnbindOnPlayerEmoteStopped::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function CCPM_HoneyDew_Body_Optomized.CCPM_HoneyDew_Body_Optomized_C.Insert Name Here
// 0x0060 (0x0060 - 0x0000)
struct CCPM_HoneyDew_Body_Optomized_C_Insert_Name_Here final
{
public:
	class UMaterialInstanceDynamic*               Head_Skeletal_Mesh_MID;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Face_Skeletal_Mesh_Mat_Ind_0;                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Face_Skeletal_Mesh_Mat_Ind_1;                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Body_Skeletal_Mesh_MID;                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetMID_MID;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetMID_MID_1;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_2; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_HoneyDew_Body_Optomized_C_Insert_Name_Here) == 0x000008, "Wrong alignment on CCPM_HoneyDew_Body_Optomized_C_Insert_Name_Here");
static_assert(sizeof(CCPM_HoneyDew_Body_Optomized_C_Insert_Name_Here) == 0x000060, "Wrong size on CCPM_HoneyDew_Body_Optomized_C_Insert_Name_Here");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_Insert_Name_Here, Head_Skeletal_Mesh_MID) == 0x000000, "Member 'CCPM_HoneyDew_Body_Optomized_C_Insert_Name_Here::Head_Skeletal_Mesh_MID' has a wrong offset!");
static_assert(offsetof(CCPM_HoneyDew_Body_Optomized_C_Insert_Name_Here, Face_Skeletal_Mesh_Mat_Ind_0) == 0x000008, "Member 'CCPM_HoneyDew_Body_Optomized_C_Insert_Name_Here::Face_Skeletal_Mesh_Mat_Ind_0' has a wrong offset!");
