#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_HighTower_Tomato_Body

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CCPM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_HighTower_Tomato_Body.CCPM_HighTower_Tomato_Body_C
// 0x0018 (0x0418 - 0x0400)
class ACCPM_HighTower_Tomato_Body_C final : public ACCPM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_HighTower_Tomato_Body_C;       // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               ArmorEmote_MID;                                    // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CasualEmote_MID;                                   // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_HighTower_Tomato_Body(int32 EntryPoint);
	void AnimNotify_MaskToCasual();
	void AnimNotify_SuitToMask();
	void AnimNotify_MaskToSuit();
	void AnimNotify_CasualToMask();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_HighTower_Tomato_Body_C">();
	}
	static class ACCPM_HighTower_Tomato_Body_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_HighTower_Tomato_Body_C>();
	}
};
static_assert(alignof(ACCPM_HighTower_Tomato_Body_C) == 0x000008, "Wrong alignment on ACCPM_HighTower_Tomato_Body_C");
static_assert(sizeof(ACCPM_HighTower_Tomato_Body_C) == 0x000418, "Wrong size on ACCPM_HighTower_Tomato_Body_C");
static_assert(offsetof(ACCPM_HighTower_Tomato_Body_C, UberGraphFrame_CCPM_HighTower_Tomato_Body_C) == 0x000400, "Member 'ACCPM_HighTower_Tomato_Body_C::UberGraphFrame_CCPM_HighTower_Tomato_Body_C' has a wrong offset!");
static_assert(offsetof(ACCPM_HighTower_Tomato_Body_C, ArmorEmote_MID) == 0x000408, "Member 'ACCPM_HighTower_Tomato_Body_C::ArmorEmote_MID' has a wrong offset!");
static_assert(offsetof(ACCPM_HighTower_Tomato_Body_C, CasualEmote_MID) == 0x000410, "Member 'ACCPM_HighTower_Tomato_Body_C::CasualEmote_MID' has a wrong offset!");

}

