#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_EyeFlash

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CCPM_EyeFlash.CCPM_EyeFlash_C.ExecuteUbergraph_CCPM_EyeFlash
// 0x0088 (0x0088 - 0x0000)
struct CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_StatName;                       // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StatValue;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StatName, int32 StatValue)> K2Node_CreateDelegate_OutputDelegate;     // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_StageNumBeingActivated;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CosmeticAdaptiveStatWatcher* CallFunc_WatchCosmeticStat_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_CustomEvent_NewParam;                       // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash) == 0x000008, "Wrong alignment on CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash");
static_assert(sizeof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash) == 0x000088, "Wrong size on CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, EntryPoint) == 0x000000, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, K2Node_CustomEvent_StatName) == 0x000004, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::K2Node_CustomEvent_StatName' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, K2Node_CustomEvent_StatValue) == 0x00000C, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::K2Node_CustomEvent_StatValue' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, Temp_int_Variable) == 0x000020, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, Temp_name_Variable) == 0x000024, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000030, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, K2Node_Event_StageNumBeingActivated) == 0x000038, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::K2Node_Event_StageNumBeingActivated' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, CallFunc_WatchCosmeticStat_ReturnValue) == 0x000040, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::CallFunc_WatchCosmeticStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000050, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000058, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, K2Node_CustomEvent_NewParam) == 0x00005C, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1) == 0x000070, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000078, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'CCPM_EyeFlash_C_ExecuteUbergraph_CCPM_EyeFlash::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CCPM_EyeFlash.CCPM_EyeFlash_C.CE_FX color change
// 0x0010 (0x0010 - 0x0000)
struct CCPM_EyeFlash_C_CE_FX_color_change final
{
public:
	struct FLinearColor                           NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_EyeFlash_C_CE_FX_color_change) == 0x000004, "Wrong alignment on CCPM_EyeFlash_C_CE_FX_color_change");
static_assert(sizeof(CCPM_EyeFlash_C_CE_FX_color_change) == 0x000010, "Wrong size on CCPM_EyeFlash_C_CE_FX_color_change");
static_assert(offsetof(CCPM_EyeFlash_C_CE_FX_color_change, NewParam) == 0x000000, "Member 'CCPM_EyeFlash_C_CE_FX_color_change::NewParam' has a wrong offset!");

// Function CCPM_EyeFlash.CCPM_EyeFlash_C.CustomEvent
// 0x0004 (0x0004 - 0x0000)
struct CCPM_EyeFlash_C_CustomEvent final
{
public:
	int32                                         StageNumBeingActivated;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_EyeFlash_C_CustomEvent) == 0x000004, "Wrong alignment on CCPM_EyeFlash_C_CustomEvent");
static_assert(sizeof(CCPM_EyeFlash_C_CustomEvent) == 0x000004, "Wrong size on CCPM_EyeFlash_C_CustomEvent");
static_assert(offsetof(CCPM_EyeFlash_C_CustomEvent, StageNumBeingActivated) == 0x000000, "Member 'CCPM_EyeFlash_C_CustomEvent::StageNumBeingActivated' has a wrong offset!");

// Function CCPM_EyeFlash.CCPM_EyeFlash_C.OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22
// 0x000C (0x000C - 0x0000)
struct CCPM_EyeFlash_C_OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22 final
{
public:
	class FName                                   StatName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatValue;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_EyeFlash_C_OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22) == 0x000004, "Wrong alignment on CCPM_EyeFlash_C_OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22");
static_assert(sizeof(CCPM_EyeFlash_C_OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22) == 0x00000C, "Wrong size on CCPM_EyeFlash_C_OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22");
static_assert(offsetof(CCPM_EyeFlash_C_OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22, StatName) == 0x000000, "Member 'CCPM_EyeFlash_C_OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22::StatName' has a wrong offset!");
static_assert(offsetof(CCPM_EyeFlash_C_OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22, StatValue) == 0x000008, "Member 'CCPM_EyeFlash_C_OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22::StatValue' has a wrong offset!");

}

