#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Elastic_Eyetrail_Female

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CCPM_Base_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_Elastic_Eyetrail_Female.CCPM_Elastic_Eyetrail_Female_C
// 0x0030 (0x0430 - 0x0400)
class ACCPM_Elastic_Eyetrail_Female_C final : public ACCPM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_Elastic_Eyetrail_Female_C;     // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      EyeFX;                                             // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               EyeTrails;                                         // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          NewVar_0;                                          // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   LastPawn;                                          // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Morning_and_Night_Values;                          // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Day_and_Evening_Values;                            // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_Elastic_Eyetrail_Female(int32 EntryPoint);
	void OnPawnAndPartChanged();
	void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_Elastic_Eyetrail_Female_C">();
	}
	static class ACCPM_Elastic_Eyetrail_Female_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_Elastic_Eyetrail_Female_C>();
	}
};
static_assert(alignof(ACCPM_Elastic_Eyetrail_Female_C) == 0x000008, "Wrong alignment on ACCPM_Elastic_Eyetrail_Female_C");
static_assert(sizeof(ACCPM_Elastic_Eyetrail_Female_C) == 0x000430, "Wrong size on ACCPM_Elastic_Eyetrail_Female_C");
static_assert(offsetof(ACCPM_Elastic_Eyetrail_Female_C, UberGraphFrame_CCPM_Elastic_Eyetrail_Female_C) == 0x000400, "Member 'ACCPM_Elastic_Eyetrail_Female_C::UberGraphFrame_CCPM_Elastic_Eyetrail_Female_C' has a wrong offset!");
static_assert(offsetof(ACCPM_Elastic_Eyetrail_Female_C, EyeFX) == 0x000408, "Member 'ACCPM_Elastic_Eyetrail_Female_C::EyeFX' has a wrong offset!");
static_assert(offsetof(ACCPM_Elastic_Eyetrail_Female_C, EyeTrails) == 0x000410, "Member 'ACCPM_Elastic_Eyetrail_Female_C::EyeTrails' has a wrong offset!");
static_assert(offsetof(ACCPM_Elastic_Eyetrail_Female_C, NewVar_0) == 0x000418, "Member 'ACCPM_Elastic_Eyetrail_Female_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ACCPM_Elastic_Eyetrail_Female_C, LastPawn) == 0x000420, "Member 'ACCPM_Elastic_Eyetrail_Female_C::LastPawn' has a wrong offset!");
static_assert(offsetof(ACCPM_Elastic_Eyetrail_Female_C, Morning_and_Night_Values) == 0x000428, "Member 'ACCPM_Elastic_Eyetrail_Female_C::Morning_and_Night_Values' has a wrong offset!");
static_assert(offsetof(ACCPM_Elastic_Eyetrail_Female_C, Day_and_Evening_Values) == 0x00042C, "Member 'ACCPM_Elastic_Eyetrail_Female_C::Day_and_Evening_Values' has a wrong offset!");

}

