#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeInfoPanelEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeInfoPanelEntry.ChallengeInfoPanelEntry_C
// 0x0028 (0x02E0 - 0x02B8)
class UChallengeInfoPanelEntry_C final : public UAthenaChallengeInfoPanelEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PartyAssistInfoIntro;                              // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AmbientPartyAssistAttention;                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGroupChallengeTag_C*                   GroupChallengeTag_124;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherContent;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChallengeInfoPanelEntry(int32 EntryPoint);
	void OnLocalPlayerMissingAssistedChallenge();
	void OnChallengeInfoSet();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeInfoPanelEntry_C">();
	}
	static class UChallengeInfoPanelEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeInfoPanelEntry_C>();
	}
};
static_assert(alignof(UChallengeInfoPanelEntry_C) == 0x000008, "Wrong alignment on UChallengeInfoPanelEntry_C");
static_assert(sizeof(UChallengeInfoPanelEntry_C) == 0x0002E0, "Wrong size on UChallengeInfoPanelEntry_C");
static_assert(offsetof(UChallengeInfoPanelEntry_C, UberGraphFrame) == 0x0002B8, "Member 'UChallengeInfoPanelEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeInfoPanelEntry_C, PartyAssistInfoIntro) == 0x0002C0, "Member 'UChallengeInfoPanelEntry_C::PartyAssistInfoIntro' has a wrong offset!");
static_assert(offsetof(UChallengeInfoPanelEntry_C, AmbientPartyAssistAttention) == 0x0002C8, "Member 'UChallengeInfoPanelEntry_C::AmbientPartyAssistAttention' has a wrong offset!");
static_assert(offsetof(UChallengeInfoPanelEntry_C, GroupChallengeTag_124) == 0x0002D0, "Member 'UChallengeInfoPanelEntry_C::GroupChallengeTag_124' has a wrong offset!");
static_assert(offsetof(UChallengeInfoPanelEntry_C, SwitcherContent) == 0x0002D8, "Member 'UChallengeInfoPanelEntry_C::SwitcherContent' has a wrong offset!");

}

