#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chameleon_PostProcess_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Chameleon_PostProcess_AnimBP.Chameleon_PostProcess_AnimBP_C
// 0x1D50 (0x2170 - 0x0420)
class UChameleon_PostProcess_AnimBP_C final : public UFortPetAnimInstance_AnimDynamics
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0430(0x0030)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x0460(0x0440)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x08A0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0968(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0990(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x09B0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x09D8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x09F8(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0A98(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x0B38(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0B58(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0B78(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0BA0(0x0088)()
	uint8                                         Pad_C28[0x8];                                      // 0x0C28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x0C30(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1070(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x14B0(0x0440)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x18F0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x19F8(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x1A18(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x1B20(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x1C28(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1D30(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x1D50(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x1E58(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x1F60(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x2068(0x0108)()

public:
	void ExecuteUbergraph_Chameleon_PostProcess_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Chameleon_PostProcess_AnimBP_C">();
	}
	static class UChameleon_PostProcess_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChameleon_PostProcess_AnimBP_C>();
	}
};
static_assert(alignof(UChameleon_PostProcess_AnimBP_C) == 0x000010, "Wrong alignment on UChameleon_PostProcess_AnimBP_C");
static_assert(sizeof(UChameleon_PostProcess_AnimBP_C) == 0x002170, "Wrong size on UChameleon_PostProcess_AnimBP_C");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UChameleon_PostProcess_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000428, "Member 'UChameleon_PostProcess_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Root) == 0x000430, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x000460, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0008A0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x000968, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000990, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0009B0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0009D8, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x0009F8, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000A98, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x000B38, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000B58, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000B78, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_SubInput) == 0x000BA0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x000C30, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x001070, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0014B0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_7) == 0x0018F0, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_7' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0019F8, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_6) == 0x001A18, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_5) == 0x001B20, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_4) == 0x001C28, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001D30, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_3) == 0x001D50, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_2) == 0x001E58, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint_1) == 0x001F60, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UChameleon_PostProcess_AnimBP_C, AnimGraphNode_Constraint) == 0x002068, "Member 'UChameleon_PostProcess_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");

}

