#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChargeWeaponLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C
// 0x1200 (0x1510 - 0x0310)
class UChargeWeaponLayerAnimBP_C final : public UFortItemLayerAnimInstance_ChargedWeapon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0320(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x0350(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03D8(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0450(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x0518(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0548(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x05D0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x0600(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x0688(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x06B8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x06E8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0718(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0748(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0778(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x07A8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x07D8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0808(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0838(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0868(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x0898(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x08C8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x0950(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0980(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x0A08(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0A38(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x0AC0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0AF0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x0B78(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0BA8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x0C30(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x0C60(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x0CE8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x0D18(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0DA0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x0DD0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0E58(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x0E88(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0F10(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x0F40(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x0FC8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0FF8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x1080(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x10B0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x10E0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1110(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x1140(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1170(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x11A0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1228(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1258(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x12E0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1368(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1398(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1420(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1450(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x14D8(0x0030)()

public:
	void ExecuteUbergraph_ChargeWeaponLayerAnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChargeWeaponLayerAnimBP_C">();
	}
	static class UChargeWeaponLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChargeWeaponLayerAnimBP_C>();
	}
};
static_assert(alignof(UChargeWeaponLayerAnimBP_C) == 0x000010, "Wrong alignment on UChargeWeaponLayerAnimBP_C");
static_assert(sizeof(UChargeWeaponLayerAnimBP_C) == 0x001510, "Wrong size on UChargeWeaponLayerAnimBP_C");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, UberGraphFrame) == 0x000310, "Member 'UChargeWeaponLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000318, "Member 'UChargeWeaponLayerAnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_34) == 0x000320, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_34' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_18) == 0x000350, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_18' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_SequencePlayer) == 0x0003D8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_ApplyAdditive) == 0x000450, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_33) == 0x000518, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_33' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_17) == 0x000548, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_17' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_32) == 0x0005D0, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_32' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_16) == 0x000600, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_16' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_31) == 0x000688, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_31' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_30) == 0x0006B8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_30' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_29) == 0x0006E8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_29' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_28) == 0x000718, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_28' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_27) == 0x000748, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_27' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_26) == 0x000778, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_26' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_25) == 0x0007A8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_25' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_24) == 0x0007D8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_24' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_23) == 0x000808, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_23' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_22) == 0x000838, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_21) == 0x000868, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_20) == 0x000898, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_15) == 0x0008C8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_15' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_19) == 0x000950, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_14) == 0x000980, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_14' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_18) == 0x000A08, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_13) == 0x000A38, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_17) == 0x000AC0, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_12) == 0x000AF0, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_16) == 0x000B78, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_11) == 0x000BA8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_15) == 0x000C30, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_10) == 0x000C60, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_14) == 0x000CE8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_9) == 0x000D18, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_13) == 0x000DA0, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_8) == 0x000DD0, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_12) == 0x000E58, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_7) == 0x000E88, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_11) == 0x000F10, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x000F40, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_10) == 0x000FC8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x000FF8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_9) == 0x001080, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_8) == 0x0010B0, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_7) == 0x0010E0, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_6) == 0x001110, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_5) == 0x001140, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_4) == 0x001170, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x0011A0, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_3) == 0x001228, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x001258, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x0012E0, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_2) == 0x001368, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x001398, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root_1) == 0x001420, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001450, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UChargeWeaponLayerAnimBP_C, AnimGraphNode_Root) == 0x0014D8, "Member 'UChargeWeaponLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");

}

