#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonDialogueRuntime

#include "Basic.hpp"

#include "CommonDialogueRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CommonDialogueRuntime.ConversationNode.GetDebugParticipantColor
// 0x0018 (0x0018 - 0x0000)
struct ConversationNode_GetDebugParticipantColor final
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationNode_GetDebugParticipantColor) == 0x000004, "Wrong alignment on ConversationNode_GetDebugParticipantColor");
static_assert(sizeof(ConversationNode_GetDebugParticipantColor) == 0x000018, "Wrong size on ConversationNode_GetDebugParticipantColor");
static_assert(offsetof(ConversationNode_GetDebugParticipantColor, ParticipantID) == 0x000000, "Member 'ConversationNode_GetDebugParticipantColor::ParticipantID' has a wrong offset!");
static_assert(offsetof(ConversationNode_GetDebugParticipantColor, ReturnValue) == 0x000008, "Member 'ConversationNode_GetDebugParticipantColor::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationParticipantComponent.ClientExecuteTaskAndSideEffects
// 0x0010 (0x0010 - 0x0000)
struct ConversationParticipantComponent_ClientExecuteTaskAndSideEffects final
{
public:
	struct FConversationNodeHandle                Handle;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationParticipantComponent_ClientExecuteTaskAndSideEffects) == 0x000004, "Wrong alignment on ConversationParticipantComponent_ClientExecuteTaskAndSideEffects");
static_assert(sizeof(ConversationParticipantComponent_ClientExecuteTaskAndSideEffects) == 0x000010, "Wrong size on ConversationParticipantComponent_ClientExecuteTaskAndSideEffects");
static_assert(offsetof(ConversationParticipantComponent_ClientExecuteTaskAndSideEffects, Handle) == 0x000000, "Member 'ConversationParticipantComponent_ClientExecuteTaskAndSideEffects::Handle' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationParticipantComponent.ClientUpdateConversation
// 0x0068 (0x0068 - 0x0000)
struct ConversationParticipantComponent_ClientUpdateConversation final
{
public:
	struct FClientConversationMessagePayload      Message;                                           // 0x0000(0x0068)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationParticipantComponent_ClientUpdateConversation) == 0x000008, "Wrong alignment on ConversationParticipantComponent_ClientUpdateConversation");
static_assert(sizeof(ConversationParticipantComponent_ClientUpdateConversation) == 0x000068, "Wrong size on ConversationParticipantComponent_ClientUpdateConversation");
static_assert(offsetof(ConversationParticipantComponent_ClientUpdateConversation, Message) == 0x000000, "Member 'ConversationParticipantComponent_ClientUpdateConversation::Message' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationParticipantComponent.DEBUG_ServerAdvanceConversation
// 0x0010 (0x0010 - 0x0000)
struct ConversationParticipantComponent_DEBUG_ServerAdvanceConversation final
{
public:
	struct FConversationNodeHandle                PickedOption;                                      // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationParticipantComponent_DEBUG_ServerAdvanceConversation) == 0x000004, "Wrong alignment on ConversationParticipantComponent_DEBUG_ServerAdvanceConversation");
static_assert(sizeof(ConversationParticipantComponent_DEBUG_ServerAdvanceConversation) == 0x000010, "Wrong size on ConversationParticipantComponent_DEBUG_ServerAdvanceConversation");
static_assert(offsetof(ConversationParticipantComponent_DEBUG_ServerAdvanceConversation, PickedOption) == 0x000000, "Member 'ConversationParticipantComponent_DEBUG_ServerAdvanceConversation::PickedOption' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationParticipantComponent.GetParticipantDisplayName
// 0x0018 (0x0018 - 0x0000)
struct ConversationParticipantComponent_GetParticipantDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationParticipantComponent_GetParticipantDisplayName) == 0x000008, "Wrong alignment on ConversationParticipantComponent_GetParticipantDisplayName");
static_assert(sizeof(ConversationParticipantComponent_GetParticipantDisplayName) == 0x000018, "Wrong size on ConversationParticipantComponent_GetParticipantDisplayName");
static_assert(offsetof(ConversationParticipantComponent_GetParticipantDisplayName, ReturnValue) == 0x000000, "Member 'ConversationParticipantComponent_GetParticipantDisplayName::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationChoiceNode.EvaluateChoice
// 0x0028 (0x0028 - 0x0000)
struct ConversationChoiceNode_EvaluateChoice final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   DisplayOption;                                     // 0x0010(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationChoiceNode_EvaluateChoice) == 0x000008, "Wrong alignment on ConversationChoiceNode_EvaluateChoice");
static_assert(sizeof(ConversationChoiceNode_EvaluateChoice) == 0x000028, "Wrong size on ConversationChoiceNode_EvaluateChoice");
static_assert(offsetof(ConversationChoiceNode_EvaluateChoice, Context) == 0x000000, "Member 'ConversationChoiceNode_EvaluateChoice::Context' has a wrong offset!");
static_assert(offsetof(ConversationChoiceNode_EvaluateChoice, DisplayOption) == 0x000010, "Member 'ConversationChoiceNode_EvaluateChoice::DisplayOption' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationContextHelpers.AdvanceConversation
// 0x0010 (0x0010 - 0x0000)
struct ConversationContextHelpers_AdvanceConversation final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationContextHelpers_AdvanceConversation) == 0x000008, "Wrong alignment on ConversationContextHelpers_AdvanceConversation");
static_assert(sizeof(ConversationContextHelpers_AdvanceConversation) == 0x000010, "Wrong size on ConversationContextHelpers_AdvanceConversation");
static_assert(offsetof(ConversationContextHelpers_AdvanceConversation, Context) == 0x000000, "Member 'ConversationContextHelpers_AdvanceConversation::Context' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationContextHelpers.AdvanceConversationWithChoice
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_AdvanceConversationWithChoice final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGuid                                  ChoiceID;                                          // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationContextHelpers_AdvanceConversationWithChoice) == 0x000008, "Wrong alignment on ConversationContextHelpers_AdvanceConversationWithChoice");
static_assert(sizeof(ConversationContextHelpers_AdvanceConversationWithChoice) == 0x000020, "Wrong size on ConversationContextHelpers_AdvanceConversationWithChoice");
static_assert(offsetof(ConversationContextHelpers_AdvanceConversationWithChoice, Context) == 0x000000, "Member 'ConversationContextHelpers_AdvanceConversationWithChoice::Context' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_AdvanceConversationWithChoice, ChoiceID) == 0x000010, "Member 'ConversationContextHelpers_AdvanceConversationWithChoice::ChoiceID' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationContextHelpers.DEBUG_ClientPrintConversation
// 0x0078 (0x0078 - 0x0000)
struct ConversationContextHelpers_DEBUG_ClientPrintConversation final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FClientConversationMessagePayload      Message;                                           // 0x0010(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationContextHelpers_DEBUG_ClientPrintConversation) == 0x000008, "Wrong alignment on ConversationContextHelpers_DEBUG_ClientPrintConversation");
static_assert(sizeof(ConversationContextHelpers_DEBUG_ClientPrintConversation) == 0x000078, "Wrong size on ConversationContextHelpers_DEBUG_ClientPrintConversation");
static_assert(offsetof(ConversationContextHelpers_DEBUG_ClientPrintConversation, Context) == 0x000000, "Member 'ConversationContextHelpers_DEBUG_ClientPrintConversation::Context' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_DEBUG_ClientPrintConversation, Message) == 0x000010, "Member 'ConversationContextHelpers_DEBUG_ClientPrintConversation::Message' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationContextHelpers.FindConversationComponent
// 0x0010 (0x0010 - 0x0000)
struct ConversationContextHelpers_FindConversationComponent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConversationParticipantComponent*      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationContextHelpers_FindConversationComponent) == 0x000008, "Wrong alignment on ConversationContextHelpers_FindConversationComponent");
static_assert(sizeof(ConversationContextHelpers_FindConversationComponent) == 0x000010, "Wrong size on ConversationContextHelpers_FindConversationComponent");
static_assert(offsetof(ConversationContextHelpers_FindConversationComponent, Actor) == 0x000000, "Member 'ConversationContextHelpers_FindConversationComponent::Actor' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_FindConversationComponent, ReturnValue) == 0x000008, "Member 'ConversationContextHelpers_FindConversationComponent::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationContextHelpers.GetConversationInstance
// 0x0018 (0x0018 - 0x0000)
struct ConversationContextHelpers_GetConversationInstance final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UConversationInstance*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationContextHelpers_GetConversationInstance) == 0x000008, "Wrong alignment on ConversationContextHelpers_GetConversationInstance");
static_assert(sizeof(ConversationContextHelpers_GetConversationInstance) == 0x000018, "Wrong size on ConversationContextHelpers_GetConversationInstance");
static_assert(offsetof(ConversationContextHelpers_GetConversationInstance, Context) == 0x000000, "Member 'ConversationContextHelpers_GetConversationInstance::Context' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_GetConversationInstance, ReturnValue) == 0x000010, "Member 'ConversationContextHelpers_GetConversationInstance::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationContextHelpers.GetConversationParticipant
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_GetConversationParticipant final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantTag;                                    // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConversationParticipantComponent*      ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationContextHelpers_GetConversationParticipant) == 0x000008, "Wrong alignment on ConversationContextHelpers_GetConversationParticipant");
static_assert(sizeof(ConversationContextHelpers_GetConversationParticipant) == 0x000020, "Wrong size on ConversationContextHelpers_GetConversationParticipant");
static_assert(offsetof(ConversationContextHelpers_GetConversationParticipant, Context) == 0x000000, "Member 'ConversationContextHelpers_GetConversationParticipant::Context' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_GetConversationParticipant, ParticipantTag) == 0x000010, "Member 'ConversationContextHelpers_GetConversationParticipant::ParticipantTag' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_GetConversationParticipant, ReturnValue) == 0x000018, "Member 'ConversationContextHelpers_GetConversationParticipant::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationContextHelpers.GetConversationParticipantActor
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_GetConversationParticipantActor final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantTag;                                    // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationContextHelpers_GetConversationParticipantActor) == 0x000008, "Wrong alignment on ConversationContextHelpers_GetConversationParticipantActor");
static_assert(sizeof(ConversationContextHelpers_GetConversationParticipantActor) == 0x000020, "Wrong size on ConversationContextHelpers_GetConversationParticipantActor");
static_assert(offsetof(ConversationContextHelpers_GetConversationParticipantActor, Context) == 0x000000, "Member 'ConversationContextHelpers_GetConversationParticipantActor::Context' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_GetConversationParticipantActor, ParticipantTag) == 0x000010, "Member 'ConversationContextHelpers_GetConversationParticipantActor::ParticipantTag' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_GetConversationParticipantActor, ReturnValue) == 0x000018, "Member 'ConversationContextHelpers_GetConversationParticipantActor::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationContextHelpers.GetCurrentConversationNodeHandle
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_GetCurrentConversationNodeHandle final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FConversationNodeHandle                ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationContextHelpers_GetCurrentConversationNodeHandle) == 0x000008, "Wrong alignment on ConversationContextHelpers_GetCurrentConversationNodeHandle");
static_assert(sizeof(ConversationContextHelpers_GetCurrentConversationNodeHandle) == 0x000020, "Wrong size on ConversationContextHelpers_GetCurrentConversationNodeHandle");
static_assert(offsetof(ConversationContextHelpers_GetCurrentConversationNodeHandle, Context) == 0x000000, "Member 'ConversationContextHelpers_GetCurrentConversationNodeHandle::Context' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_GetCurrentConversationNodeHandle, ReturnValue) == 0x000010, "Member 'ConversationContextHelpers_GetCurrentConversationNodeHandle::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationContextHelpers.MakeConversationParticipant
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_MakeConversationParticipant final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 ParticipantActor;                                  // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantTag;                                    // 0x0018(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationContextHelpers_MakeConversationParticipant) == 0x000008, "Wrong alignment on ConversationContextHelpers_MakeConversationParticipant");
static_assert(sizeof(ConversationContextHelpers_MakeConversationParticipant) == 0x000020, "Wrong size on ConversationContextHelpers_MakeConversationParticipant");
static_assert(offsetof(ConversationContextHelpers_MakeConversationParticipant, Context) == 0x000000, "Member 'ConversationContextHelpers_MakeConversationParticipant::Context' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_MakeConversationParticipant, ParticipantActor) == 0x000010, "Member 'ConversationContextHelpers_MakeConversationParticipant::ParticipantActor' has a wrong offset!");
static_assert(offsetof(ConversationContextHelpers_MakeConversationParticipant, ParticipantTag) == 0x000018, "Member 'ConversationContextHelpers_MakeConversationParticipant::ParticipantTag' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationLibrary.GetConversationNode
// 0x0018 (0x0018 - 0x0000)
struct ConversationLibrary_GetConversationNode final
{
public:
	struct FConversationNodeHandle                NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UConversationNode*                ReturnValue;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationLibrary_GetConversationNode) == 0x000008, "Wrong alignment on ConversationLibrary_GetConversationNode");
static_assert(sizeof(ConversationLibrary_GetConversationNode) == 0x000018, "Wrong size on ConversationLibrary_GetConversationNode");
static_assert(offsetof(ConversationLibrary_GetConversationNode, NodeHandle) == 0x000000, "Member 'ConversationLibrary_GetConversationNode::NodeHandle' has a wrong offset!");
static_assert(offsetof(ConversationLibrary_GetConversationNode, ReturnValue) == 0x000010, "Member 'ConversationLibrary_GetConversationNode::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationLibrary.StartConversation
// 0x0030 (0x0030 - 0x0000)
struct ConversationLibrary_StartConversation final
{
public:
	struct FGameplayTag                           ConversationEntryTag;                              // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Instigator;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InstigatorTag;                                     // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Target;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TargetTag;                                         // 0x0020(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConversationInstance*                  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationLibrary_StartConversation) == 0x000008, "Wrong alignment on ConversationLibrary_StartConversation");
static_assert(sizeof(ConversationLibrary_StartConversation) == 0x000030, "Wrong size on ConversationLibrary_StartConversation");
static_assert(offsetof(ConversationLibrary_StartConversation, ConversationEntryTag) == 0x000000, "Member 'ConversationLibrary_StartConversation::ConversationEntryTag' has a wrong offset!");
static_assert(offsetof(ConversationLibrary_StartConversation, Instigator) == 0x000008, "Member 'ConversationLibrary_StartConversation::Instigator' has a wrong offset!");
static_assert(offsetof(ConversationLibrary_StartConversation, InstigatorTag) == 0x000010, "Member 'ConversationLibrary_StartConversation::InstigatorTag' has a wrong offset!");
static_assert(offsetof(ConversationLibrary_StartConversation, Target) == 0x000018, "Member 'ConversationLibrary_StartConversation::Target' has a wrong offset!");
static_assert(offsetof(ConversationLibrary_StartConversation, TargetTag) == 0x000020, "Member 'ConversationLibrary_StartConversation::TargetTag' has a wrong offset!");
static_assert(offsetof(ConversationLibrary_StartConversation, ReturnValue) == 0x000028, "Member 'ConversationLibrary_StartConversation::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationRequirementNode.IsRequirementSatisfied
// 0x0018 (0x0018 - 0x0000)
struct ConversationRequirementNode_IsRequirementSatisfied final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EConversationRequirementResult                ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConversationRequirementNode_IsRequirementSatisfied) == 0x000008, "Wrong alignment on ConversationRequirementNode_IsRequirementSatisfied");
static_assert(sizeof(ConversationRequirementNode_IsRequirementSatisfied) == 0x000018, "Wrong size on ConversationRequirementNode_IsRequirementSatisfied");
static_assert(offsetof(ConversationRequirementNode_IsRequirementSatisfied, Context) == 0x000000, "Member 'ConversationRequirementNode_IsRequirementSatisfied::Context' has a wrong offset!");
static_assert(offsetof(ConversationRequirementNode_IsRequirementSatisfied, ReturnValue) == 0x000010, "Member 'ConversationRequirementNode_IsRequirementSatisfied::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationSideEffectNode.ClientCauseSideEffect
// 0x0010 (0x0010 - 0x0000)
struct ConversationSideEffectNode_ClientCauseSideEffect final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationSideEffectNode_ClientCauseSideEffect) == 0x000008, "Wrong alignment on ConversationSideEffectNode_ClientCauseSideEffect");
static_assert(sizeof(ConversationSideEffectNode_ClientCauseSideEffect) == 0x000010, "Wrong size on ConversationSideEffectNode_ClientCauseSideEffect");
static_assert(offsetof(ConversationSideEffectNode_ClientCauseSideEffect, Context) == 0x000000, "Member 'ConversationSideEffectNode_ClientCauseSideEffect::Context' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationSideEffectNode.ServerCauseSideEffect
// 0x0010 (0x0010 - 0x0000)
struct ConversationSideEffectNode_ServerCauseSideEffect final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationSideEffectNode_ServerCauseSideEffect) == 0x000008, "Wrong alignment on ConversationSideEffectNode_ServerCauseSideEffect");
static_assert(sizeof(ConversationSideEffectNode_ServerCauseSideEffect) == 0x000010, "Wrong size on ConversationSideEffectNode_ServerCauseSideEffect");
static_assert(offsetof(ConversationSideEffectNode_ServerCauseSideEffect, Context) == 0x000000, "Member 'ConversationSideEffectNode_ServerCauseSideEffect::Context' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationTaskNode.ExecuteTaskNode
// 0x0018 (0x0018 - 0x0000)
struct ConversationTaskNode_ExecuteTaskNode final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EConversationTaskResult                       ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConversationTaskNode_ExecuteTaskNode) == 0x000008, "Wrong alignment on ConversationTaskNode_ExecuteTaskNode");
static_assert(sizeof(ConversationTaskNode_ExecuteTaskNode) == 0x000018, "Wrong size on ConversationTaskNode_ExecuteTaskNode");
static_assert(offsetof(ConversationTaskNode_ExecuteTaskNode, Context) == 0x000000, "Member 'ConversationTaskNode_ExecuteTaskNode::Context' has a wrong offset!");
static_assert(offsetof(ConversationTaskNode_ExecuteTaskNode, ReturnValue) == 0x000010, "Member 'ConversationTaskNode_ExecuteTaskNode::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationTaskNode.GetChoiceList
// 0x0020 (0x0020 - 0x0000)
struct ConversationTaskNode_GetChoiceList final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FClientConversationOptionEntry> ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConversationTaskNode_GetChoiceList) == 0x000008, "Wrong alignment on ConversationTaskNode_GetChoiceList");
static_assert(sizeof(ConversationTaskNode_GetChoiceList) == 0x000020, "Wrong size on ConversationTaskNode_GetChoiceList");
static_assert(offsetof(ConversationTaskNode_GetChoiceList, Context) == 0x000000, "Member 'ConversationTaskNode_GetChoiceList::Context' has a wrong offset!");
static_assert(offsetof(ConversationTaskNode_GetChoiceList, ReturnValue) == 0x000010, "Member 'ConversationTaskNode_GetChoiceList::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationTaskNode.GetNodeBodyColor
// 0x0014 (0x0014 - 0x0000)
struct ConversationTaskNode_GetNodeBodyColor final
{
public:
	struct FLinearColor                           BodyColor;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConversationTaskNode_GetNodeBodyColor) == 0x000004, "Wrong alignment on ConversationTaskNode_GetNodeBodyColor");
static_assert(sizeof(ConversationTaskNode_GetNodeBodyColor) == 0x000014, "Wrong size on ConversationTaskNode_GetNodeBodyColor");
static_assert(offsetof(ConversationTaskNode_GetNodeBodyColor, BodyColor) == 0x000000, "Member 'ConversationTaskNode_GetNodeBodyColor::BodyColor' has a wrong offset!");
static_assert(offsetof(ConversationTaskNode_GetNodeBodyColor, ReturnValue) == 0x000010, "Member 'ConversationTaskNode_GetNodeBodyColor::ReturnValue' has a wrong offset!");

// Function CommonDialogueRuntime.ConversationTaskNode.IsRequirementSatisfied
// 0x0018 (0x0018 - 0x0000)
struct ConversationTaskNode_IsRequirementSatisfied final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EConversationRequirementResult                ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConversationTaskNode_IsRequirementSatisfied) == 0x000008, "Wrong alignment on ConversationTaskNode_IsRequirementSatisfied");
static_assert(sizeof(ConversationTaskNode_IsRequirementSatisfied) == 0x000018, "Wrong size on ConversationTaskNode_IsRequirementSatisfied");
static_assert(offsetof(ConversationTaskNode_IsRequirementSatisfied, Context) == 0x000000, "Member 'ConversationTaskNode_IsRequirementSatisfied::Context' has a wrong offset!");
static_assert(offsetof(ConversationTaskNode_IsRequirementSatisfied, ReturnValue) == 0x000010, "Member 'ConversationTaskNode_IsRequirementSatisfied::ReturnValue' has a wrong offset!");

}

