#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_Butterfly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_Butterfly.DA_Butterfly_C
// 0x0040 (0x0D80 - 0x0D40)
class ADA_Butterfly_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CanCancelAbility;                                  // 0x0D48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D49[0x7];                                      // 0x0D49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CanCancelTimer;                                    // 0x0D50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         CancelDelay;                                       // 0x0D58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DA_Butterfly(int32 EntryPoint);
	void BPReleaseSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPOnUnEquip();
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_Butterfly_C">();
	}
	static class ADA_Butterfly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_Butterfly_C>();
	}
};
static_assert(alignof(ADA_Butterfly_C) == 0x000008, "Wrong alignment on ADA_Butterfly_C");
static_assert(sizeof(ADA_Butterfly_C) == 0x000D80, "Wrong size on ADA_Butterfly_C");
static_assert(offsetof(ADA_Butterfly_C, UberGraphFrame) == 0x000D40, "Member 'ADA_Butterfly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADA_Butterfly_C, CanCancelAbility) == 0x000D48, "Member 'ADA_Butterfly_C::CanCancelAbility' has a wrong offset!");
static_assert(offsetof(ADA_Butterfly_C, CanCancelTimer) == 0x000D50, "Member 'ADA_Butterfly_C::CanCancelTimer' has a wrong offset!");
static_assert(offsetof(ADA_Butterfly_C, CancelDelay) == 0x000D58, "Member 'ADA_Butterfly_C::CancelDelay' has a wrong offset!");
static_assert(offsetof(ADA_Butterfly_C, PlayerPawn) == 0x000D78, "Member 'ADA_Butterfly_C::PlayerPawn' has a wrong offset!");

}

