#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_CarminePack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_CarminePack.DA_CarminePack_C
// 0x00A0 (0x0DE0 - 0x0D40)
class ADA_CarminePack_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TimePressed;                                       // 0x0D48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PunchPicker;                                       // 0x0D4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          hasLandedAfterBeam;                                // 0x0D50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D51[0x7];                                      // 0x0D51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Carmine_Ability_Tags;                              // 0x0D58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   StoneTags;                                         // 0x0D78(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   GemTags;                                           // 0x0D88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         int_0;                                             // 0x0D98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9C[0x4];                                      // 0x0D9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  SkydiveCue;                                        // 0x0DA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TrailsCue;                                         // 0x0DC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_DA_CarminePack(int32 EntryPoint);
	void BindPartchanged();
	void Landed(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);
	void OnRep_StoneTags();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_CarminePack_C">();
	}
	static class ADA_CarminePack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_CarminePack_C>();
	}
};
static_assert(alignof(ADA_CarminePack_C) == 0x000008, "Wrong alignment on ADA_CarminePack_C");
static_assert(sizeof(ADA_CarminePack_C) == 0x000DE0, "Wrong size on ADA_CarminePack_C");
static_assert(offsetof(ADA_CarminePack_C, UberGraphFrame) == 0x000D40, "Member 'ADA_CarminePack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, TimePressed) == 0x000D48, "Member 'ADA_CarminePack_C::TimePressed' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, PunchPicker) == 0x000D4C, "Member 'ADA_CarminePack_C::PunchPicker' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, hasLandedAfterBeam) == 0x000D50, "Member 'ADA_CarminePack_C::hasLandedAfterBeam' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, Carmine_Ability_Tags) == 0x000D58, "Member 'ADA_CarminePack_C::Carmine_Ability_Tags' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, StoneTags) == 0x000D78, "Member 'ADA_CarminePack_C::StoneTags' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, GemTags) == 0x000D88, "Member 'ADA_CarminePack_C::GemTags' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, int_0) == 0x000D98, "Member 'ADA_CarminePack_C::int_0' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, SkydiveCue) == 0x000DA0, "Member 'ADA_CarminePack_C::SkydiveCue' has a wrong offset!");
static_assert(offsetof(ADA_CarminePack_C, TrailsCue) == 0x000DC0, "Member 'ADA_CarminePack_C::TrailsCue' has a wrong offset!");

}

