#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_HighTower_Honeydew_Swole_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_HighTower_Honeydew_Swole_AnimBP.F_MED_HighTower_Honeydew_Swole_AnimBP_C
// 0x1500 (0x19E0 - 0x04E0)
class UF_MED_HighTower_Honeydew_Swole_AnimBP_C final : public UCustomCharacterPartAnimInstance_HoneydewSwoleBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04F0(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x0520(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x0660(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0768(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x0870(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0978(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0A80(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x0AA0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x0BA8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0CB0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0DB8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0EC0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0FC8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x10D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x10F8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1120(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1228(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1330(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1438(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1540(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x15E0(0x00C8)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x16A8(0x0140)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x17E8(0x00C0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x18A8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x18C8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1910(0x00C8)()

public:
	void ExecuteUbergraph_F_MED_HighTower_Honeydew_Swole_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_HighTower_Honeydew_Swole_AnimBP_C">();
	}
	static class UF_MED_HighTower_Honeydew_Swole_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_HighTower_Honeydew_Swole_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_HighTower_Honeydew_Swole_AnimBP_C");
static_assert(sizeof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C) == 0x0019E0, "Wrong size on UF_MED_HighTower_Honeydew_Swole_AnimBP_C");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, UberGraphFrame) == 0x0004E0, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0004E8, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_Root) == 0x0004F0, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_1) == 0x000520, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_Constraint_3) == 0x000660, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone_9) == 0x000768, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_Constraint_2) == 0x000870, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x000978, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000A80, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_Constraint_1) == 0x000AA0, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_Constraint) == 0x000BA8, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x000CB0, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x000DB8, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x000EC0, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x000FC8, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0010D0, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0010F8, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x001120, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x001228, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x001330, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ModifyBone) == 0x001438, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001540, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x0015E0, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0016A8, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x0017E8, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0018A8, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_SequenceEvaluator) == 0x0018C8, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x001910, "Member 'UF_MED_HighTower_Honeydew_Swole_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");

}

