#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP.F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C
// 0x16A0 (0x1B40 - 0x04A0)
class UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance_HoneydewHead
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x04B0(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05B8(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x05E8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0608(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0710(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0818(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0920(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0A28(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0B30(0x0650)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1180(0x00C0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1240(0x0650)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1890(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x18B0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x19F0(0x0140)(ContainsInstancedReference)
	class USkeletalMeshComponent*                 Body_Mesh_b;                                       // 0x1B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C");
static_assert(sizeof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C) == 0x001B40, "Wrong size on UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, UberGraphFrame) == 0x0004A0, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0004A8, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x0004B0, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x0005B8, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0005E8, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x000608, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x000710, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x000818, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000920, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000A28, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x000B30, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x001180, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x001240, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001890, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_1) == 0x0018B0, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0019F0, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C, Body_Mesh_b) == 0x001B30, "Member 'UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C::Body_Mesh_b' has a wrong offset!");

}

