#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Rebirth_Soldier_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Rebirth_Soldier_AnimBP.F_MED_Rebirth_Soldier_AnimBP_C
// 0x1070 (0x1510 - 0x04A0)
class UF_MED_Rebirth_Soldier_AnimBP_C final : public UCustomCharacterPartAnimInstance_Rebirth_Soldier_F
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x04B0(0x0650)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0B00(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0B20(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0B40(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C48(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0D50(0x0650)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x13A0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x14E0(0x0030)()

public:
	void ExecuteUbergraph_F_MED_Rebirth_Soldier_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Rebirth_Soldier_AnimBP_C">();
	}
	static class UF_MED_Rebirth_Soldier_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Rebirth_Soldier_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Rebirth_Soldier_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Rebirth_Soldier_AnimBP_C");
static_assert(sizeof(UF_MED_Rebirth_Soldier_AnimBP_C) == 0x001510, "Wrong size on UF_MED_Rebirth_Soldier_AnimBP_C");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, UberGraphFrame) == 0x0004A0, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0004A8, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x0004B0, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000B00, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000B20, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000B40, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000C48, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_RigidBody) == 0x000D50, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0013A0, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Root) == 0x0014E0, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");

}

