#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_HighTower_Squash_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_HighTower_Squash_AnimBP.F_MED_HighTower_Squash_AnimBP_C
// 0x1030 (0x14E0 - 0x04B0)
class UF_MED_HighTower_Squash_AnimBP_C final : public UCustomCharacterPartAnimInstance_SquashBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04C0(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x04F0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0630(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0738(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0840(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0948(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0A50(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0B58(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C60(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C80(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x0CA0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0DA8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x0EB0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0FB8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x10C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x11C8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x12D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x13D8(0x0108)()

public:
	void ExecuteUbergraph_F_MED_HighTower_Squash_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_HighTower_Squash_AnimBP_C">();
	}
	static class UF_MED_HighTower_Squash_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_HighTower_Squash_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_HighTower_Squash_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_HighTower_Squash_AnimBP_C");
static_assert(sizeof(UF_MED_HighTower_Squash_AnimBP_C) == 0x0014E0, "Wrong size on UF_MED_HighTower_Squash_AnimBP_C");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, UberGraphFrame) == 0x0004B0, "Member 'UF_MED_HighTower_Squash_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0004B8, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_Root) == 0x0004C0, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0004F0, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone_9) == 0x000630, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x000738, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x000840, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x000948, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x000A50, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x000B58, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000C60, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000C80, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_Constraint_3) == 0x000CA0, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x000DA8, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_Constraint_2) == 0x000EB0, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x000FB8, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_Constraint_1) == 0x0010C0, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0011C8, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_Constraint) == 0x0012D0, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_HighTower_Squash_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0013D8, "Member 'UF_MED_HighTower_Squash_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

