#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Elastic_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Elastic_AnimBP.F_MED_Elastic_AnimBP_C.ExecuteUbergraph_F_MED_Elastic_AnimBP
// 0x00E0 (0x00E0 - 0x0000)
struct F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1; // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP) == 0x000010, "Wrong alignment on F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP");
static_assert(sizeof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP) == 0x0000E0, "Wrong size on F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1) == 0x000010, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000020, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1) == 0x000050, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakTransform_Location) == 0x000080, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakTransform_Rotation) == 0x00008C, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakTransform_Scale) == 0x000098, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakTransform_Location_1) == 0x0000A4, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakTransform_Rotation_1) == 0x0000B0, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakTransform_Scale_1) == 0x0000BC, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakRotator_Roll) == 0x0000C8, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakRotator_Pitch) == 0x0000CC, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakRotator_Yaw) == 0x0000D0, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakRotator_Roll_1) == 0x0000D4, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakRotator_Pitch_1) == 0x0000D8, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP, CallFunc_BreakRotator_Yaw_1) == 0x0000DC, "Member 'F_MED_Elastic_AnimBP_C_ExecuteUbergraph_F_MED_Elastic_AnimBP::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");

// Function F_MED_Elastic_AnimBP.F_MED_Elastic_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_Elastic_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Elastic_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_Elastic_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_Elastic_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_Elastic_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_Elastic_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function F_MED_Elastic_AnimBP.F_MED_Elastic_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Elastic_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Elastic_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Elastic_AnimBP_C_AnimGraph");
static_assert(sizeof(F_MED_Elastic_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Elastic_AnimBP_C_AnimGraph");
static_assert(offsetof(F_MED_Elastic_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_Elastic_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

