#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Elastic_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Elastic_AnimBP.F_MED_Elastic_AnimBP_C
// 0x05F0 (0x0A90 - 0x04A0)
class UF_MED_Elastic_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04B0(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x04E0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x0620(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0728(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x0830(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0938(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0958(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0A60(0x0020)()
	float                                         thigh_rot_l;                                       // 0x0A80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         thigh_rot_r;                                       // 0x0A84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_F_MED_Elastic_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Elastic_AnimBP_C">();
	}
	static class UF_MED_Elastic_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Elastic_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Elastic_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Elastic_AnimBP_C");
static_assert(sizeof(UF_MED_Elastic_AnimBP_C) == 0x000A90, "Wrong size on UF_MED_Elastic_AnimBP_C");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, UberGraphFrame) == 0x0004A0, "Member 'UF_MED_Elastic_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0004A8, "Member 'UF_MED_Elastic_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, AnimGraphNode_Root) == 0x0004B0, "Member 'UF_MED_Elastic_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0004E0, "Member 'UF_MED_Elastic_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, AnimGraphNode_Constraint_1) == 0x000620, "Member 'UF_MED_Elastic_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000728, "Member 'UF_MED_Elastic_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, AnimGraphNode_Constraint) == 0x000830, "Member 'UF_MED_Elastic_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000938, "Member 'UF_MED_Elastic_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000958, "Member 'UF_MED_Elastic_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000A60, "Member 'UF_MED_Elastic_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, thigh_rot_l) == 0x000A80, "Member 'UF_MED_Elastic_AnimBP_C::thigh_rot_l' has a wrong offset!");
static_assert(offsetof(UF_MED_Elastic_AnimBP_C, thigh_rot_r) == 0x000A84, "Member 'UF_MED_Elastic_AnimBP_C::thigh_rot_r' has a wrong offset!");

}

