#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FN_RadialForce

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FN_RadialForce.FN_RadialForce_C.ExecuteUbergraph_FN_RadialForce
// 0x0110 (0x0110 - 0x0000)
struct FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Duration;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_magnitude;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformVector*                         CallFunc_SetUniformVector_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         CallFunc_SetUniformVector_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URadialFalloff*                         CallFunc_SetRadialFalloff_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URadialVector*                          CallFunc_SetRadialVector_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_NewFunction_0_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_NewFunction_0_ReturnValue_1;              // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class UNoiseField*                            CallFunc_SetNoiseField_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNoiseField*                            CallFunc_SetNoiseField_ReturnValue_1;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_1;           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_2;           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_3;           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         CallFunc_SetOperatorField_ReturnValue_4;           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce) == 0x000010, "Wrong alignment on FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce");
static_assert(sizeof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce) == 0x000110, "Wrong size on FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, EntryPoint) == 0x000000, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::EntryPoint' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, K2Node_CustomEvent_Duration) == 0x000004, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, K2Node_CustomEvent_magnitude) == 0x000008, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::K2Node_CustomEvent_magnitude' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetUniformVector_ReturnValue) == 0x000010, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetUniformVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetUniformVector_ReturnValue_1) == 0x000018, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetUniformVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00002C, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetRadialFalloff_ReturnValue) == 0x000040, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetRadialFalloff_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000048, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetRadialVector_ReturnValue) == 0x000050, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetRadialVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000058, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00005C, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_NewFunction_0_ReturnValue) == 0x000070, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_NewFunction_0_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_NewFunction_0_ReturnValue_1) == 0x0000A0, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_NewFunction_0_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetNoiseField_ReturnValue) == 0x0000D0, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetNoiseField_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetNoiseField_ReturnValue_1) == 0x0000D8, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetNoiseField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetOperatorField_ReturnValue) == 0x0000E0, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetOperatorField_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetOperatorField_ReturnValue_1) == 0x0000E8, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetOperatorField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetOperatorField_ReturnValue_2) == 0x0000F0, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetOperatorField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetOperatorField_ReturnValue_3) == 0x0000F8, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetOperatorField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce, CallFunc_SetOperatorField_ReturnValue_4) == 0x000100, "Member 'FN_RadialForce_C_ExecuteUbergraph_FN_RadialForce::CallFunc_SetOperatorField_ReturnValue_4' has a wrong offset!");

// Function FN_RadialForce.FN_RadialForce_C.UpdateFieldGraph
// 0x0008 (0x0008 - 0x0000)
struct FN_RadialForce_C_UpdateFieldGraph final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Magnitude_0;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FN_RadialForce_C_UpdateFieldGraph) == 0x000004, "Wrong alignment on FN_RadialForce_C_UpdateFieldGraph");
static_assert(sizeof(FN_RadialForce_C_UpdateFieldGraph) == 0x000008, "Wrong size on FN_RadialForce_C_UpdateFieldGraph");
static_assert(offsetof(FN_RadialForce_C_UpdateFieldGraph, Duration) == 0x000000, "Member 'FN_RadialForce_C_UpdateFieldGraph::Duration' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_UpdateFieldGraph, Magnitude_0) == 0x000004, "Member 'FN_RadialForce_C_UpdateFieldGraph::Magnitude_0' has a wrong offset!");

// Function FN_RadialForce.FN_RadialForce_C.NewFunction_0
// 0x0090 (0x0090 - 0x0000)
struct FN_RadialForce_C_NewFunction_0 final
{
public:
	float                                         Roll;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(FN_RadialForce_C_NewFunction_0) == 0x000010, "Wrong alignment on FN_RadialForce_C_NewFunction_0");
static_assert(sizeof(FN_RadialForce_C_NewFunction_0) == 0x000090, "Wrong size on FN_RadialForce_C_NewFunction_0");
static_assert(offsetof(FN_RadialForce_C_NewFunction_0, Roll) == 0x000000, "Member 'FN_RadialForce_C_NewFunction_0::Roll' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_NewFunction_0, Scale) == 0x000004, "Member 'FN_RadialForce_C_NewFunction_0::Scale' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_NewFunction_0, ReturnValue) == 0x000010, "Member 'FN_RadialForce_C_NewFunction_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_NewFunction_0, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000040, "Member 'FN_RadialForce_C_NewFunction_0::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_NewFunction_0, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00004C, "Member 'FN_RadialForce_C_NewFunction_0::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_RadialForce_C_NewFunction_0, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'FN_RadialForce_C_NewFunction_0::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

}

