#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteConversationRuntime

#include "Basic.hpp"

#include "CommonDialogueRuntime_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class FortniteConversationRuntime.FortConversationParticipantComponent
// 0x0018 (0x0180 - 0x0168)
class UFortConversationParticipantComponent : public UConversationParticipantComponent
{
public:
	class UInputComponent*                        ConversationInputComp;                             // 0x0168(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_170[0x10];                                     // 0x0170(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationParticipantComponent">();
	}
	static class UFortConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationParticipantComponent>();
	}
};
static_assert(alignof(UFortConversationParticipantComponent) == 0x000008, "Wrong alignment on UFortConversationParticipantComponent");
static_assert(sizeof(UFortConversationParticipantComponent) == 0x000180, "Wrong size on UFortConversationParticipantComponent");
static_assert(offsetof(UFortConversationParticipantComponent, ConversationInputComp) == 0x000168, "Member 'UFortConversationParticipantComponent::ConversationInputComp' has a wrong offset!");

// Class FortniteConversationRuntime.FortConversationPawn
// 0x0018 (0x0BF0 - 0x0BD8)
class AFortConversationPawn final : public ABuildingProp
{
public:
	struct FGameplayTag                           ConversationEntryTag;                              // 0x0BD8(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           InteractorParticipantTag;                          // 0x0BE0(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SelfParticipantTag;                                // 0x0BE8(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationPawn">();
	}
	static class AFortConversationPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortConversationPawn>();
	}
};
static_assert(alignof(AFortConversationPawn) == 0x000008, "Wrong alignment on AFortConversationPawn");
static_assert(sizeof(AFortConversationPawn) == 0x000BF0, "Wrong size on AFortConversationPawn");
static_assert(offsetof(AFortConversationPawn, ConversationEntryTag) == 0x000BD8, "Member 'AFortConversationPawn::ConversationEntryTag' has a wrong offset!");
static_assert(offsetof(AFortConversationPawn, InteractorParticipantTag) == 0x000BE0, "Member 'AFortConversationPawn::InteractorParticipantTag' has a wrong offset!");
static_assert(offsetof(AFortConversationPawn, SelfParticipantTag) == 0x000BE8, "Member 'AFortConversationPawn::SelfParticipantTag' has a wrong offset!");

// Class FortniteConversationRuntime.FortPlayerConversationComponent
// 0x0038 (0x01B8 - 0x0180)
class UFortPlayerConversationComponent : public UFortConversationParticipantComponent
{
public:
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   DialogWidgetSoftClass;                             // 0x0188(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                            DialogWidgetInstance;                              // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerConversationComponent">();
	}
	static class UFortPlayerConversationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerConversationComponent>();
	}
};
static_assert(alignof(UFortPlayerConversationComponent) == 0x000008, "Wrong alignment on UFortPlayerConversationComponent");
static_assert(sizeof(UFortPlayerConversationComponent) == 0x0001B8, "Wrong size on UFortPlayerConversationComponent");
static_assert(offsetof(UFortPlayerConversationComponent, DialogWidgetSoftClass) == 0x000188, "Member 'UFortPlayerConversationComponent::DialogWidgetSoftClass' has a wrong offset!");
static_assert(offsetof(UFortPlayerConversationComponent, DialogWidgetInstance) == 0x0001B0, "Member 'UFortPlayerConversationComponent::DialogWidgetInstance' has a wrong offset!");

}

