#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteConversationUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "UMG_classes.hpp"
#include "FortniteConversationUI_structs.hpp"


namespace SDK
{

// Class FortniteConversationUI.FortConversationOption
// 0x0040 (0x02A0 - 0x0260)
class UFortConversationOption final : public UUserWidget
{
public:
	uint8                                         Pad_260[0x28];                                     // 0x0260(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLazyImage*                       Image_Icon;                                        // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Content;                                      // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_Icon;                                      // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_OnHoveredStateChanged(bool bIsChoiceHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationOption">();
	}
	static class UFortConversationOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOption>();
	}
};
static_assert(alignof(UFortConversationOption) == 0x000008, "Wrong alignment on UFortConversationOption");
static_assert(sizeof(UFortConversationOption) == 0x0002A0, "Wrong size on UFortConversationOption");
static_assert(offsetof(UFortConversationOption, Image_Icon) == 0x000288, "Member 'UFortConversationOption::Image_Icon' has a wrong offset!");
static_assert(offsetof(UFortConversationOption, Text_Content) == 0x000290, "Member 'UFortConversationOption::Text_Content' has a wrong offset!");
static_assert(offsetof(UFortConversationOption, Overlay_Icon) == 0x000298, "Member 'UFortConversationOption::Overlay_Icon' has a wrong offset!");

// Class FortniteConversationUI.FortConversationOptionsPanel
// 0x0018 (0x0138 - 0x0120)
class UFortConversationOptionsPanel final : public UPanelWidget
{
public:
	uint8                                         Pad_120[0x10];                                     // 0x0120(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxRows;                                           // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPanelSlot* AddChildToDynamicPanel(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationOptionsPanel">();
	}
	static class UFortConversationOptionsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOptionsPanel>();
	}
};
static_assert(alignof(UFortConversationOptionsPanel) == 0x000008, "Wrong alignment on UFortConversationOptionsPanel");
static_assert(sizeof(UFortConversationOptionsPanel) == 0x000138, "Wrong size on UFortConversationOptionsPanel");
static_assert(offsetof(UFortConversationOptionsPanel, MaxRows) == 0x000130, "Member 'UFortConversationOptionsPanel::MaxRows' has a wrong offset!");

// Class FortniteConversationUI.FortConversationScreen
// 0x0070 (0x0370 - 0x0300)
class UFortConversationScreen final : public UFortActorIndicatorWidget
{
public:
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortChallengeData>             DebugChallengeData;                                // 0x0308(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DialogChoiceSoftClass;                             // 0x0318(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_340[0x28];                                     // 0x0340(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortConversationOptionsPanel*          DynamicPanel_DailogOptions;                        // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationScreen">();
	}
	static class UFortConversationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationScreen>();
	}
};
static_assert(alignof(UFortConversationScreen) == 0x000008, "Wrong alignment on UFortConversationScreen");
static_assert(sizeof(UFortConversationScreen) == 0x000370, "Wrong size on UFortConversationScreen");
static_assert(offsetof(UFortConversationScreen, DebugChallengeData) == 0x000308, "Member 'UFortConversationScreen::DebugChallengeData' has a wrong offset!");
static_assert(offsetof(UFortConversationScreen, DialogChoiceSoftClass) == 0x000318, "Member 'UFortConversationScreen::DialogChoiceSoftClass' has a wrong offset!");
static_assert(offsetof(UFortConversationScreen, DynamicPanel_DailogOptions) == 0x000368, "Member 'UFortConversationScreen::DynamicPanel_DailogOptions' has a wrong offset!");

// Class FortniteConversationUI.FortConversationScreenBase
// 0x0000 (0x02C8 - 0x02C8)
class UFortConversationScreenBase final : public UFortHUDElementWidget
{
public:
	void DisplayMessage(const struct FClientConversationMessagePayload& NewMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationScreenBase">();
	}
	static class UFortConversationScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationScreenBase>();
	}
};
static_assert(alignof(UFortConversationScreenBase) == 0x000008, "Wrong alignment on UFortConversationScreenBase");
static_assert(sizeof(UFortConversationScreenBase) == 0x0002C8, "Wrong size on UFortConversationScreenBase");

}

