#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortWaterBodyBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WaveSpectrumSettings_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FortWaterBodyBP.FortWaterBodyBP_C
// 0x0060 (0x0F80 - 0x0F20)
class AFortWaterBodyBP_C final : public AFortWaterBodyActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FWaveSpectrumSettings                  Wave_Spectrum_Settings;                            // 0x0F28(0x0048)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FluidSim_FN_C*                      FluidSimBP;                                        // 0x0F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FortWaterBodyBP(int32 EntryPoint);
	void OnReceivedBulletImpact(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortWaterBodyBP_C">();
	}
	static class AFortWaterBodyBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortWaterBodyBP_C>();
	}
};
static_assert(alignof(AFortWaterBodyBP_C) == 0x000010, "Wrong alignment on AFortWaterBodyBP_C");
static_assert(sizeof(AFortWaterBodyBP_C) == 0x000F80, "Wrong size on AFortWaterBodyBP_C");
static_assert(offsetof(AFortWaterBodyBP_C, UberGraphFrame) == 0x000F20, "Member 'AFortWaterBodyBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFortWaterBodyBP_C, Wave_Spectrum_Settings) == 0x000F28, "Member 'AFortWaterBodyBP_C::Wave_Spectrum_Settings' has a wrong offset!");
static_assert(offsetof(AFortWaterBodyBP_C, FluidSimBP) == 0x000F70, "Member 'AFortWaterBodyBP_C::FluidSimBP' has a wrong offset!");

}

