#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteConversationUI

#include "Basic.hpp"

#include "CommonDialogueRuntime_structs.hpp"


namespace SDK::Params
{

// Function FortniteConversationUI.FortConversationOption.BP_OnHoveredStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortConversationOption_BP_OnHoveredStateChanged final
{
public:
	bool                                          bIsChoiceHovered;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortConversationOption_BP_OnHoveredStateChanged) == 0x000001, "Wrong alignment on FortConversationOption_BP_OnHoveredStateChanged");
static_assert(sizeof(FortConversationOption_BP_OnHoveredStateChanged) == 0x000001, "Wrong size on FortConversationOption_BP_OnHoveredStateChanged");
static_assert(offsetof(FortConversationOption_BP_OnHoveredStateChanged, bIsChoiceHovered) == 0x000000, "Member 'FortConversationOption_BP_OnHoveredStateChanged::bIsChoiceHovered' has a wrong offset!");

// Function FortniteConversationUI.FortConversationOptionsPanel.AddChildToDynamicPanel
// 0x0010 (0x0010 - 0x0000)
struct FortConversationOptionsPanel_AddChildToDynamicPanel final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPanelSlot*                             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortConversationOptionsPanel_AddChildToDynamicPanel) == 0x000008, "Wrong alignment on FortConversationOptionsPanel_AddChildToDynamicPanel");
static_assert(sizeof(FortConversationOptionsPanel_AddChildToDynamicPanel) == 0x000010, "Wrong size on FortConversationOptionsPanel_AddChildToDynamicPanel");
static_assert(offsetof(FortConversationOptionsPanel_AddChildToDynamicPanel, Content) == 0x000000, "Member 'FortConversationOptionsPanel_AddChildToDynamicPanel::Content' has a wrong offset!");
static_assert(offsetof(FortConversationOptionsPanel_AddChildToDynamicPanel, ReturnValue) == 0x000008, "Member 'FortConversationOptionsPanel_AddChildToDynamicPanel::ReturnValue' has a wrong offset!");

// Function FortniteConversationUI.FortConversationScreenBase.DisplayMessage
// 0x0068 (0x0068 - 0x0000)
struct FortConversationScreenBase_DisplayMessage final
{
public:
	struct FClientConversationMessagePayload      NewMessage;                                        // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortConversationScreenBase_DisplayMessage) == 0x000008, "Wrong alignment on FortConversationScreenBase_DisplayMessage");
static_assert(sizeof(FortConversationScreenBase_DisplayMessage) == 0x000068, "Wrong size on FortConversationScreenBase_DisplayMessage");
static_assert(offsetof(FortConversationScreenBase_DisplayMessage, NewMessage) == 0x000000, "Member 'FortConversationScreenBase_DisplayMessage::NewMessage' has a wrong offset!");

}

