#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendChallengeInfoPanelEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FrontendChallengeInfoPanelEntry.FrontendChallengeInfoPanelEntry_C
// 0x0030 (0x02E8 - 0x02B8)
class UFrontendChallengeInfoPanelEntry_C final : public UAthenaChallengeInfoPanelEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PartyAssistInfoIntro;                              // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AmbientPartyAssistAttention;                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGroupChallengeTag_C*                   GroupChallengeTag;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PartyAssistHB;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherContent;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FrontendChallengeInfoPanelEntry(int32 EntryPoint);
	void Construct();
	void OnLocalPlayerMissingAssistedChallenge();
	void OnChallengeInfoSet();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontendChallengeInfoPanelEntry_C">();
	}
	static class UFrontendChallengeInfoPanelEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontendChallengeInfoPanelEntry_C>();
	}
};
static_assert(alignof(UFrontendChallengeInfoPanelEntry_C) == 0x000008, "Wrong alignment on UFrontendChallengeInfoPanelEntry_C");
static_assert(sizeof(UFrontendChallengeInfoPanelEntry_C) == 0x0002E8, "Wrong size on UFrontendChallengeInfoPanelEntry_C");
static_assert(offsetof(UFrontendChallengeInfoPanelEntry_C, UberGraphFrame) == 0x0002B8, "Member 'UFrontendChallengeInfoPanelEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFrontendChallengeInfoPanelEntry_C, PartyAssistInfoIntro) == 0x0002C0, "Member 'UFrontendChallengeInfoPanelEntry_C::PartyAssistInfoIntro' has a wrong offset!");
static_assert(offsetof(UFrontendChallengeInfoPanelEntry_C, AmbientPartyAssistAttention) == 0x0002C8, "Member 'UFrontendChallengeInfoPanelEntry_C::AmbientPartyAssistAttention' has a wrong offset!");
static_assert(offsetof(UFrontendChallengeInfoPanelEntry_C, GroupChallengeTag) == 0x0002D0, "Member 'UFrontendChallengeInfoPanelEntry_C::GroupChallengeTag' has a wrong offset!");
static_assert(offsetof(UFrontendChallengeInfoPanelEntry_C, PartyAssistHB) == 0x0002D8, "Member 'UFrontendChallengeInfoPanelEntry_C::PartyAssistHB' has a wrong offset!");
static_assert(offsetof(UFrontendChallengeInfoPanelEntry_C, SwitcherContent) == 0x0002E0, "Member 'UFrontendChallengeInfoPanelEntry_C::SwitcherContent' has a wrong offset!");

}

