#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_GenericTargetApply_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent
// 0x01E0 (0x01E0 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0008(0x0028)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0038(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate; // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_Event_NotifyTag;                            // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0088(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_TargetingGCParams_ReturnValue;            // 0x00E0(0x00B8)(ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x01A0(0x0028)()
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x01D0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent");
static_assert(sizeof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent) == 0x0001E0, "Wrong size on GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, EntryPoint) == 0x000000, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, Temp_struct_Variable) == 0x000008, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, Temp_struct_Variable_1) == 0x000030, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, K2Node_CustomEvent_TargetData_1) == 0x000038, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, K2Node_CustomEvent_ApplicationTag_1) == 0x000060, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, CallFunc_K2_CommitAbility_ReturnValue) == 0x000068, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, K2Node_Event_NotifyTag) == 0x00007C, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, Temp_bool_IsClosed_Variable) == 0x000084, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, K2Node_CustomEvent_TargetData_2) == 0x000088, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, K2Node_CustomEvent_ApplicationTag_2) == 0x0000B0, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000B8, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x0000B9, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000BC, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x0000CC, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, CallFunc_BooleanAND_ReturnValue) == 0x0000CD, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, CallFunc_WaitTargetSelection_ReturnValue) == 0x0000D0, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, CallFunc_TargetingGCParams_ReturnValue) == 0x0000E0, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::CallFunc_TargetingGCParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, Temp_bool_Has_Been_Initd_Variable) == 0x000198, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, K2Node_CustomEvent_TargetData) == 0x0001A0, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, K2Node_CustomEvent_ApplicationTag) == 0x0001C8, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x0001D0, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.ApplyEffect
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect");
static_assert(sizeof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect) == 0x000030, "Wrong size on GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect, TargetData) == 0x000000, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect, ApplicationTag) == 0x000028, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect::ApplicationTag' has a wrong offset!");

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.CastMontageNotifyStart
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_CastMontageNotifyStart final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_CastMontageNotifyStart) == 0x000004, "Wrong alignment on GA_Athena_ActivePower_GenericTargetApply_Parent_C_CastMontageNotifyStart");
static_assert(sizeof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_CastMontageNotifyStart) == 0x000008, "Wrong size on GA_Athena_ActivePower_GenericTargetApply_Parent_C_CastMontageNotifyStart");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_CastMontageNotifyStart, NotifyTag) == 0x000000, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_CastMontageNotifyStart::NotifyTag' has a wrong offset!");

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.Targeted_712B318342E20326067585ADEC197F67
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67");
static_assert(sizeof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67) == 0x000030, "Wrong size on GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67, TargetData) == 0x000000, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67, ApplicationTag) == 0x000028, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67::ApplicationTag' has a wrong offset!");

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.Cancelled_712B318342E20326067585ADEC197F67
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67");
static_assert(sizeof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67) == 0x000030, "Wrong size on GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67, TargetData) == 0x000000, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67, ApplicationTag) == 0x000028, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67::ApplicationTag' has a wrong offset!");

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.TargetingGCParams
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_TargetingGCParams final
{
public:
	struct FGameplayCueParameters                 ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_TargetingGCParams) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_GenericTargetApply_Parent_C_TargetingGCParams");
static_assert(sizeof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_TargetingGCParams) == 0x0000B8, "Wrong size on GA_Athena_ActivePower_GenericTargetApply_Parent_C_TargetingGCParams");
static_assert(offsetof(GA_Athena_ActivePower_GenericTargetApply_Parent_C_TargetingGCParams, ReturnValue) == 0x000000, "Member 'GA_Athena_ActivePower_GenericTargetApply_Parent_C_TargetingGCParams::ReturnValue' has a wrong offset!");

}

