#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_Parent

#include "Basic.hpp"

#include "GA_Athena_Power_Parent_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_ActivePower_Parent.GA_Athena_ActivePower_Parent_C
// 0x00A8 (0x0B78 - 0x0AD0)
class UGA_Athena_ActivePower_Parent_C : public UGA_Athena_Power_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ActivePower_Parent_C;     // 0x0AD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FailsafeDelay;                                     // 0x0AD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndAbilityOnMontageComplete;                       // 0x0ADC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ADD[0x3];                                      // 0x0ADD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CastMontage;                                       // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CastMontagePlayRate;                               // 0x0AE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CastMontageStartSection;                           // 0x0AEC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastMontageStopWhenAbilityEnds;                    // 0x0AF4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF5[0x3];                                      // 0x0AF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CastMontageRootMotionScale;                        // 0x0AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_AbilityEndCastNotify;                            // 0x0AFC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B04[0x4];                                      // 0x0B04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Tag_ActivationFailedReasonSwimming;                // 0x0B08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_SurfaceSwimming;                               // 0x0B28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowActivationWhileSwimming;                      // 0x0B30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B31[0x3];                                      // 0x0B31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoverGravityMultiplier;                            // 0x0B34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HoverVelocityMaintained;                           // 0x0B38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HoverAirControlAmount;                             // 0x0B3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_HoverGravity;                                   // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEH_Hover;                                         // 0x0B48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsHovering;                                        // 0x0B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          RemoveHoverOnAbilityEnd;                           // 0x0B51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B52[0x2];                                      // 0x0B52(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            GEH_PowerActive;                                   // 0x0B54(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_B5C[0x4];                                      // 0x0B5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_PowerActive;                                    // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UClass*                                 GE_PreventMove;                                    // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Handle_PreventMove;                                // 0x0B70(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_ActivePower_Parent(int32 EntryPoint);
	void CastMontageBlendOut();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void CastMontageNotifyEnd(const struct FGameplayTag& NotifyTag);
	void K2_OnEndAbility(bool bWasCancelled);
	void StartFailsafeDelay();
	void PowerCommitFailed();
	void PlayCastAnimation();
	void CastMontageCancelledOrInterrupted();
	void CastMontageNotifyEndAbility();
	void OnCompleted_778B4478405DA172C1A51EA022CF29FA(const struct FGameplayTag& NotifyTag);
	void OnBlendOut_778B4478405DA172C1A51EA022CF29FA(const struct FGameplayTag& NotifyTag);
	void OnInterrupted_778B4478405DA172C1A51EA022CF29FA(const struct FGameplayTag& NotifyTag);
	void OnCancelled_778B4478405DA172C1A51EA022CF29FA(const struct FGameplayTag& NotifyTag);
	void OnNotifyBegin_778B4478405DA172C1A51EA022CF29FA(const struct FGameplayTag& NotifyTag);
	void OnNotifyEnd_778B4478405DA172C1A51EA022CF29FA(const struct FGameplayTag& NotifyTag);
	void SetHover(bool On);
	void SetPawnCollision(class ACharacter* Character, bool CollisionOn);
	void SetBlockMovement(class AFortPlayerPawn* PlayerPawn_0, bool bLock);
	void InitAbility();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_ActivePower_Parent_C">();
	}
	static class UGA_Athena_ActivePower_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ActivePower_Parent_C>();
	}
};
static_assert(alignof(UGA_Athena_ActivePower_Parent_C) == 0x000008, "Wrong alignment on UGA_Athena_ActivePower_Parent_C");
static_assert(sizeof(UGA_Athena_ActivePower_Parent_C) == 0x000B78, "Wrong size on UGA_Athena_ActivePower_Parent_C");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, UberGraphFrame_GA_Athena_ActivePower_Parent_C) == 0x000AD0, "Member 'UGA_Athena_ActivePower_Parent_C::UberGraphFrame_GA_Athena_ActivePower_Parent_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, FailsafeDelay) == 0x000AD8, "Member 'UGA_Athena_ActivePower_Parent_C::FailsafeDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, EndAbilityOnMontageComplete) == 0x000ADC, "Member 'UGA_Athena_ActivePower_Parent_C::EndAbilityOnMontageComplete' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, CastMontage) == 0x000AE0, "Member 'UGA_Athena_ActivePower_Parent_C::CastMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, CastMontagePlayRate) == 0x000AE8, "Member 'UGA_Athena_ActivePower_Parent_C::CastMontagePlayRate' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, CastMontageStartSection) == 0x000AEC, "Member 'UGA_Athena_ActivePower_Parent_C::CastMontageStartSection' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, CastMontageStopWhenAbilityEnds) == 0x000AF4, "Member 'UGA_Athena_ActivePower_Parent_C::CastMontageStopWhenAbilityEnds' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, CastMontageRootMotionScale) == 0x000AF8, "Member 'UGA_Athena_ActivePower_Parent_C::CastMontageRootMotionScale' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, T_AbilityEndCastNotify) == 0x000AFC, "Member 'UGA_Athena_ActivePower_Parent_C::T_AbilityEndCastNotify' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, Tag_ActivationFailedReasonSwimming) == 0x000B08, "Member 'UGA_Athena_ActivePower_Parent_C::Tag_ActivationFailedReasonSwimming' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, Tag_SurfaceSwimming) == 0x000B28, "Member 'UGA_Athena_ActivePower_Parent_C::Tag_SurfaceSwimming' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, AllowActivationWhileSwimming) == 0x000B30, "Member 'UGA_Athena_ActivePower_Parent_C::AllowActivationWhileSwimming' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, HoverGravityMultiplier) == 0x000B34, "Member 'UGA_Athena_ActivePower_Parent_C::HoverGravityMultiplier' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, HoverVelocityMaintained) == 0x000B38, "Member 'UGA_Athena_ActivePower_Parent_C::HoverVelocityMaintained' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, HoverAirControlAmount) == 0x000B3C, "Member 'UGA_Athena_ActivePower_Parent_C::HoverAirControlAmount' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, GE_HoverGravity) == 0x000B40, "Member 'UGA_Athena_ActivePower_Parent_C::GE_HoverGravity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, GEH_Hover) == 0x000B48, "Member 'UGA_Athena_ActivePower_Parent_C::GEH_Hover' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, IsHovering) == 0x000B50, "Member 'UGA_Athena_ActivePower_Parent_C::IsHovering' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, RemoveHoverOnAbilityEnd) == 0x000B51, "Member 'UGA_Athena_ActivePower_Parent_C::RemoveHoverOnAbilityEnd' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, GEH_PowerActive) == 0x000B54, "Member 'UGA_Athena_ActivePower_Parent_C::GEH_PowerActive' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, GE_PowerActive) == 0x000B60, "Member 'UGA_Athena_ActivePower_Parent_C::GE_PowerActive' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, GE_PreventMove) == 0x000B68, "Member 'UGA_Athena_ActivePower_Parent_C::GE_PreventMove' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ActivePower_Parent_C, Handle_PreventMove) == 0x000B70, "Member 'UGA_Athena_ActivePower_Parent_C::Handle_PreventMove' has a wrong offset!");

}

