#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_LowGravity_GlitchPassive

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Athena_LowGravity_GlitchPassive.GA_Athena_LowGravity_GlitchPassive_C.ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive
// 0x0040 (0x0040 - 0x0000)
struct GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive) == 0x000008, "Wrong alignment on GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive");
static_assert(sizeof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive) == 0x000040, "Wrong size on GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, EntryPoint) == 0x000000, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags) == 0x000011, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000018, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective) == 0x000020, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_Athena_PartyAssistCheck_bIsAssistingObjective' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController) == 0x000021, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_Athena_PartyAssistCheck_bIsValidPlayerController' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_GetQuestManager_ReturnValue) == 0x000028, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000031, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000032, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000033, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000034, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x000035, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_Not_PreBool_ReturnValue) == 0x000036, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_Not_PreBool_ReturnValue_1) == 0x000037, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_BooleanAND_ReturnValue_1) == 0x000038, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_BooleanAND_ReturnValue_2) == 0x000039, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive, CallFunc_BooleanOR_ReturnValue) == 0x00003A, "Member 'GA_Athena_LowGravity_GlitchPassive_C_ExecuteUbergraph_GA_Athena_LowGravity_GlitchPassive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

