#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_AppleSun_Passive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_AppleSun_Passive.GA_Athena_AppleSun_Passive_C
// 0x0108 (0x0BB0 - 0x0AA8)
class UGA_Athena_AppleSun_Passive_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagRequirements               Falling_Tag;                                       // 0x0AB0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFortWorldItemDefinition*               ItemDef;                                           // 0x0AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Attribute;                                         // 0x0AF8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HasFallImmunity;                                   // 0x0B30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B31[0x7];                                      // 0x0B31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ThrowDownMontage;                                  // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanAirbagByJumping;                                // 0x0B48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Throwing;                                          // 0x0B49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PreviousCanAirbag;                                 // 0x0B4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCloseToGround;                                   // 0x0B4B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TimeSinceGrounded;                                 // 0x0B4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UpdateInterval;                                    // 0x0B50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxVelJumpPrompt;                                  // 0x0B54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinVelJumpPrompt;                                  // 0x0B58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTimeSinceGroundedForJumpPrompt;                 // 0x0B5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InInventory;                                       // 0x0B60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B61[0x7];                                      // 0x0B61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               ItemDef_VR;                                        // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Recharging_Tags;                                   // 0x0B70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  VR_tag;                                            // 0x0B90(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_AppleSun_Passive(int32 EntryPoint);
	void Remove_Item_From_Inventory_();
	void Throw_Server();
	void UpdateIsCloseToGround();
	void UpdateCanCrashpad();
	void SpawnProjectile();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void Triggered_6CF7877A4087E6390DA1828899D54EFB(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_6CF7877A4087E6390DA1828899D54EFB(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_6CF7877A4087E6390DA1828899D54EFB(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Triggered_E2E08D9245B8C2437B278CACDF6A674C(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_E2E08D9245B8C2437B278CACDF6A674C(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_E2E08D9245B8C2437B278CACDF6A674C(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void EventReceived_88451BF04FEA60EEE79926856BA05A42(const struct FGameplayEventData& Payload);
	void HasEnoughStacks(bool* Return);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_AppleSun_Passive_C">();
	}
	static class UGA_Athena_AppleSun_Passive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_AppleSun_Passive_C>();
	}
};
static_assert(alignof(UGA_Athena_AppleSun_Passive_C) == 0x000008, "Wrong alignment on UGA_Athena_AppleSun_Passive_C");
static_assert(sizeof(UGA_Athena_AppleSun_Passive_C) == 0x000BB0, "Wrong size on UGA_Athena_AppleSun_Passive_C");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_Athena_AppleSun_Passive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, Falling_Tag) == 0x000AB0, "Member 'UGA_Athena_AppleSun_Passive_C::Falling_Tag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, ItemDef) == 0x000AF0, "Member 'UGA_Athena_AppleSun_Passive_C::ItemDef' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, Attribute) == 0x000AF8, "Member 'UGA_Athena_AppleSun_Passive_C::Attribute' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, HasFallImmunity) == 0x000B30, "Member 'UGA_Athena_AppleSun_Passive_C::HasFallImmunity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, PlayerPawn) == 0x000B38, "Member 'UGA_Athena_AppleSun_Passive_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, ThrowDownMontage) == 0x000B40, "Member 'UGA_Athena_AppleSun_Passive_C::ThrowDownMontage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, CanAirbagByJumping) == 0x000B48, "Member 'UGA_Athena_AppleSun_Passive_C::CanAirbagByJumping' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, Throwing) == 0x000B49, "Member 'UGA_Athena_AppleSun_Passive_C::Throwing' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, PreviousCanAirbag) == 0x000B4A, "Member 'UGA_Athena_AppleSun_Passive_C::PreviousCanAirbag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, IsCloseToGround) == 0x000B4B, "Member 'UGA_Athena_AppleSun_Passive_C::IsCloseToGround' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, TimeSinceGrounded) == 0x000B4C, "Member 'UGA_Athena_AppleSun_Passive_C::TimeSinceGrounded' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, UpdateInterval) == 0x000B50, "Member 'UGA_Athena_AppleSun_Passive_C::UpdateInterval' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, MaxVelJumpPrompt) == 0x000B54, "Member 'UGA_Athena_AppleSun_Passive_C::MaxVelJumpPrompt' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, MinVelJumpPrompt) == 0x000B58, "Member 'UGA_Athena_AppleSun_Passive_C::MinVelJumpPrompt' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, MinTimeSinceGroundedForJumpPrompt) == 0x000B5C, "Member 'UGA_Athena_AppleSun_Passive_C::MinTimeSinceGroundedForJumpPrompt' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, InInventory) == 0x000B60, "Member 'UGA_Athena_AppleSun_Passive_C::InInventory' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, ItemDef_VR) == 0x000B68, "Member 'UGA_Athena_AppleSun_Passive_C::ItemDef_VR' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, Recharging_Tags) == 0x000B70, "Member 'UGA_Athena_AppleSun_Passive_C::Recharging_Tags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_Passive_C, VR_tag) == 0x000B90, "Member 'UGA_Athena_AppleSun_Passive_C::VR_tag' has a wrong offset!");

}

