#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_MechanicFlopper

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_MechanicFlopper.GA_Athena_MechanicFlopper_C.ExecuteUbergraph_GA_Athena_MechanicFlopper
// 0x0078 (0x0078 - 0x0000)
struct GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x0010(0x0020)()
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpgradeAllWeaponsVerticalToRarity_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1; // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1; // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1; // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper) == 0x000008, "Wrong alignment on GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper");
static_assert(sizeof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper) == 0x000078, "Wrong size on GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, EntryPoint) == 0x000000, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_GetGameStateAthena_ReturnValue) == 0x000008, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x000010, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_IsServer_ReturnValue) == 0x000030, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_HasTag_ReturnValue) == 0x000031, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_GetActivatingPawn_ReturnValue) == 0x000038, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000040, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput) == 0x000048, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_UpgradeAllWeaponsVerticalToRarity_ReturnValue) == 0x000058, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_UpgradeAllWeaponsVerticalToRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000059, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x00005A, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x00005B, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1) == 0x00005C, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1) == 0x00005D, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1) == 0x00005E, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_Not_PreBool_ReturnValue) == 0x00005F, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_Not_PreBool_ReturnValue_1) == 0x000060, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_BooleanAND_ReturnValue_1) == 0x000062, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_GetQuestManager_ReturnValue) == 0x000068, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_BooleanOR_ReturnValue) == 0x000070, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000071, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000072, "Member 'GA_Athena_MechanicFlopper_C_ExecuteUbergraph_GA_Athena_MechanicFlopper::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");

}

