#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_SpawnProjectile_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent
// 0x0020 (0x0020 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NotifyTag;                            // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    CallFunc_PowerSpawnProjectile_ProjectileSpawned;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent) == 0x000020, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, EntryPoint) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, K2Node_Event_NotifyTag) == 0x000004, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, CallFunc_PowerSpawnProjectile_ProjectileSpawned) == 0x000010, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::CallFunc_PowerSpawnProjectile_ProjectileSpawned' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000019, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, Temp_bool_Has_Been_Initd_Variable) == 0x00001A, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x00001B, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x00001C, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent, CallFunc_K2_CommitAbility_ReturnValue) == 0x00001E, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.CastMontageNotifyStart
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_CastMontageNotifyStart final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_CastMontageNotifyStart) == 0x000004, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_CastMontageNotifyStart");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_CastMontageNotifyStart) == 0x000008, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_CastMontageNotifyStart");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_CastMontageNotifyStart, NotifyTag) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_CastMontageNotifyStart::NotifyTag' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.PowerSpawnProjectile
// 0x0110 (0x0110 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile final
{
public:
	class AFortProjectileBase*                    ProjectileSpawned;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_SpawnProjectileGCParams_ReturnValue;      // 0x0008(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Get_Homing_Target_HomingTarget;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetProjectileSpawnLocationAndRotation_Location; // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetProjectileSpawnLocationAndRotation_Direction; // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    CallFunc_SpawnProjectile_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile) == 0x000110, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, ProjectileSpawned) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::ProjectileSpawned' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_SpawnProjectileGCParams_ReturnValue) == 0x000008, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_SpawnProjectileGCParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_K2_HasAuthority_ReturnValue) == 0x0000C0, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_Get_Homing_Target_HomingTarget) == 0x0000C8, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_Get_Homing_Target_HomingTarget' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_GetProjectileSpawnLocationAndRotation_Location) == 0x0000D0, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_GetProjectileSpawnLocationAndRotation_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_GetProjectileSpawnLocationAndRotation_Direction) == 0x0000DC, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_GetProjectileSpawnLocationAndRotation_Direction' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_IsValidClass_ReturnValue) == 0x0000E8, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_GetValueAtLevel_ReturnValue) == 0x0000EC, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0000F0, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, Temp_bool_Variable) == 0x0000F4, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000F8, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, K2Node_Select_Default) == 0x000104, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile, CallFunc_SpawnProjectile_ReturnValue) == 0x000108, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_PowerSpawnProjectile::CallFunc_SpawnProjectile_ReturnValue' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.GetProjectileSpawnLocationAndRotation
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Direction;                                         // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation) == 0x0000A8, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, Location) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, Direction) == 0x00000C, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::Direction' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_GetValueAtLevel_ReturnValue) == 0x000018, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000028, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x000034, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_GetSocketLocation_ReturnValue) == 0x000040, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_BreakRotator_Roll) == 0x00004C, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_BreakRotator_Pitch) == 0x000050, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_BreakRotator_Yaw) == 0x000054, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000058, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000064, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_Normal_ReturnValue) == 0x000068, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_MakeRotator_ReturnValue) == 0x000074, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000080, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_Add_VectorVector_ReturnValue) == 0x00008C, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000098, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileSpawnLocationAndRotation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.Get Homing Target
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_Get_Homing_Target final
{
public:
	class AActor*                                 HomingTarget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_Get_Homing_Target) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_Get_Homing_Target");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_Get_Homing_Target) == 0x000008, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_Get_Homing_Target");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_Get_Homing_Target, HomingTarget) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_Get_Homing_Target::HomingTarget' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.MakeEffectContainers
// 0x02E0 (0x02E0 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers final
{
public:
	struct FFortGameplayEffectContainerSpec       Hit;                                               // 0x0000(0x00B8)(Parm, OutParm)
	struct FFortGameplayEffectContainerSpec       Explode;                                           // 0x00B8(0x00B8)(Parm, OutParm)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0170(0x00B8)()
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_1; // 0x0228(0x00B8)()
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers) == 0x0002E0, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers, Hit) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers::Hit' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers, Explode) == 0x0000B8, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers::Explode' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000170, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_1) == 0x000228, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_MakeEffectContainers::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue_1' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.InitAbility
// 0x0170 (0x0170 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_InitAbility final
{
public:
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeEffectContainers_Hit;                 // 0x0000(0x00B8)()
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeEffectContainers_Explode;             // 0x00B8(0x00B8)()
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_InitAbility) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_InitAbility");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_InitAbility) == 0x000170, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_InitAbility");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_InitAbility, CallFunc_MakeEffectContainers_Hit) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_InitAbility::CallFunc_MakeEffectContainers_Hit' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_InitAbility, CallFunc_MakeEffectContainers_Explode) == 0x0000B8, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_InitAbility::CallFunc_MakeEffectContainers_Explode' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.SpawnProjectileGCParams
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnProjectileGCParams final
{
public:
	struct FGameplayCueParameters                 ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnProjectileGCParams) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnProjectileGCParams");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnProjectileGCParams) == 0x0000B8, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnProjectileGCParams");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnProjectileGCParams, ReturnValue) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnProjectileGCParams::ReturnValue' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.AddAdditionalExplosionContainer
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_AddAdditionalExplosionContainer final
{
public:
	class AFortProjectileBase*                    Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0008(0x00B8)()
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_AddAdditionalExplosionContainer) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_AddAdditionalExplosionContainer");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_AddAdditionalExplosionContainer) == 0x0000C0, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_AddAdditionalExplosionContainer");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_AddAdditionalExplosionContainer, Projectile) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_AddAdditionalExplosionContainer::Projectile' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_AddAdditionalExplosionContainer, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000008, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_AddAdditionalExplosionContainer::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.SpawnTrajectoryIndicator
// 0x0010 (0x0010 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnTrajectoryIndicator final
{
public:
	bool                                          bSpawnOnEquip;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileTrajectory*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnTrajectoryIndicator) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnTrajectoryIndicator");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnTrajectoryIndicator) == 0x000010, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnTrajectoryIndicator");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnTrajectoryIndicator, bSpawnOnEquip) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnTrajectoryIndicator::bSpawnOnEquip' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnTrajectoryIndicator, ReturnValue) == 0x000008, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_SpawnTrajectoryIndicator::ReturnValue' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.GetProjectileTrajectoryPoints
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints final
{
public:
	TArray<struct FVector>                        OutSplinePoints;                                   // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<struct FVector>                        OutSplineTangents;                                 // 0x0010(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	struct FHitResult                             OutHitResult;                                      // 0x0020(0x008C)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints) == 0x0000B0, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints, OutSplinePoints) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints::OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints, OutSplineTangents) == 0x000010, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints::OutSplineTangents' has a wrong offset!");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints, OutHitResult) == 0x000020, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryPoints::OutHitResult' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.ShouldOnlyShowTrajectoryOnUse
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_ShouldOnlyShowTrajectoryOnUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ShouldOnlyShowTrajectoryOnUse) == 0x000001, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_ShouldOnlyShowTrajectoryOnUse");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ShouldOnlyShowTrajectoryOnUse) == 0x000001, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_ShouldOnlyShowTrajectoryOnUse");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_ShouldOnlyShowTrajectoryOnUse, ReturnValue) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_ShouldOnlyShowTrajectoryOnUse::ReturnValue' has a wrong offset!");

// Function GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C.GetProjectileTrajectoryActor
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryActor final
{
public:
	TSubclassOf<class AFortProjectileTrajectory>  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryActor) == 0x000008, "Wrong alignment on GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryActor");
static_assert(sizeof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryActor) == 0x000008, "Wrong size on GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryActor");
static_assert(offsetof(GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryActor, ReturnValue) == 0x000000, "Member 'GA_Athena_ActivePower_SpawnProjectile_Parent_C_GetProjectileTrajectoryActor::ReturnValue' has a wrong offset!");

}

