#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Tapas_SkyStrike_Fire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GA_Athena_ActivePower_GenericTargetApply_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HighTower_Tapas_SkyStrike_Fire.GA_HighTower_Tapas_SkyStrike_Fire_C
// 0x0130 (0x0DC0 - 0x0C90)
class UGA_HighTower_Tapas_SkyStrike_Fire_C : public UGA_Athena_ActivePower_GenericTargetApply_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_HighTower_Tapas_SkyStrike_Fire_C; // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Tag_SpawnProjectiles;                              // 0x0C98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ProjToSpawn;                                       // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceOverlapRadius;                                // 0x0CA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceOffset;                                       // 0x0CAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HammerTraceEnd;                                    // 0x0CB8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HammerTraceStart;                                  // 0x0CC4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnOffset;                                       // 0x0CD0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_CloudFormation;                                 // 0x0CDC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTagSpawnProjectile;                           // 0x0CE4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerTraceOffset;                                 // 0x0CEC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ProjDownwardSpeed;                                 // 0x0CF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         GravityScale;                                      // 0x0D18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1C[0x4];                                      // 0x0D1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SetIndicatorPosTimer;                              // 0x0D20(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_SkyStrike_AimIndicator_C*           AimIndicator;                                      // 0x0D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxRange;                                          // 0x0D30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SpawnedProjectileAlready;                          // 0x0D50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D51[0x3];                                      // 0x0D51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AimingGC;                                          // 0x0D54(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         WorldMinZ;                                         // 0x0D5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_HandCastEffects;                                // 0x0D60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentGravity;                                    // 0x0D68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6C[0x4];                                      // 0x0D6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           GravityRejuvinationTimer;                          // 0x0D70(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         GravityUpdateTime;                                 // 0x0D78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeGravityStartsComingBack;                // 0x0D7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         AllowHover;                                        // 0x0D80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HoverGravity;                                      // 0x0DA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_HighTower_Tapas_SkyStrike_Fire(int32 EntryPoint);
	void DelayThenStartBringingGravityBack();
	void IncreaseGravity();
	void StartBringingGravityBack();
	void SetIndicatorPos();
	void K2_OnEndAbility(bool bWasCancelled);
	void Target_();
	void K2_ActivateAbility();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void FindHammerPath();
	void GetAimedAtPoint(struct FVector* OutHit_Location);
	void SetHover(bool On);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HighTower_Tapas_SkyStrike_Fire_C">();
	}
	static class UGA_HighTower_Tapas_SkyStrike_Fire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Tapas_SkyStrike_Fire_C>();
	}
};
static_assert(alignof(UGA_HighTower_Tapas_SkyStrike_Fire_C) == 0x000008, "Wrong alignment on UGA_HighTower_Tapas_SkyStrike_Fire_C");
static_assert(sizeof(UGA_HighTower_Tapas_SkyStrike_Fire_C) == 0x000DC0, "Wrong size on UGA_HighTower_Tapas_SkyStrike_Fire_C");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, UberGraphFrame_GA_HighTower_Tapas_SkyStrike_Fire_C) == 0x000C90, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::UberGraphFrame_GA_HighTower_Tapas_SkyStrike_Fire_C' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, Tag_SpawnProjectiles) == 0x000C98, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::Tag_SpawnProjectiles' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, ProjToSpawn) == 0x000CA0, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::ProjToSpawn' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, TraceOverlapRadius) == 0x000CA8, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::TraceOverlapRadius' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, TraceOffset) == 0x000CAC, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::TraceOffset' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, HammerTraceEnd) == 0x000CB8, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::HammerTraceEnd' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, HammerTraceStart) == 0x000CC4, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::HammerTraceStart' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, SpawnOffset) == 0x000CD0, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::SpawnOffset' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, GC_CloudFormation) == 0x000CDC, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::GC_CloudFormation' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, EventTagSpawnProjectile) == 0x000CE4, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::EventTagSpawnProjectile' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, PlayerTraceOffset) == 0x000CEC, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::PlayerTraceOffset' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, ProjDownwardSpeed) == 0x000CF8, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::ProjDownwardSpeed' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, GravityScale) == 0x000D18, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::GravityScale' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, SetIndicatorPosTimer) == 0x000D20, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::SetIndicatorPosTimer' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, AimIndicator) == 0x000D28, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::AimIndicator' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, MaxRange) == 0x000D30, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::MaxRange' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, SpawnedProjectileAlready) == 0x000D50, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::SpawnedProjectileAlready' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, AimingGC) == 0x000D54, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::AimingGC' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, WorldMinZ) == 0x000D5C, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::WorldMinZ' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, GC_HandCastEffects) == 0x000D60, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::GC_HandCastEffects' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, CurrentGravity) == 0x000D68, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::CurrentGravity' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, GravityRejuvinationTimer) == 0x000D70, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::GravityRejuvinationTimer' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, GravityUpdateTime) == 0x000D78, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::GravityUpdateTime' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, DelayBeforeGravityStartsComingBack) == 0x000D7C, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::DelayBeforeGravityStartsComingBack' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, AllowHover) == 0x000D80, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::AllowHover' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tapas_SkyStrike_Fire_C, HoverGravity) == 0x000DA0, "Member 'UGA_HighTower_Tapas_SkyStrike_Fire_C::HoverGravity' has a wrong offset!");

}

