#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Date_BallLightning

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C.ExecuteUbergraph_GA_HighTower_Date_BallLightning
// 0x00A8 (0x00A8 - 0x0000)
struct GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldTime;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Check_Min_Hold_Time_Success;              // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Check_Min_Hold_Time_MinTimeRemaining;     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NotifyTag;                            // 0x006C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_CustomEvent_ProjectileSpawned;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortProjectileBase* ProjectileSpawned)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning) == 0x000008, "Wrong alignment on GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning");
static_assert(sizeof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning) == 0x0000A8, "Wrong size on GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, EntryPoint) == 0x000000, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000018, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x000038, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_WaitNetSync_ReturnValue) == 0x000058, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, K2Node_Event_HoldTime) == 0x000060, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::K2Node_Event_HoldTime' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_IsValid_ReturnValue_2) == 0x000064, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, K2Node_Event_bWasCancelled) == 0x000065, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_Check_Min_Hold_Time_Success) == 0x000066, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_Check_Min_Hold_Time_Success' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_Check_Min_Hold_Time_MinTimeRemaining) == 0x000068, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_Check_Min_Hold_Time_MinTimeRemaining' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, K2Node_Event_NotifyTag) == 0x00006C, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000074, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, K2Node_CustomEvent_ProjectileSpawned) == 0x000078, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::K2Node_CustomEvent_ProjectileSpawned' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, K2Node_CreateDelegate_OutputDelegate_4) == 0x000090, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A0, "Member 'GA_HighTower_Date_BallLightning_C_ExecuteUbergraph_GA_HighTower_Date_BallLightning::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C.CustomEvent_2
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_Date_BallLightning_C_CustomEvent_2 final
{
public:
	class AFortProjectileBase*                    ProjectileSpawned;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Date_BallLightning_C_CustomEvent_2) == 0x000008, "Wrong alignment on GA_HighTower_Date_BallLightning_C_CustomEvent_2");
static_assert(sizeof(GA_HighTower_Date_BallLightning_C_CustomEvent_2) == 0x000008, "Wrong size on GA_HighTower_Date_BallLightning_C_CustomEvent_2");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_CustomEvent_2, ProjectileSpawned) == 0x000000, "Member 'GA_HighTower_Date_BallLightning_C_CustomEvent_2::ProjectileSpawned' has a wrong offset!");

// Function GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C.CastMontageNotifyStart
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_Date_BallLightning_C_CastMontageNotifyStart final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Date_BallLightning_C_CastMontageNotifyStart) == 0x000004, "Wrong alignment on GA_HighTower_Date_BallLightning_C_CastMontageNotifyStart");
static_assert(sizeof(GA_HighTower_Date_BallLightning_C_CastMontageNotifyStart) == 0x000008, "Wrong size on GA_HighTower_Date_BallLightning_C_CastMontageNotifyStart");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_CastMontageNotifyStart, NotifyTag) == 0x000000, "Member 'GA_HighTower_Date_BallLightning_C_CastMontageNotifyStart::NotifyTag' has a wrong offset!");

// Function GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_HighTower_Date_BallLightning_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HighTower_Date_BallLightning_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_HighTower_Date_BallLightning_C_K2_OnEndAbility");
static_assert(sizeof(GA_HighTower_Date_BallLightning_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_HighTower_Date_BallLightning_C_K2_OnEndAbility");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_HighTower_Date_BallLightning_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C.Released
// 0x0004 (0x0004 - 0x0000)
struct GA_HighTower_Date_BallLightning_C_Released final
{
public:
	float                                         HoldTime;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Date_BallLightning_C_Released) == 0x000004, "Wrong alignment on GA_HighTower_Date_BallLightning_C_Released");
static_assert(sizeof(GA_HighTower_Date_BallLightning_C_Released) == 0x000004, "Wrong size on GA_HighTower_Date_BallLightning_C_Released");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_Released, HoldTime) == 0x000000, "Member 'GA_HighTower_Date_BallLightning_C_Released::HoldTime' has a wrong offset!");

// Function GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C.InitAbility
// 0x0004 (0x0004 - 0x0000)
struct GA_HighTower_Date_BallLightning_C_InitAbility final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Date_BallLightning_C_InitAbility) == 0x000004, "Wrong alignment on GA_HighTower_Date_BallLightning_C_InitAbility");
static_assert(sizeof(GA_HighTower_Date_BallLightning_C_InitAbility) == 0x000004, "Wrong size on GA_HighTower_Date_BallLightning_C_InitAbility");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_InitAbility, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'GA_HighTower_Date_BallLightning_C_InitAbility::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");

// Function GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C.Check Min Hold Time
// 0x0018 (0x0018 - 0x0000)
struct GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinTimeRemaining;                                  // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time) == 0x000004, "Wrong alignment on GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time");
static_assert(sizeof(GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time) == 0x000018, "Wrong size on GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time, Success) == 0x000000, "Member 'GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time::Success' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time, MinTimeRemaining) == 0x000004, "Member 'GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time::MinTimeRemaining' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000010, "Member 'GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000014, "Member 'GA_HighTower_Date_BallLightning_C_Check_Min_Hold_Time::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C.PowerSpawnProjectile
// 0x0010 (0x0010 - 0x0000)
struct GA_HighTower_Date_BallLightning_C_PowerSpawnProjectile final
{
public:
	class AFortProjectileBase*                    ProjectileSpawned;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    CallFunc_PowerSpawnProjectile_ProjectileSpawned;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Date_BallLightning_C_PowerSpawnProjectile) == 0x000008, "Wrong alignment on GA_HighTower_Date_BallLightning_C_PowerSpawnProjectile");
static_assert(sizeof(GA_HighTower_Date_BallLightning_C_PowerSpawnProjectile) == 0x000010, "Wrong size on GA_HighTower_Date_BallLightning_C_PowerSpawnProjectile");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_PowerSpawnProjectile, ProjectileSpawned) == 0x000000, "Member 'GA_HighTower_Date_BallLightning_C_PowerSpawnProjectile::ProjectileSpawned' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_PowerSpawnProjectile, CallFunc_PowerSpawnProjectile_ProjectileSpawned) == 0x000008, "Member 'GA_HighTower_Date_BallLightning_C_PowerSpawnProjectile::CallFunc_PowerSpawnProjectile_ProjectileSpawned' has a wrong offset!");

// Function GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C.K2_CanActivateAbility
// 0x00A0 (0x00A0 - 0x0000)
struct GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_K2_CanActivateAbility_RelevantTags;       // 0x0078(0x0020)()
	bool                                          CallFunc_K2_CanActivateAbility_ReturnValue;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility");
static_assert(sizeof(GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility) == 0x0000A0, "Wrong size on GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility, CallFunc_K2_CanActivateAbility_RelevantTags) == 0x000078, "Member 'GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility::CallFunc_K2_CanActivateAbility_RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility, CallFunc_K2_CanActivateAbility_ReturnValue) == 0x000098, "Member 'GA_HighTower_Date_BallLightning_C_K2_CanActivateAbility::CallFunc_K2_CanActivateAbility_ReturnValue' has a wrong offset!");

}

