#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Tomato_RepulsorCannon

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GA_Athena_ActivePower_GenericTargetApply_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C
// 0x00E0 (0x0D70 - 0x0C90)
class UGA_HighTower_Tomato_RepulsorCannon_C : public UGA_Athena_ActivePower_GenericTargetApply_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_HighTower_Tomato_RepulsorCannon_C; // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Range;                                             // 0x0C98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                FxBeamEndPoint;                                    // 0x0CB8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_BeamLoop;                                       // 0x0CC4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCC[0x4];                                      // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LimitRotationTickHandle;                           // 0x0CD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AimScale;                                          // 0x0CD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_Slow_Handle;                                    // 0x0CDC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseStrength;                                   // 0x0CE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditionalZLaunch;                                 // 0x0CE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SlowDuringHover;                                   // 0x0CEC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SlowRotationDuringAbility;                         // 0x0CED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CEE[0x2];                                      // 0x0CEE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GC_Blast;                                          // 0x0CF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_ChargeUp;                                       // 0x0CF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         SavedHitActors;                                    // 0x0D00(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AActor*>                         TargetDataArray;                                   // 0x0D10(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         NumberOfTraces;                                    // 0x0D20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         TimeBetweenTraces;                                 // 0x0D40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         AimScaleTickAmount;                                // 0x0D60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HitWorldGC;                                        // 0x0D64(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon(int32 EntryPoint);
	void CustomEvent_0();
	void CastMontageCancelledOrInterrupted();
	void CastMontageBlendOut();
	void Trace();
	void SetHover(bool On);
	void HandleAimScale();
	void OnAbilityActivated();
	void CastMontageNotifyEndAbility();
	void TargetTick();
	void K2_OnEndAbility(bool bWasCancelled);
	void Reset();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void Targeted_BC710BC0457E9C272340D29C282F4A22(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_BC710BC0457E9C272340D29C282F4A22(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Targeted_6CCC317040D245E97B19C2AD0E09D396(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_6CCC317040D245E97B19C2AD0E09D396(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	struct FGameplayCueParameters TargetingGCParams();
	void Update_Rotation_Input_Scale(bool LimitRotation, float InInputPitchScale, float InInputYawScale);
	void LaunchPlayer(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HighTower_Tomato_RepulsorCannon_C">();
	}
	static class UGA_HighTower_Tomato_RepulsorCannon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Tomato_RepulsorCannon_C>();
	}
};
static_assert(alignof(UGA_HighTower_Tomato_RepulsorCannon_C) == 0x000008, "Wrong alignment on UGA_HighTower_Tomato_RepulsorCannon_C");
static_assert(sizeof(UGA_HighTower_Tomato_RepulsorCannon_C) == 0x000D70, "Wrong size on UGA_HighTower_Tomato_RepulsorCannon_C");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, UberGraphFrame_GA_HighTower_Tomato_RepulsorCannon_C) == 0x000C90, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::UberGraphFrame_GA_HighTower_Tomato_RepulsorCannon_C' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, Range) == 0x000C98, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::Range' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, FxBeamEndPoint) == 0x000CB8, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::FxBeamEndPoint' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, GC_BeamLoop) == 0x000CC4, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::GC_BeamLoop' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, LimitRotationTickHandle) == 0x000CD0, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::LimitRotationTickHandle' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, AimScale) == 0x000CD8, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::AimScale' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, GE_Slow_Handle) == 0x000CDC, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::GE_Slow_Handle' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, ImpulseStrength) == 0x000CE4, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::ImpulseStrength' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, AdditionalZLaunch) == 0x000CE8, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::AdditionalZLaunch' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, SlowDuringHover) == 0x000CEC, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::SlowDuringHover' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, SlowRotationDuringAbility) == 0x000CED, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::SlowRotationDuringAbility' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, GC_Blast) == 0x000CF0, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::GC_Blast' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, GC_ChargeUp) == 0x000CF8, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::GC_ChargeUp' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, SavedHitActors) == 0x000D00, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::SavedHitActors' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, TargetDataArray) == 0x000D10, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::TargetDataArray' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, NumberOfTraces) == 0x000D20, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::NumberOfTraces' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, TimeBetweenTraces) == 0x000D40, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::TimeBetweenTraces' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, AimScaleTickAmount) == 0x000D60, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::AimScaleTickAmount' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Tomato_RepulsorCannon_C, HitWorldGC) == 0x000D64, "Member 'UGA_HighTower_Tomato_RepulsorCannon_C::HitWorldGC' has a wrong offset!");

}

