#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Grape_BrambleShield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HighTower_Grape_BrambleShield.GA_HighTower_Grape_BrambleShield_C
// 0x0208 (0x0EA0 - 0x0C98)
class UGA_HighTower_Grape_BrambleShield_C : public UGA_Athena_ActivePower_GenericTargetApplyEffectToSelf_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_HighTower_Grape_BrambleShield_C; // 0x0C98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABGA_HighTower_Grape_BrambleShield_C*   BrambleShield;                                     // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_ForceEnd;                                    // 0x0CA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle_Heal;                                  // 0x0CB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_HealInterval;                                  // 0x0CB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_HealTargeting;                                 // 0x0CD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_FinalHealTargeting;                            // 0x0CE0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_InSafeZone;                                    // 0x0CE8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Heal;                                           // 0x0CF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_FinalHeal;                                      // 0x0CF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Heal;                                           // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_FinalHeal;                                      // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_HealInStorm;                                    // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_FinalHealInStorm;                               // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MaxHealCount;                                  // 0x0D20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         HealCount;                                         // 0x0D40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Activate;                                       // 0x0D44(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4C[0x4];                                      // 0x0D4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_KnockBack;                                      // 0x0D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_KnockbackTargeting;                            // 0x0D58(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delay_PostFinalHeal;                               // 0x0D60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayForWeaponHolster;                             // 0x0D64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BrambleRadiusForPawnCapsule;                       // 0x0D68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachedUnscaledPawnCapsuleRadius;                   // 0x0D6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachedCapsuleHalfHeight;                           // 0x0D70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanBeCancelled;                                    // 0x0D74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Cancelled;                                         // 0x0D75(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D76[0x2];                                      // 0x0D76(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBeforeCanBeCancelled;                         // 0x0D78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Destroyed;                                         // 0x0D7C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DebugLogBrambleShield;                             // 0x0D7D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D7E[0x2];                                      // 0x0D7E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  T_BrambleActive;                                   // 0x0D80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PostEndCleanUpDelay;                               // 0x0DA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA4[0x4];                                      // 0x0DA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         LaunchHorizSpeedStart;                             // 0x0DA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         LaunchVertSpeedStart;                              // 0x0DC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         LaunchHorizSpeedEnd;                               // 0x0DE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         LaunchVertSpeedEnd;                                // 0x0E08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         EndJumpVelMaintained;                              // 0x0E28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostRemovalLaunch;                                 // 0x0E2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BallEndAdditionVelInAir;                           // 0x0E30(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BallEndAdditionVelOnGround;                        // 0x0E3C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BallVelMult;                                       // 0x0E48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToReceedBeforeExit;                            // 0x0E4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndAbilityHasBeenCalled;                           // 0x0E50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E51[0x7];                                      // 0x0E51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_ImmunityToNextFallDamage;                       // 0x0E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         GEs_ToApplyToBrambleShield;                        // 0x0E60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          CapsuleIsEnlarged;                                 // 0x0E70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E71[0x7];                                      // 0x0E71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0E78(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HitAPawn;                                          // 0x0E88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E89[0x7];                                      // 0x0E89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0E90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Grape_BrambleShield(int32 EntryPoint);
	void SetUpBinds();
	void EndCalledCleanUp();
	void HolsterWeapon();
	void ResetUnholsterWeapon();
	void K2_OnEndAbility(bool bWasCancelled);
	void UnholsterWeapon();
	void PostFinalHealTimerExpiredExitBall();
	void Jump_and_Impulse_Character(bool UseAcceleration, float HorizSpeed, float VertSpeed, bool IsFinishingAbility);
	void ShieldDestoyedClient();
	void PostFinalHealTimerExpiredStartFX();
	void ResetCanBeDestroyedTimedOutOrCancelled();
	void OnShieldDestroyedTimedOutOrCancelled();
	void SetUpCanBeCancelledTimer();
	void RestorePawnCapsule();
	void TryEnlargePawnCapsule();
	void OnAbilityActivated();
	void Knockback();
	void SetUpHeal();
	void BrambleDeath(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ResetCancelDoOnce();
	void ShieldCancelled();
	void FinalHeal();
	void Heal();
	void SpawnShield();
	void ApplyEffectToSelf();
	void Added_B062BB48404246EB7F68D69FCABA4520();
	void EventReceived_D1777FEF4482E750460437B982179190(const struct FGameplayEventData& Payload);
	void OnSync_D537CF664BFC4156F258578EB2D9DB1F();
	void Targeted_410A3FBD499CDCEFA696E9965CD7840E(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_410A3FBD499CDCEFA696E9965CD7840E(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Targeted_6778EE694A9427574714B89B0813D7F0(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_6778EE694A9427574714B89B0813D7F0(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Targeted_B04E4AFF4DE38A07B46D57B326B9E290(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_B04E4AFF4DE38A07B46D57B326B9E290(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void EventReceived_969B45B6487FBD60A6B246A5C81F87BF(const struct FGameplayEventData& Payload);
	void InitAbility();
	struct FTransform GetShieldSpawnTransform();
	bool OnLastHeal();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HighTower_Grape_BrambleShield_C">();
	}
	static class UGA_HighTower_Grape_BrambleShield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Grape_BrambleShield_C>();
	}
};
static_assert(alignof(UGA_HighTower_Grape_BrambleShield_C) == 0x000008, "Wrong alignment on UGA_HighTower_Grape_BrambleShield_C");
static_assert(sizeof(UGA_HighTower_Grape_BrambleShield_C) == 0x000EA0, "Wrong size on UGA_HighTower_Grape_BrambleShield_C");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, UberGraphFrame_GA_HighTower_Grape_BrambleShield_C) == 0x000C98, "Member 'UGA_HighTower_Grape_BrambleShield_C::UberGraphFrame_GA_HighTower_Grape_BrambleShield_C' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, BrambleShield) == 0x000CA0, "Member 'UGA_HighTower_Grape_BrambleShield_C::BrambleShield' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Event_ForceEnd) == 0x000CA8, "Member 'UGA_HighTower_Grape_BrambleShield_C::Event_ForceEnd' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, TimerHandle_Heal) == 0x000CB0, "Member 'UGA_HighTower_Grape_BrambleShield_C::TimerHandle_Heal' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Row_HealInterval) == 0x000CB8, "Member 'UGA_HighTower_Grape_BrambleShield_C::Row_HealInterval' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Tag_HealTargeting) == 0x000CD8, "Member 'UGA_HighTower_Grape_BrambleShield_C::Tag_HealTargeting' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Tag_FinalHealTargeting) == 0x000CE0, "Member 'UGA_HighTower_Grape_BrambleShield_C::Tag_FinalHealTargeting' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Tag_InSafeZone) == 0x000CE8, "Member 'UGA_HighTower_Grape_BrambleShield_C::Tag_InSafeZone' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GC_Heal) == 0x000CF0, "Member 'UGA_HighTower_Grape_BrambleShield_C::GC_Heal' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GC_FinalHeal) == 0x000CF8, "Member 'UGA_HighTower_Grape_BrambleShield_C::GC_FinalHeal' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GE_Heal) == 0x000D00, "Member 'UGA_HighTower_Grape_BrambleShield_C::GE_Heal' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GE_FinalHeal) == 0x000D08, "Member 'UGA_HighTower_Grape_BrambleShield_C::GE_FinalHeal' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GE_HealInStorm) == 0x000D10, "Member 'UGA_HighTower_Grape_BrambleShield_C::GE_HealInStorm' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GE_FinalHealInStorm) == 0x000D18, "Member 'UGA_HighTower_Grape_BrambleShield_C::GE_FinalHealInStorm' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Row_MaxHealCount) == 0x000D20, "Member 'UGA_HighTower_Grape_BrambleShield_C::Row_MaxHealCount' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, HealCount) == 0x000D40, "Member 'UGA_HighTower_Grape_BrambleShield_C::HealCount' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GC_Activate) == 0x000D44, "Member 'UGA_HighTower_Grape_BrambleShield_C::GC_Activate' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GE_KnockBack) == 0x000D50, "Member 'UGA_HighTower_Grape_BrambleShield_C::GE_KnockBack' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Tag_KnockbackTargeting) == 0x000D58, "Member 'UGA_HighTower_Grape_BrambleShield_C::Tag_KnockbackTargeting' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Delay_PostFinalHeal) == 0x000D60, "Member 'UGA_HighTower_Grape_BrambleShield_C::Delay_PostFinalHeal' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, DelayForWeaponHolster) == 0x000D64, "Member 'UGA_HighTower_Grape_BrambleShield_C::DelayForWeaponHolster' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, BrambleRadiusForPawnCapsule) == 0x000D68, "Member 'UGA_HighTower_Grape_BrambleShield_C::BrambleRadiusForPawnCapsule' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, CachedUnscaledPawnCapsuleRadius) == 0x000D6C, "Member 'UGA_HighTower_Grape_BrambleShield_C::CachedUnscaledPawnCapsuleRadius' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, CachedCapsuleHalfHeight) == 0x000D70, "Member 'UGA_HighTower_Grape_BrambleShield_C::CachedCapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, CanBeCancelled) == 0x000D74, "Member 'UGA_HighTower_Grape_BrambleShield_C::CanBeCancelled' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Cancelled) == 0x000D75, "Member 'UGA_HighTower_Grape_BrambleShield_C::Cancelled' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, DelayBeforeCanBeCancelled) == 0x000D78, "Member 'UGA_HighTower_Grape_BrambleShield_C::DelayBeforeCanBeCancelled' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, Destroyed) == 0x000D7C, "Member 'UGA_HighTower_Grape_BrambleShield_C::Destroyed' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, DebugLogBrambleShield) == 0x000D7D, "Member 'UGA_HighTower_Grape_BrambleShield_C::DebugLogBrambleShield' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, T_BrambleActive) == 0x000D80, "Member 'UGA_HighTower_Grape_BrambleShield_C::T_BrambleActive' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, PostEndCleanUpDelay) == 0x000DA0, "Member 'UGA_HighTower_Grape_BrambleShield_C::PostEndCleanUpDelay' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, LaunchHorizSpeedStart) == 0x000DA8, "Member 'UGA_HighTower_Grape_BrambleShield_C::LaunchHorizSpeedStart' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, LaunchVertSpeedStart) == 0x000DC8, "Member 'UGA_HighTower_Grape_BrambleShield_C::LaunchVertSpeedStart' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, LaunchHorizSpeedEnd) == 0x000DE8, "Member 'UGA_HighTower_Grape_BrambleShield_C::LaunchHorizSpeedEnd' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, LaunchVertSpeedEnd) == 0x000E08, "Member 'UGA_HighTower_Grape_BrambleShield_C::LaunchVertSpeedEnd' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, EndJumpVelMaintained) == 0x000E28, "Member 'UGA_HighTower_Grape_BrambleShield_C::EndJumpVelMaintained' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, PostRemovalLaunch) == 0x000E2C, "Member 'UGA_HighTower_Grape_BrambleShield_C::PostRemovalLaunch' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, BallEndAdditionVelInAir) == 0x000E30, "Member 'UGA_HighTower_Grape_BrambleShield_C::BallEndAdditionVelInAir' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, BallEndAdditionVelOnGround) == 0x000E3C, "Member 'UGA_HighTower_Grape_BrambleShield_C::BallEndAdditionVelOnGround' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, BallVelMult) == 0x000E48, "Member 'UGA_HighTower_Grape_BrambleShield_C::BallVelMult' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, TimeToReceedBeforeExit) == 0x000E4C, "Member 'UGA_HighTower_Grape_BrambleShield_C::TimeToReceedBeforeExit' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, EndAbilityHasBeenCalled) == 0x000E50, "Member 'UGA_HighTower_Grape_BrambleShield_C::EndAbilityHasBeenCalled' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GE_ImmunityToNextFallDamage) == 0x000E58, "Member 'UGA_HighTower_Grape_BrambleShield_C::GE_ImmunityToNextFallDamage' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, GEs_ToApplyToBrambleShield) == 0x000E60, "Member 'UGA_HighTower_Grape_BrambleShield_C::GEs_ToApplyToBrambleShield' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, CapsuleIsEnlarged) == 0x000E70, "Member 'UGA_HighTower_Grape_BrambleShield_C::CapsuleIsEnlarged' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, ActorsToIgnore) == 0x000E78, "Member 'UGA_HighTower_Grape_BrambleShield_C::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, HitAPawn) == 0x000E88, "Member 'UGA_HighTower_Grape_BrambleShield_C::HitAPawn' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_BrambleShield_C, ObjectTypes) == 0x000E90, "Member 'UGA_HighTower_Grape_BrambleShield_C::ObjectTypes' has a wrong offset!");

}

