#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Grape_Bramble_IcySurface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_HighTower_Grape_Bramble_IcySurface.GA_HighTower_Grape_Bramble_IcySurface_C.ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface
// 0x0098 (0x0098 - 0x0000)
struct GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetWalkableFloorAngle_ReturnValue;     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x0084(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_1; // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_2; // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface) == 0x000008, "Wrong alignment on GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface");
static_assert(sizeof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface) == 0x000098, "Wrong size on GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, EntryPoint) == 0x000000, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_BreakVector_X) == 0x000014, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_BreakVector_Y) == 0x000018, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_BreakVector_Z) == 0x00001C, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000040, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000048, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, K2Node_Event_bWasCancelled) == 0x000051, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000058, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000060, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000068, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000070, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_K2_GetWalkableFloorAngle_ReturnValue) == 0x000078, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_K2_GetWalkableFloorAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x00007C, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2) == 0x000084, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_RemoveActiveGameplayEffect_ReturnValue_1) == 0x00008C, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_RemoveActiveGameplayEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_RemoveActiveGameplayEffect_ReturnValue_2) == 0x00008D, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_RemoveActiveGameplayEffect_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000090, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000094, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000095, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_HighTower_Grape_Bramble_IcySurface.GA_HighTower_Grape_Bramble_IcySurface_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_HighTower_Grape_Bramble_IcySurface_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HighTower_Grape_Bramble_IcySurface_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_HighTower_Grape_Bramble_IcySurface_C_K2_OnEndAbility");
static_assert(sizeof(GA_HighTower_Grape_Bramble_IcySurface_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_HighTower_Grape_Bramble_IcySurface_C_K2_OnEndAbility");
static_assert(offsetof(GA_HighTower_Grape_Bramble_IcySurface_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_HighTower_Grape_Bramble_IcySurface_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

