#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hightower_Wasabi_Claws_Mantis

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Melee_Mantis_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Hightower_Wasabi_Claws_Mantis.GA_Hightower_Wasabi_Claws_Mantis_C
// 0x0040 (0x0B38 - 0x0AF8)
class UGA_Hightower_Wasabi_Claws_Mantis_C : public UGA_Melee_Mantis_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Hightower_Wasabi_Claws_Mantis_C; // 0x0AF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          SendSpinSlashEvent;                                // 0x0B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B01[0x7];                                      // 0x0B01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Tag_Ziplining;                                     // 0x0B08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_ZiplineExit;                                   // 0x0B28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_SpinSlash_PreActivate;                         // 0x0B30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Hightower_Wasabi_Claws_Mantis(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnGenericNotifyFromAnimation(const struct FGameplayTag& NotifyTag);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Hightower_Wasabi_Claws_Mantis_C">();
	}
	static class UGA_Hightower_Wasabi_Claws_Mantis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Hightower_Wasabi_Claws_Mantis_C>();
	}
};
static_assert(alignof(UGA_Hightower_Wasabi_Claws_Mantis_C) == 0x000008, "Wrong alignment on UGA_Hightower_Wasabi_Claws_Mantis_C");
static_assert(sizeof(UGA_Hightower_Wasabi_Claws_Mantis_C) == 0x000B38, "Wrong size on UGA_Hightower_Wasabi_Claws_Mantis_C");
static_assert(offsetof(UGA_Hightower_Wasabi_Claws_Mantis_C, UberGraphFrame_GA_Hightower_Wasabi_Claws_Mantis_C) == 0x000AF8, "Member 'UGA_Hightower_Wasabi_Claws_Mantis_C::UberGraphFrame_GA_Hightower_Wasabi_Claws_Mantis_C' has a wrong offset!");
static_assert(offsetof(UGA_Hightower_Wasabi_Claws_Mantis_C, SendSpinSlashEvent) == 0x000B00, "Member 'UGA_Hightower_Wasabi_Claws_Mantis_C::SendSpinSlashEvent' has a wrong offset!");
static_assert(offsetof(UGA_Hightower_Wasabi_Claws_Mantis_C, Tag_Ziplining) == 0x000B08, "Member 'UGA_Hightower_Wasabi_Claws_Mantis_C::Tag_Ziplining' has a wrong offset!");
static_assert(offsetof(UGA_Hightower_Wasabi_Claws_Mantis_C, Tag_ZiplineExit) == 0x000B28, "Member 'UGA_Hightower_Wasabi_Claws_Mantis_C::Tag_ZiplineExit' has a wrong offset!");
static_assert(offsetof(UGA_Hightower_Wasabi_Claws_Mantis_C, Tag_SpinSlash_PreActivate) == 0x000B30, "Member 'UGA_Hightower_Wasabi_Claws_Mantis_C::Tag_SpinSlash_PreActivate' has a wrong offset!");

}

