#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Squash_WhirlwindBlast

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GA_Athena_ActivePower_GenericTargetApply_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HighTower_Squash_WhirlwindBlast.GA_HighTower_Squash_WhirlwindBlast_C
// 0x00C0 (0x0D50 - 0x0C90)
class UGA_HighTower_Squash_WhirlwindBlast_C : public UGA_Athena_ActivePower_GenericTargetApply_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_HighTower_Squash_WhirlwindBlast_C; // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ProjectileCheckInterval;                           // 0x0C98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9C[0x4];                                      // 0x0C9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ProjectilesReflected;                              // 0x0CA0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_ProjectileCheck;                             // 0x0CB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   Tag_TargetingApplication_Blast;                    // 0x0CB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           KnockBackGC;                                       // 0x0CC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         GCIndex;                                           // 0x0CD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD4[0x4];                                      // 0x0CD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           EndAbilityTimer;                                   // 0x0CD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayDeflectGC;                                    // 0x0CE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GCDeflect;                                         // 0x0CE4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         PostKnockSeconds;                                  // 0x0CEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugAbility;                                      // 0x0CF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF1[0x3];                                      // 0x0CF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NotifyIndex;                                       // 0x0CF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndAbilityHasBeenCalled;                           // 0x0CF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF9[0x3];                                      // 0x0CF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PostEndCleanUpDelay;                               // 0x0CFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugLogShield;                                    // 0x0D00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D01[0x7];                                      // 0x0D01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_HighTower_Squash_Shield_C*         Shield;                                            // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Destroyed;                                         // 0x0D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D11[0x7];                                      // 0x0D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         TargetCache;                                       // 0x0D18(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         QuestProgressCount;                                // 0x0D28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2C[0x4];                                      // 0x0D2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         TargetsHit;                                        // 0x0D30(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEHandle_LowGrav;                                  // 0x0D40(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EFortCustomMovement                           MovementModeHover;                                 // 0x0D48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomMovement                           MovementModeFloating;                              // 0x0D49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4A[0x2];                                      // 0x0D4A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WhichMovementMode;                                 // 0x0D4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast(int32 EntryPoint);
	void SetUpBinds();
	void SpawnShield();
	void ShieldDeath(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void EndCalledCleanUp();
	void ShieldDestoyedClient();
	void ResetCanBeDestroyedTimedOutOrCancelled();
	void OnShieldDestroyedTimedOutOrCancelled();
	void ExecuteAndIncrementKnock(bool IsFirstKnock);
	void OnDeflection(const struct FVector& HitLoc);
	void CastMontageCancelledOrInterrupted();
	void CastMontageBlendOut();
	void ResetAbility();
	void Timeout();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void K2_OnEndAbility(bool bWasCancelled);
	void ReflectProjectile(const class AActor*& Projectile);
	void FindProjectiles();
	void OnAbilityActivated();
	void Added_BC4165B841D451F2474757993EE08A6C();
	void OnSync_0C450B1949B18B6252820A9EEDC5C78D();
	void Targeted_BA4B6EA44B73F8A3B6CF89AFB249C2B5(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_BA4B6EA44B73F8A3B6CF89AFB249C2B5(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void InitAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HighTower_Squash_WhirlwindBlast_C">();
	}
	static class UGA_HighTower_Squash_WhirlwindBlast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Squash_WhirlwindBlast_C>();
	}
};
static_assert(alignof(UGA_HighTower_Squash_WhirlwindBlast_C) == 0x000008, "Wrong alignment on UGA_HighTower_Squash_WhirlwindBlast_C");
static_assert(sizeof(UGA_HighTower_Squash_WhirlwindBlast_C) == 0x000D50, "Wrong size on UGA_HighTower_Squash_WhirlwindBlast_C");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, UberGraphFrame_GA_HighTower_Squash_WhirlwindBlast_C) == 0x000C90, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::UberGraphFrame_GA_HighTower_Squash_WhirlwindBlast_C' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, ProjectileCheckInterval) == 0x000C98, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::ProjectileCheckInterval' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, ProjectilesReflected) == 0x000CA0, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::ProjectilesReflected' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, Timer_ProjectileCheck) == 0x000CB0, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::Timer_ProjectileCheck' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, Tag_TargetingApplication_Blast) == 0x000CB8, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::Tag_TargetingApplication_Blast' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, KnockBackGC) == 0x000CC8, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::KnockBackGC' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, GCIndex) == 0x000CD0, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::GCIndex' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, EndAbilityTimer) == 0x000CD8, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::EndAbilityTimer' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, DelayDeflectGC) == 0x000CE0, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::DelayDeflectGC' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, GCDeflect) == 0x000CE4, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::GCDeflect' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, PostKnockSeconds) == 0x000CEC, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::PostKnockSeconds' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, DebugAbility) == 0x000CF0, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::DebugAbility' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, NotifyIndex) == 0x000CF4, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::NotifyIndex' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, EndAbilityHasBeenCalled) == 0x000CF8, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::EndAbilityHasBeenCalled' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, PostEndCleanUpDelay) == 0x000CFC, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::PostEndCleanUpDelay' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, DebugLogShield) == 0x000D00, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::DebugLogShield' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, Shield) == 0x000D08, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::Shield' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, Destroyed) == 0x000D10, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::Destroyed' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, TargetCache) == 0x000D18, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::TargetCache' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, QuestProgressCount) == 0x000D28, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::QuestProgressCount' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, TargetsHit) == 0x000D30, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::TargetsHit' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, GEHandle_LowGrav) == 0x000D40, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::GEHandle_LowGrav' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, MovementModeHover) == 0x000D48, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::MovementModeHover' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, MovementModeFloating) == 0x000D49, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::MovementModeFloating' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Squash_WhirlwindBlast_C, WhichMovementMode) == 0x000D4C, "Member 'UGA_HighTower_Squash_WhirlwindBlast_C::WhichMovementMode' has a wrong offset!");

}

