#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Squash_WhirlwindBlast

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_HighTower_Squash_WhirlwindBlast.GA_HighTower_Squash_WhirlwindBlast_C.ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast
// 0x05D0 (0x05D0 - 0x0000)
struct GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0020(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0078(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_CustomEvent_Projectile;                     // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectileMovementComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortProjectileMovementComponent*       CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NotifyTag;                            // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_ActivationGCParams_ReturnValue;           // 0x0168(0x00B8)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_ActivationGCParams_ReturnValue_1;         // 0x0228(0x00B8)(ContainsInstancedReference)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x02E8(0x0028)()
	TArray<class AActor*>                         CallFunc_GetAllActorsFromTargetData_ReturnValue;   // 0x0310(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLoc;                               // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0360(0x00B8)(ContainsInstancedReference)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0418(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFirstKnock;                   // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43A[0x2];                                      // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B[0x1];                                      // 0x044B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x044C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x046C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0480(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x04C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_5; // 0x04D8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0510(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_HighTower_Squash_Shield_C*         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_552[0x2];                                      // 0x0552(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_572[0x2];                                      // 0x0572(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A2[0x2];                                      // 0x05A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x05A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B2[0x2];                                      // 0x05B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x05B4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast) == 0x000010, "Wrong alignment on GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast");
static_assert(sizeof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast) == 0x0005D0, "Wrong size on GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, EntryPoint) == 0x000000, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_int_Array_Index_Variable) == 0x000014, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_TargetData) == 0x000020, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_ApplicationTag) == 0x000048, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsServer_ReturnValue) == 0x000068, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_int_Loop_Counter_Variable_1) == 0x00006C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_int_Array_Index_Variable_1) == 0x000074, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_TargetData_1) == 0x000078, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_ApplicationTag_1) == 0x0000A0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000A8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_bool_Has_Been_Initd_Variable) == 0x0000A9, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_MakeArray_Array) == 0x0000B0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_Projectile) == 0x0000D0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_Projectile' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_SphereOverlapActors_OutActors) == 0x0000D8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_SphereOverlapActors_ReturnValue) == 0x0000E8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_GetComponentByClass_ReturnValue) == 0x0000F0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000FC, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000110, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000118, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsValid_ReturnValue_1) == 0x000124, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_int_Variable) == 0x000128, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00012C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_Event_bWasCancelled) == 0x000138, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_int_Variable_1) == 0x00013C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_struct_Variable) == 0x000140, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_Event_NotifyTag) == 0x000148, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CreateDelegate_OutputDelegate_2) == 0x000150, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_bool_Has_Been_Initd_Variable_1) == 0x000160, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_ActivationGCParams_ReturnValue) == 0x000168, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_ActivationGCParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_Length_ReturnValue_1) == 0x000220, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_ActivationGCParams_ReturnValue_1) == 0x000228, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_ActivationGCParams_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_bool_IsClosed_Variable_1) == 0x0002E0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_struct_Variable_1) == 0x0002E8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_GetAllActorsFromTargetData_ReturnValue) == 0x000310, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_GetAllActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_Event_HitLoc) == 0x000320, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_Event_HitLoc' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00032C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_Get_Item) == 0x000338, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000340, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_Length_ReturnValue_2) == 0x00034C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Normal_ReturnValue) == 0x000350, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Less_IntInt_ReturnValue) == 0x00035C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000360, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000418, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_IsFirstKnock) == 0x000420, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_IsFirstKnock' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Add_IntInt_ReturnValue_2) == 0x000424, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_WaitTargetSelection_ReturnValue) == 0x000428, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000430, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsValid_ReturnValue_2) == 0x000438, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsValid_ReturnValue_3) == 0x000439, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Add_IntInt_ReturnValue_3) == 0x00043C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Less_IntInt_ReturnValue_1) == 0x000440, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_Length_ReturnValue_3) == 0x000444, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Less_IntInt_ReturnValue_2) == 0x000448, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Greater_IntInt_ReturnValue) == 0x000449, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00044A, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CreateDelegate_OutputDelegate_3) == 0x00044C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_int_Array_Index_Variable_2) == 0x00045C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_Get_Item_1) == 0x000460, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_AddUnique_ReturnValue) == 0x000468, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CreateDelegate_OutputDelegate_4) == 0x00046C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000480, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_DamagedActor) == 0x000488, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_Damage) == 0x000490, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_InstigatedBy) == 0x000498, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_DamageCauser) == 0x0004A0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_HitLocation) == 0x0004A8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_FHitComponent) == 0x0004B8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_BoneName) == 0x0004C0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CustomEvent_Momentum) == 0x0004C8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsServer_ReturnValue_1) == 0x0004D4, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_CreateDelegate_OutputDelegate_5) == 0x0004D8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_WaitNetSync_ReturnValue) == 0x0004E8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0004F0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0004FC, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsValid_ReturnValue_4) == 0x000508, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_MakeTransform_ReturnValue) == 0x000510, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000540, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_FinishSpawningActor_ReturnValue) == 0x000548, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsValid_ReturnValue_5) == 0x000550, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsValid_ReturnValue_6) == 0x000551, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_int_Variable_2) == 0x000554, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000558, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Add_IntInt_ReturnValue_4) == 0x000560, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_GetQuestManager_ReturnValue) == 0x000568, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x000570, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x000571, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000574, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_Get_Item_2) == 0x000578, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsValid_ReturnValue_7) == 0x000580, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000588, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, K2Node_DynamicCast_bSuccess) == 0x000590, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Array_Length_ReturnValue_4) == 0x000594, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Less_IntInt_ReturnValue_3) == 0x000598, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, Temp_int_Loop_Counter_Variable_2) == 0x00059C, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_IsServer_ReturnValue_2) == 0x0005A0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Less_IntInt_ReturnValue_4) == 0x0005A1, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_Add_IntInt_ReturnValue_5) == 0x0005A4, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0005A8, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0005B0, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0005B1, "Member 'GA_HighTower_Squash_WhirlwindBlast_C_ExecuteUbergraph_GA_HighTower_Squash_WhirlwindBlast::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
