#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Grape_Bramble_IcySurface

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HighTower_Grape_Bramble_IcySurface.GA_HighTower_Grape_Bramble_IcySurface_C
// 0x0050 (0x0AF8 - 0x0AA8)
class UGA_HighTower_Grape_Bramble_IcySurface_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SlopeTimer;                                        // 0x0AB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         OldZ;                                              // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewZ;                                              // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GELEvel;                                           // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartingVelocity;                                  // 0x0ACC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            IcyFeetSurfaceHandle;                              // 0x0AD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            AccelHandle;                                       // 0x0AE0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultWalkableAngle;                              // 0x0AE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ImmunityHandle;                                    // 0x0AEC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void CheckSlope();
	void SetSpeedVars();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HighTower_Grape_Bramble_IcySurface_C">();
	}
	static class UGA_HighTower_Grape_Bramble_IcySurface_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Grape_Bramble_IcySurface_C>();
	}
};
static_assert(alignof(UGA_HighTower_Grape_Bramble_IcySurface_C) == 0x000008, "Wrong alignment on UGA_HighTower_Grape_Bramble_IcySurface_C");
static_assert(sizeof(UGA_HighTower_Grape_Bramble_IcySurface_C) == 0x000AF8, "Wrong size on UGA_HighTower_Grape_Bramble_IcySurface_C");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, PlayerPawn) == 0x000AB0, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, SlopeTimer) == 0x000AB8, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::SlopeTimer' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, OldZ) == 0x000AC0, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::OldZ' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, NewZ) == 0x000AC4, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::NewZ' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, GELEvel) == 0x000AC8, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::GELEvel' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, StartingVelocity) == 0x000ACC, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::StartingVelocity' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, IcyFeetSurfaceHandle) == 0x000AD8, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::IcyFeetSurfaceHandle' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, AccelHandle) == 0x000AE0, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::AccelHandle' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, DefaultWalkableAngle) == 0x000AE8, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::DefaultWalkableAngle' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Grape_Bramble_IcySurface_C, ImmunityHandle) == 0x000AEC, "Member 'UGA_HighTower_Grape_Bramble_IcySurface_C::ImmunityHandle' has a wrong offset!");

}

