#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Wasabi_SpinSlash_Attack

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GA_Athena_ActivePower_GenericTargetApply_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HighTower_Wasabi_SpinSlash_Attack.GA_HighTower_Wasabi_SpinSlash_Attack_C
// 0x0150 (0x0DE0 - 0x0C90)
class UGA_HighTower_Wasabi_SpinSlash_Attack_C final : public UGA_Athena_ActivePower_GenericTargetApply_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_HighTower_Wasabi_SpinSlash_Attack_C; // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Tag_MajorHit;                                      // 0x0C98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         GCIndex;                                           // 0x0CA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA4[0x4];                                      // 0x0CA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   GC_Hits;                                           // 0x0CA8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         JumpDuration;                                      // 0x0CB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         JumpAddedDistance;                                 // 0x0CD8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         JumpAddedHeight;                                   // 0x0CF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         EndAddedSpeed;                                     // 0x0D18(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          FloorMaintainedZVelocityAtZero;                    // 0x0D38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D39[0x3];                                      // 0x0D39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialForwardVector;                              // 0x0D3C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitialVelocityClamped;                            // 0x0D48(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D54[0x4];                                      // 0x0D54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PercentForwardVelocityToMaintain;                  // 0x0D58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PercentVerticalVelocityToMaintain;                 // 0x0D78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxSpeedToMaintain;                                // 0x0D98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_MoveSpeedOnLanded;                              // 0x0DB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Handle_GE_MoveSpeedOnLanded;                       // 0x0DC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_KnockedBack;                                   // 0x0DC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionMoveToForce* Task_RootMotion;                                  // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      Task_OnKnockedBack;                                // 0x0DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack(int32 EntryPoint);
	void BindOnKnockedBack();
	void Landed(const struct FHitResult& Hit);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void Added_7A61119A4C9CD054FAEE2C99FA82B74E();
	void OnTimedOut_327E240B4BC99F957739F0BDD995EB10();
	void OnTimedOutAndDestinationReached_327E240B4BC99F957739F0BDD995EB10();
	void InitAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HighTower_Wasabi_SpinSlash_Attack_C">();
	}
	static class UGA_HighTower_Wasabi_SpinSlash_Attack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Wasabi_SpinSlash_Attack_C>();
	}
};
static_assert(alignof(UGA_HighTower_Wasabi_SpinSlash_Attack_C) == 0x000008, "Wrong alignment on UGA_HighTower_Wasabi_SpinSlash_Attack_C");
static_assert(sizeof(UGA_HighTower_Wasabi_SpinSlash_Attack_C) == 0x000DE0, "Wrong size on UGA_HighTower_Wasabi_SpinSlash_Attack_C");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, UberGraphFrame_GA_HighTower_Wasabi_SpinSlash_Attack_C) == 0x000C90, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::UberGraphFrame_GA_HighTower_Wasabi_SpinSlash_Attack_C' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, Tag_MajorHit) == 0x000C98, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::Tag_MajorHit' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, GCIndex) == 0x000CA0, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::GCIndex' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, GC_Hits) == 0x000CA8, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::GC_Hits' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, JumpDuration) == 0x000CB8, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::JumpDuration' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, JumpAddedDistance) == 0x000CD8, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::JumpAddedDistance' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, JumpAddedHeight) == 0x000CF8, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::JumpAddedHeight' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, EndAddedSpeed) == 0x000D18, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::EndAddedSpeed' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, FloorMaintainedZVelocityAtZero) == 0x000D38, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::FloorMaintainedZVelocityAtZero' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, InitialForwardVector) == 0x000D3C, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::InitialForwardVector' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, InitialVelocityClamped) == 0x000D48, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::InitialVelocityClamped' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, PercentForwardVelocityToMaintain) == 0x000D58, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::PercentForwardVelocityToMaintain' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, PercentVerticalVelocityToMaintain) == 0x000D78, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::PercentVerticalVelocityToMaintain' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, MaxSpeedToMaintain) == 0x000D98, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::MaxSpeedToMaintain' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, GE_MoveSpeedOnLanded) == 0x000DB8, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::GE_MoveSpeedOnLanded' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, Handle_GE_MoveSpeedOnLanded) == 0x000DC0, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::Handle_GE_MoveSpeedOnLanded' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, Tag_KnockedBack) == 0x000DC8, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::Tag_KnockedBack' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, Task_RootMotion) == 0x000DD0, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::Task_RootMotion' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Wasabi_SpinSlash_Attack_C, Task_OnKnockedBack) == 0x000DD8, "Member 'UGA_HighTower_Wasabi_SpinSlash_Attack_C::Task_OnKnockedBack' has a wrong offset!");

}

