#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_HoneyDew_JumpSmash_Smash

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_HighTower_HoneyDew_JumpSmash_Smash.GA_HighTower_HoneyDew_JumpSmash_Smash_C.ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash
// 0x0160 (0x0160 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0020(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_1;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue_2;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00D0(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash) == 0x000008, "Wrong alignment on GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash");
static_assert(sizeof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash) == 0x000160, "Wrong size on GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, EntryPoint) == 0x000000, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, CallFunc_GetActivatingPawn_ReturnValue) == 0x000018, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, CallFunc_MakeHitResult_ReturnValue) == 0x000020, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, CallFunc_IsFalling_ReturnValue) == 0x0000AC, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B0, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, CallFunc_IsServer_ReturnValue) == 0x0000B8, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, K2Node_Event_bWasCancelled) == 0x0000B9, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, CallFunc_IsServer_ReturnValue_1) == 0x0000BA, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, CallFunc_GetActivatingPawn_ReturnValue_1) == 0x0000C0, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::CallFunc_GetActivatingPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, CallFunc_GetActivatingPawn_ReturnValue_2) == 0x0000C8, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::CallFunc_GetActivatingPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash, K2Node_Event_Hit) == 0x0000D0, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash::K2Node_Event_Hit' has a wrong offset!");

// Function GA_HighTower_HoneyDew_JumpSmash_Smash.GA_HighTower_HoneyDew_JumpSmash_Smash_C.OnLand
// 0x008C (0x008C - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_Smash_C_OnLand final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_OnLand) == 0x000004, "Wrong alignment on GA_HighTower_HoneyDew_JumpSmash_Smash_C_OnLand");
static_assert(sizeof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_OnLand) == 0x00008C, "Wrong size on GA_HighTower_HoneyDew_JumpSmash_Smash_C_OnLand");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_OnLand, Hit) == 0x000000, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_OnLand::Hit' has a wrong offset!");

// Function GA_HighTower_HoneyDew_JumpSmash_Smash.GA_HighTower_HoneyDew_JumpSmash_Smash_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_Smash_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_HighTower_HoneyDew_JumpSmash_Smash_C_K2_OnEndAbility");
static_assert(sizeof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_HighTower_HoneyDew_JumpSmash_Smash_C_K2_OnEndAbility");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_HighTower_HoneyDew_JumpSmash_Smash.GA_HighTower_HoneyDew_JumpSmash_Smash_C.GetLaunchVelocity
// 0x0058 (0x0058 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetBaseAimRotation_ReturnValue;           // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAngle_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity) == 0x000004, "Wrong alignment on GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity");
static_assert(sizeof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity) == 0x000058, "Wrong size on GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, ReturnValue) == 0x000000, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_GetValueAtLevel_ReturnValue) == 0x00000C, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000010, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000014, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_GetBaseAimRotation_ReturnValue) == 0x000018, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_GetBaseAimRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_BreakRotator_Roll) == 0x000024, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_BreakRotator_Pitch) == 0x000028, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_BreakRotator_Yaw) == 0x00002C, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_ClampAngle_ReturnValue) == 0x000030, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_ClampAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_MakeRotator_ReturnValue) == 0x000034, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000040, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00004C, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_GetLaunchVelocity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function GA_HighTower_HoneyDew_JumpSmash_Smash.GA_HighTower_HoneyDew_JumpSmash_Smash_C.LandGCParams
// 0x02E8 (0x02E8 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams final
{
public:
	struct FGameplayCueParameters                 ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_LandGCParams_ReturnValue;                 // 0x00B8(0x00B8)(ContainsInstancedReference)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0180(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x01A8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01C8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0230(0x00B8)(ContainsInstancedReference)
};
static_assert(alignof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams) == 0x000008, "Wrong alignment on GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams");
static_assert(sizeof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams) == 0x0002E8, "Wrong size on GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, ReturnValue) == 0x000000, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_LandGCParams_ReturnValue) == 0x0000B8, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_LandGCParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000170, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000174, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000178, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000180, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000198, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0001A0, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0001A8, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001C8, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_Location) == 0x0001E8, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001F4, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000200, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000208, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000210, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000218, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000220, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000224, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000228, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000230, "Member 'GA_HighTower_HoneyDew_JumpSmash_Smash_C_LandGCParams::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

}

