#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Wasabi_Claws_AirHit_Move

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_HighTower_Wasabi_Claws_AirHit_Move.GA_HighTower_Wasabi_Claws_AirHit_Move_C.ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move
// 0x0630 (0x0630 - 0x0000)
struct GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0038(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0078(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x00C0(0x0028)()
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x00E8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_TargetDataHasActor_ReturnValue;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_5;                    // 0x00FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_4;    // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_4;                    // 0x0114(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_5;    // 0x011C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_3;                    // 0x012C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_6;    // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_2;                    // 0x0144(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_7;    // 0x014C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_1;                    // 0x015C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_8;    // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag;                      // 0x0174(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_9;    // 0x017C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x018C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_10; // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x01A8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x01D8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0200(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_11; // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_4;                            // 0x0220(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0248(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                Temp_struct_Variable_5;                            // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetClosestActorFromArray_ReturnValue;     // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DistanceBetweenTwoVectors_Distance;       // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue_1;     // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionMoveToActorForce* CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue; // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0338(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x03C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_7;            // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_8;            // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x03E0(0x00B0)(ConstParm)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0498(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x04A8(0x0010)()
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x04C8(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x04D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x04E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x04EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x04F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0504(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0510(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x051C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0534(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue;     // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0550(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0560(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue_1;        // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0582(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0583(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_DestinationReached;             // 0x0584(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_TimedOut;                       // 0x0585(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_586[0x2];                                      // 0x0586(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_FinalTargetLocation;            // 0x0588(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue_1; // 0x0598(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue_1; // 0x05A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_9;            // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation)> K2Node_CreateDelegate_OutputDelegate_14; // 0x05C0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x05D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionMoveToForce* CallFunc_ApplyRootMotionMoveToForce_ReturnValue;  // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue_2; // 0x05E8(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue_2; // 0x05F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue_3; // 0x0608(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue_3; // 0x0618(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move) == 0x000008, "Wrong alignment on GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move");
static_assert(sizeof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move) == 0x000630, "Wrong size on GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, EntryPoint) == 0x000000, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, Temp_bool_Variable) == 0x000004, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, Temp_bool_Variable_1) == 0x000005, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, Temp_object_Variable) == 0x000028, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_TargetData_3) == 0x000038, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_ApplicationTag_3) == 0x000060, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_TargetData_2) == 0x000078, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_ApplicationTag_2) == 0x0000A0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, Temp_struct_Variable) == 0x0000B8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, Temp_struct_Variable_1) == 0x0000C0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetActorsFromTargetData_ReturnValue) == 0x0000E8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_TargetDataHasActor_ReturnValue) == 0x0000F8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_TargetDataHasActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_NotifyTag_5) == 0x0000FC, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_NotifyTag_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_4) == 0x000104, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_NotifyTag_4) == 0x000114, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_NotifyTag_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_5) == 0x00011C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_NotifyTag_3) == 0x00012C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_NotifyTag_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_6) == 0x000134, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_NotifyTag_2) == 0x000144, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_NotifyTag_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_7) == 0x00014C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_NotifyTag_1) == 0x00015C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_NotifyTag_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_8) == 0x000164, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_NotifyTag) == 0x000174, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_9) == 0x00017C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, Temp_struct_Variable_2) == 0x00018C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_10) == 0x000194, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_TargetData_1) == 0x0001A8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_ApplicationTag_1) == 0x0001D0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_TargetData) == 0x0001D8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CustomEvent_ApplicationTag) == 0x000200, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_11) == 0x000208, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, Temp_struct_Variable_3) == 0x000218, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, Temp_struct_Variable_4) == 0x000220, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000248, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_12) == 0x000258, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, Temp_struct_Variable_5) == 0x000268, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetClosestActorFromArray_ReturnValue) == 0x000278, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetClosestActorFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_IsDead_ReturnValue) == 0x000280, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_IsValid_ReturnValue) == 0x000281, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_IsDBNO_ReturnValue) == 0x000282, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_BooleanAND_ReturnValue) == 0x000283, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_BooleanAND_ReturnValue_1) == 0x000284, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Not_PreBool_ReturnValue) == 0x000285, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000288, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetValueAtLevel_ReturnValue) == 0x000294, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_FMax_ReturnValue) == 0x000298, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00029C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_MakeVector_ReturnValue) == 0x0002A0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0002AC, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x0002B0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002B4, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_FClamp_ReturnValue) == 0x0002B8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x0002BC, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Lerp_ReturnValue) == 0x0002C0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_FMax_ReturnValue_1) == 0x0002C4, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002C8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_DynamicCast_AsFort_Pawn) == 0x0002D8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_DynamicCast_bSuccess) == 0x0002E0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_DistanceBetweenTwoVectors_Distance) == 0x0002E4, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_DistanceBetweenTwoVectors_Distance' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetScaledCapsuleRadius_ReturnValue_1) == 0x0002E8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetScaledCapsuleRadius_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002EC, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue) == 0x0002F0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_ApplyRootMotionMoveToActorForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_IsValid_ReturnValue_1) == 0x0002F8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x0002FC, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000300, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x00030C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetValueAtLevel_ReturnValue_6) == 0x000310, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetValueAtLevel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000314, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_MakeVector_ReturnValue_1) == 0x000320, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00032C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_LineTraceSingle_OutHit) == 0x000338, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_LineTraceSingle_ReturnValue) == 0x0003C4, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_IsFalling_ReturnValue) == 0x0003C5, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003C6, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_BooleanAND_ReturnValue_2) == 0x0003C7, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetValueAtLevel_ReturnValue_7) == 0x0003C8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetValueAtLevel_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetValueAtLevel_ReturnValue_8) == 0x0003CC, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetValueAtLevel_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0003D0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Not_PreBool_ReturnValue_2) == 0x0003D8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_Event_EventData) == 0x0003E0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_Event_bWasCancelled) == 0x000490, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000498, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0004A8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetActorForwardVector_ReturnValue) == 0x0004B8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x0004C8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x0004D8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x0004E0, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x0004EC, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_GetForwardVector_ReturnValue) == 0x0004F8, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_SelectVector_ReturnValue) == 0x000504, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000510, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00051C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_BreakVector_X) == 0x000528, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_BreakVector_Y) == 0x00052C, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_BreakVector_Z) == 0x000530, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_Add_VectorVector_ReturnValue) == 0x000534, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_K2_CommitAbility_ReturnValue) == 0x000540, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, CallFunc_PlayMontageAndWaitNotify_ReturnValue) == 0x000548, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::CallFunc_PlayMontageAndWaitNotify_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move, K2Node_CreateDelegate_OutputDelegate_13) == 0x000550, "Member 'GA_HighTower_Wasabi_Claws_AirHit_Move_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
