#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Wasabi_SpinSlash_Attack

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_HighTower_Wasabi_SpinSlash_Attack.GA_HighTower_Wasabi_SpinSlash_Attack_C.ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack
// 0x0278 (0x0278 - 0x0000)
struct GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_NotifyTag;                            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_7;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_8;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_9;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Select_Default_1;                           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_10;           // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyRootMotionMoveToForce* CallFunc_ApplyRootMotionMoveToForce_ReturnValue;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_ClampSizeMax_ReturnValue;          // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x01B4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(const struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack) == 0x000008, "Wrong alignment on GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack");
static_assert(sizeof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack) == 0x000278, "Wrong size on GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, EntryPoint) == 0x000000, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, Temp_bool_Variable) == 0x000004, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, Temp_bool_Variable_1) == 0x000018, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_Event_NotifyTag) == 0x00001C, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000024, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, Temp_bool_Variable_2) == 0x000038, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000048, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000054, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue) == 0x000060, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000064, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000068, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x00006C, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000070, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x000074, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000078, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetActorForwardVector_ReturnValue) == 0x000080, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BreakVector_X) == 0x00008C, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BreakVector_Y) == 0x000090, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BreakVector_Z) == 0x000094, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Normal_ReturnValue) == 0x0000A4, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BreakVector_X_1) == 0x0000B0, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BreakVector_Y_1) == 0x0000B4, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BreakVector_Z_1) == 0x0000B8, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000BC, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000C8, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BreakVector_X_2) == 0x0000D4, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BreakVector_Y_2) == 0x0000D8, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BreakVector_Z_2) == 0x0000DC, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_6) == 0x0000E0, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000E4, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_7) == 0x0000E8, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000EC, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000F0, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000F4, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_FMax_ReturnValue) == 0x0000F8, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_Select_Default) == 0x0000FC, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_8) == 0x000100, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000104, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000108, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Add_FloatFloat_ReturnValue) == 0x00010C, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000110, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_MakeVector_ReturnValue_1) == 0x000114, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Add_VectorVector_ReturnValue) == 0x000120, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_9) == 0x00012C, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000130, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x00013C, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_FMax_ReturnValue_1) == 0x000140, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_CreateDelegate_OutputDelegate_2) == 0x000144, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_Select_Default_1) == 0x000154, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_MakeVector_ReturnValue_2) == 0x000158, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetValueAtLevel_ReturnValue_10) == 0x000164, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetValueAtLevel_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000168, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000174, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_ApplyRootMotionMoveToForce_ReturnValue) == 0x000178, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_ApplyRootMotionMoveToForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x000188, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_GetVelocity_ReturnValue) == 0x000190, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_Event_bWasCancelled) == 0x00019C, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_VSize_ReturnValue) == 0x0001A0, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_Select_Default_2) == 0x0001A4, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_Vector_ClampSizeMax_ReturnValue) == 0x0001A8, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_Vector_ClampSizeMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_CustomEvent_Hit) == 0x0001B4, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_CreateDelegate_OutputDelegate_3) == 0x000240, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, K2Node_CreateDelegate_OutputDelegate_4) == 0x000250, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000260, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000268, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, CallFunc_IsValid_ReturnValue_1) == 0x000270, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack, Temp_int_Variable) == 0x000274, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_ExecuteUbergraph_GA_HighTower_Wasabi_SpinSlash_Attack::Temp_int_Variable' has a wrong offset!");

// Function GA_HighTower_Wasabi_SpinSlash_Attack.GA_HighTower_Wasabi_SpinSlash_Attack_C.Landed
// 0x008C (0x008C - 0x0000)
struct GA_HighTower_Wasabi_SpinSlash_Attack_C_Landed final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_HighTower_Wasabi_SpinSlash_Attack_C_Landed) == 0x000004, "Wrong alignment on GA_HighTower_Wasabi_SpinSlash_Attack_C_Landed");
static_assert(sizeof(GA_HighTower_Wasabi_SpinSlash_Attack_C_Landed) == 0x00008C, "Wrong size on GA_HighTower_Wasabi_SpinSlash_Attack_C_Landed");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_Landed, Hit) == 0x000000, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_Landed::Hit' has a wrong offset!");

// Function GA_HighTower_Wasabi_SpinSlash_Attack.GA_HighTower_Wasabi_SpinSlash_Attack_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_HighTower_Wasabi_SpinSlash_Attack_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HighTower_Wasabi_SpinSlash_Attack_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_HighTower_Wasabi_SpinSlash_Attack_C_K2_OnEndAbility");
static_assert(sizeof(GA_HighTower_Wasabi_SpinSlash_Attack_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_HighTower_Wasabi_SpinSlash_Attack_C_K2_OnEndAbility");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_HighTower_Wasabi_SpinSlash_Attack.GA_HighTower_Wasabi_SpinSlash_Attack_C.CastMontageNotifyStart
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_Wasabi_SpinSlash_Attack_C_CastMontageNotifyStart final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Wasabi_SpinSlash_Attack_C_CastMontageNotifyStart) == 0x000004, "Wrong alignment on GA_HighTower_Wasabi_SpinSlash_Attack_C_CastMontageNotifyStart");
static_assert(sizeof(GA_HighTower_Wasabi_SpinSlash_Attack_C_CastMontageNotifyStart) == 0x000008, "Wrong size on GA_HighTower_Wasabi_SpinSlash_Attack_C_CastMontageNotifyStart");
static_assert(offsetof(GA_HighTower_Wasabi_SpinSlash_Attack_C_CastMontageNotifyStart, NotifyTag) == 0x000000, "Member 'GA_HighTower_Wasabi_SpinSlash_Attack_C_CastMontageNotifyStart::NotifyTag' has a wrong offset!");

}

