#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Date_ChainLightning_Boost

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HighTower_Date_ChainLightning_Boost.GA_HighTower_Date_ChainLightning_Boost_C
// 0x0190 (0x0C38 - 0x0AA8)
class UGA_HighTower_Date_ChainLightning_Boost_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           BoostAnimMontage;                                  // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LowGravGE;                                         // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         VehicleVelocityInfluenceMultiple;                  // 0x0AC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VehicleZLaunchStrength;                            // 0x0AE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HighTowerBoostStrength;                            // 0x0B08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsJumpBoosted;                                     // 0x0B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B29[0x7];                                      // 0x0B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainer           ImpulseTargets;                                    // 0x0B30(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BoostStrength;                                     // 0x0BE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BEC[0x4];                                      // 0x0BEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         InAirBoostForceStrength;                           // 0x0BF0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BoostDuration;                                     // 0x0C10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NearGround;                                        // 0x0C14(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C15[0x3];                                      // 0x0C15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           BoostJumpCue;                                      // 0x0C18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0C20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoostMultiplier;                                   // 0x0C24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            FatigueHandle;                                     // 0x0C28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EquippedTag;                                       // 0x0C30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Date_ChainLightning_Boost(int32 EntryPoint);
	void K2_ActivateAbility();
	void ImpulseVehicle(class UObject* Insitgator, const struct FVector& Velocity);
	void OnFinish_840FC04849C1FA8B03BBBB9C8A017507();
	void OnFinish_E18506684ADF2B417114E6BAAEE00C19();
	void LaunchCharacter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HighTower_Date_ChainLightning_Boost_C">();
	}
	static class UGA_HighTower_Date_ChainLightning_Boost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Date_ChainLightning_Boost_C>();
	}
};
static_assert(alignof(UGA_HighTower_Date_ChainLightning_Boost_C) == 0x000008, "Wrong alignment on UGA_HighTower_Date_ChainLightning_Boost_C");
static_assert(sizeof(UGA_HighTower_Date_ChainLightning_Boost_C) == 0x000C38, "Wrong size on UGA_HighTower_Date_ChainLightning_Boost_C");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, PlayerPawn) == 0x000AB0, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, BoostAnimMontage) == 0x000AB8, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::BoostAnimMontage' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, LowGravGE) == 0x000AC0, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::LowGravGE' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, VehicleVelocityInfluenceMultiple) == 0x000AC8, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::VehicleVelocityInfluenceMultiple' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, VehicleZLaunchStrength) == 0x000AE8, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::VehicleZLaunchStrength' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, HighTowerBoostStrength) == 0x000B08, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::HighTowerBoostStrength' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, IsJumpBoosted) == 0x000B28, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::IsJumpBoosted' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, ImpulseTargets) == 0x000B30, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::ImpulseTargets' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, BoostStrength) == 0x000BE8, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::BoostStrength' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, InAirBoostForceStrength) == 0x000BF0, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::InAirBoostForceStrength' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, BoostDuration) == 0x000C10, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::BoostDuration' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, NearGround) == 0x000C14, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::NearGround' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, BoostJumpCue) == 0x000C18, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::BoostJumpCue' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, Time) == 0x000C20, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::Time' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, BoostMultiplier) == 0x000C24, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::BoostMultiplier' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, FatigueHandle) == 0x000C28, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::FatigueHandle' has a wrong offset!");
static_assert(offsetof(UGA_HighTower_Date_ChainLightning_Boost_C, EquippedTag) == 0x000C30, "Member 'UGA_HighTower_Date_ChainLightning_Boost_C::EquippedTag' has a wrong offset!");

}

