#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Tomato_RepulsorCannon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C.ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon
// 0x0578 (0x0578 - 0x0000)
struct GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_NotifyTag;                            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0080(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_On;                                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x00B8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0100(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayCueParameters                 CallFunc_TargetingGCParams_ReturnValue;            // 0x0150(0x00B8)(ContainsInstancedReference)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActorArray_ReturnValue; // 0x0220(0x0028)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0268(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue_1;        // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_2;                            // 0x0278(0x0028)()
	TArray<class AActor*>                         CallFunc_GetAllActorsFromTargetData_ReturnValue;   // 0x02A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x02B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x02C0(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x02E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_5; // 0x02F0(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0360(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x0388(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0398(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleByProfile_OutHit;          // 0x03A8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleByProfile_ReturnValue;     // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0436(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_437[0x1];                                      // 0x0437(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x044C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x04B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x04C0(0x00B8)(ContainsInstancedReference)
};
static_assert(alignof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon) == 0x000008, "Wrong alignment on GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon");
static_assert(sizeof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon) == 0x000578, "Wrong size on GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, EntryPoint) == 0x000000, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_IsServer_ReturnValue) == 0x000018, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_Event_NotifyTag) == 0x00001C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_Event_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000024, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_bool_IsClosed_Variable) == 0x000025, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000026, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000027, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_Event_bWasCancelled) == 0x000029, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00002C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_bool_Has_Been_Initd_Variable) == 0x000058, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_int_Variable) == 0x00005C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000068, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_bool_Has_Been_Initd_Variable_1) == 0x000070, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_WaitTargetSelection_ReturnValue) == 0x000078, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_struct_Variable) == 0x000080, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_Event_On) == 0x0000A9, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_Event_On' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_struct_Variable_1) == 0x0000AC, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CustomEvent_TargetData) == 0x0000B8, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CustomEvent_ApplicationTag) == 0x0000E0, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000F8, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CustomEvent_TargetData_1) == 0x000100, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CustomEvent_ApplicationTag_1) == 0x000128, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CreateDelegate_OutputDelegate_3) == 0x000130, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CreateDelegate_OutputDelegate_4) == 0x000140, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_TargetingGCParams_ReturnValue) == 0x000150, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_TargetingGCParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Array_Get_Item) == 0x000208, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Array_RemoveItem_ReturnValue) == 0x000210, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Array_Length_ReturnValue) == 0x000214, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Less_IntInt_ReturnValue) == 0x000218, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_AbilityTargetDataFromActorArray_ReturnValue) == 0x000220, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_AbilityTargetDataFromActorArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GetValueAtLevel_ReturnValue) == 0x000248, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00024C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_FTrunc_ReturnValue) == 0x000250, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_FTrunc_ReturnValue_1) == 0x000254, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Less_IntInt_ReturnValue_1) == 0x000258, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Subtract_IntInt_ReturnValue) == 0x00025C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000260, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000264, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000268, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_WaitTargetSelection_ReturnValue_1) == 0x000270, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_WaitTargetSelection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_struct_Variable_2) == 0x000278, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GetAllActorsFromTargetData_ReturnValue) == 0x0002A0, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GetAllActorsFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_IsValid_ReturnValue_1) == 0x0002B0, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_struct_Variable_3) == 0x0002B4, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, Temp_bool_IsClosed_Variable_1) == 0x0002BC, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CustomEvent_TargetData_2) == 0x0002C0, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CustomEvent_ApplicationTag_2) == 0x0002E8, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002F0, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000300, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x000310, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_DynamicCast_bSuccess_1) == 0x000318, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00031C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000328, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GetControlRotation_ReturnValue) == 0x00032C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_IsServer_ReturnValue_1) == 0x000338, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GetForwardVector_ReturnValue) == 0x00033C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000348, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_Add_VectorVector_ReturnValue) == 0x000354, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CustomEvent_TargetData_3) == 0x000360, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CustomEvent_TargetData_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_CustomEvent_ApplicationTag_3) == 0x000388, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_CustomEvent_ApplicationTag_3' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000390, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, K2Node_MakeArray_Array) == 0x000398, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_LineTraceSingleByProfile_OutHit) == 0x0003A8, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_LineTraceSingleByProfile_OutHit' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_LineTraceSingleByProfile_ReturnValue) == 0x000434, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_LineTraceSingleByProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_bBlockingHit) == 0x000435, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_bInitialOverlap) == 0x000436, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_Time) == 0x000438, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_Distance) == 0x00043C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_Location) == 0x000440, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_ImpactPoint) == 0x00044C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_Normal) == 0x000458, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_ImpactNormal) == 0x000464, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_PhysMat) == 0x000470, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_HitActor) == 0x000478, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_HitComponent) == 0x000480, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_HitBoneName) == 0x000488, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_HitItem) == 0x000490, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_ElementIndex) == 0x000494, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_FaceIndex) == 0x000498, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_TraceStart) == 0x00049C, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_BreakHitResult_TraceEnd) == 0x0004A8, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_SelectVector_ReturnValue) == 0x0004B4, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0004C0, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C.SetHover
// 0x0001 (0x0001 - 0x0000)
struct GA_HighTower_Tomato_RepulsorCannon_C_SetHover final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HighTower_Tomato_RepulsorCannon_C_SetHover) == 0x000001, "Wrong alignment on GA_HighTower_Tomato_RepulsorCannon_C_SetHover");
static_assert(sizeof(GA_HighTower_Tomato_RepulsorCannon_C_SetHover) == 0x000001, "Wrong size on GA_HighTower_Tomato_RepulsorCannon_C_SetHover");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_SetHover, On) == 0x000000, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_SetHover::On' has a wrong offset!");

// Function GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_HighTower_Tomato_RepulsorCannon_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_HighTower_Tomato_RepulsorCannon_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_HighTower_Tomato_RepulsorCannon_C_K2_OnEndAbility");
static_assert(sizeof(GA_HighTower_Tomato_RepulsorCannon_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_HighTower_Tomato_RepulsorCannon_C_K2_OnEndAbility");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C.CastMontageNotifyStart
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_Tomato_RepulsorCannon_C_CastMontageNotifyStart final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Tomato_RepulsorCannon_C_CastMontageNotifyStart) == 0x000004, "Wrong alignment on GA_HighTower_Tomato_RepulsorCannon_C_CastMontageNotifyStart");
static_assert(sizeof(GA_HighTower_Tomato_RepulsorCannon_C_CastMontageNotifyStart) == 0x000008, "Wrong size on GA_HighTower_Tomato_RepulsorCannon_C_CastMontageNotifyStart");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_CastMontageNotifyStart, NotifyTag) == 0x000000, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_CastMontageNotifyStart::NotifyTag' has a wrong offset!");

// Function GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C.Targeted_BC710BC0457E9C272340D29C282F4A22
// 0x0030 (0x0030 - 0x0000)
struct GA_HighTower_Tomato_RepulsorCannon_C_Targeted_BC710BC0457E9C272340D29C282F4A22 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Tomato_RepulsorCannon_C_Targeted_BC710BC0457E9C272340D29C282F4A22) == 0x000008, "Wrong alignment on GA_HighTower_Tomato_RepulsorCannon_C_Targeted_BC710BC0457E9C272340D29C282F4A22");
static_assert(sizeof(GA_HighTower_Tomato_RepulsorCannon_C_Targeted_BC710BC0457E9C272340D29C282F4A22) == 0x000030, "Wrong size on GA_HighTower_Tomato_RepulsorCannon_C_Targeted_BC710BC0457E9C272340D29C282F4A22");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_Targeted_BC710BC0457E9C272340D29C282F4A22, TargetData) == 0x000000, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_Targeted_BC710BC0457E9C272340D29C282F4A22::TargetData' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_Targeted_BC710BC0457E9C272340D29C282F4A22, ApplicationTag) == 0x000028, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_Targeted_BC710BC0457E9C272340D29C282F4A22::ApplicationTag' has a wrong offset!");

// Function GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C.Cancelled_BC710BC0457E9C272340D29C282F4A22
// 0x0030 (0x0030 - 0x0000)
struct GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_BC710BC0457E9C272340D29C282F4A22 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_BC710BC0457E9C272340D29C282F4A22) == 0x000008, "Wrong alignment on GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_BC710BC0457E9C272340D29C282F4A22");
static_assert(sizeof(GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_BC710BC0457E9C272340D29C282F4A22) == 0x000030, "Wrong size on GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_BC710BC0457E9C272340D29C282F4A22");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_BC710BC0457E9C272340D29C282F4A22, TargetData) == 0x000000, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_BC710BC0457E9C272340D29C282F4A22::TargetData' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_BC710BC0457E9C272340D29C282F4A22, ApplicationTag) == 0x000028, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_BC710BC0457E9C272340D29C282F4A22::ApplicationTag' has a wrong offset!");

// Function GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C.Targeted_6CCC317040D245E97B19C2AD0E09D396
// 0x0030 (0x0030 - 0x0000)
struct GA_HighTower_Tomato_RepulsorCannon_C_Targeted_6CCC317040D245E97B19C2AD0E09D396 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Tomato_RepulsorCannon_C_Targeted_6CCC317040D245E97B19C2AD0E09D396) == 0x000008, "Wrong alignment on GA_HighTower_Tomato_RepulsorCannon_C_Targeted_6CCC317040D245E97B19C2AD0E09D396");
static_assert(sizeof(GA_HighTower_Tomato_RepulsorCannon_C_Targeted_6CCC317040D245E97B19C2AD0E09D396) == 0x000030, "Wrong size on GA_HighTower_Tomato_RepulsorCannon_C_Targeted_6CCC317040D245E97B19C2AD0E09D396");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_Targeted_6CCC317040D245E97B19C2AD0E09D396, TargetData) == 0x000000, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_Targeted_6CCC317040D245E97B19C2AD0E09D396::TargetData' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_Targeted_6CCC317040D245E97B19C2AD0E09D396, ApplicationTag) == 0x000028, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_Targeted_6CCC317040D245E97B19C2AD0E09D396::ApplicationTag' has a wrong offset!");

// Function GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C.Cancelled_6CCC317040D245E97B19C2AD0E09D396
// 0x0030 (0x0030 - 0x0000)
struct GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_6CCC317040D245E97B19C2AD0E09D396 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_6CCC317040D245E97B19C2AD0E09D396) == 0x000008, "Wrong alignment on GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_6CCC317040D245E97B19C2AD0E09D396");
static_assert(sizeof(GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_6CCC317040D245E97B19C2AD0E09D396) == 0x000030, "Wrong size on GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_6CCC317040D245E97B19C2AD0E09D396");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_6CCC317040D245E97B19C2AD0E09D396, TargetData) == 0x000000, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_6CCC317040D245E97B19C2AD0E09D396::TargetData' has a wrong offset!");
static_assert(offsetof(GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_6CCC317040D245E97B19C2AD0E09D396, ApplicationTag) == 0x000028, "Member 'GA_HighTower_Tomato_RepulsorCannon_C_Cancelled_6CCC317040D245E97B19C2AD0E09D396::ApplicationTag' has a wrong offset!");

// Function GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C.TargetingGCParams
// 0x0170 (0x0170 - 0x0000)
struct GA_HighTower_Tomato_RepulsorCannon_C_TargetingGCParams final
{
public:
	struct FGameplayCueParameters                 ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x00B8(0x00B8)(ContainsInstancedReference)
};
