#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LowTower_HeldObject_Chaplin_Primary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_LowTower_HeldObject_Chaplin_Primary.GA_LowTower_HeldObject_Chaplin_Primary_C
// 0x01D8 (0x0C80 - 0x0AA8)
class UGA_LowTower_HeldObject_Chaplin_Primary_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ActivationTime;                                    // 0x0AB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargingTime;                                      // 0x0AB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileForwardOffset;                           // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ABC[0x4];                                      // 0x0ABC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxChargeTime;                                     // 0x0AC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 ProjectileTemplate;                                // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxChargeInitialSpeed;                             // 0x0AE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ProjectileUpOffset;                                // 0x0B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B0C[0x4];                                      // 0x0B0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinChargeInitialSpeed;                             // 0x0B10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 ActiveHeldObject;                                  // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ProjectileGravityScale;                            // 0x0B38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           ExplosionEffectApplicationTag;                     // 0x0B58(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AutoShootOnMaxChargeTimerHandle;                   // 0x0B60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GCNL_PrimaryChargeFX;                              // 0x0B68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MinimumChargeTime;                                 // 0x0B70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           GCN_PrimaryShoot;                                  // 0x0B90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GCN_SmallProjectile;                               // 0x0B98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           BeginChargeTimerHandle;                            // 0x0BA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         SmallProjectileInitialSpeed;                       // 0x0BA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SmallProjectileCount;                              // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         SmallProjectileMaxCount;                           // 0x0BD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         DamageDataTableLevelCount;                         // 0x0BF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF4[0x4];                                      // 0x0BF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   ForceFeedbackSmallProjectile;                      // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ForceFeedbackChargeProjectile;                     // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C08[0x8];                                      // 0x0C08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OverrideTransform;                                 // 0x0C10(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           GameplayTagCueExplosion;                           // 0x0C40(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ThrowAnimationMontage;                             // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPendingEnd;                                       // 0x0C50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C51[0x7];                                      // 0x0C51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WaitForTossAnimationTimerHandle;                   // 0x0C58(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WaitForTimerAnimationTimerHandle;                  // 0x0C60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         WaitForFireAnimationTime;                          // 0x0C68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ServerWaitForThrowAnimationTimerModifier;          // 0x0C6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GCN_PrimaryChargedShoot;                           // 0x0C70(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_LowTower_HeldObject_Chaplin_Primary(int32 EntryPoint);
	void SetChargingTimerValues(float ChargingTime_0, float ActivationTime_0);
	void SetChargeTime();
	void ClientPlayLargeProjectileMontage();
	void WaitForAnimationTimer();
	void InvalidateTimers();
	void ServerWaitTossAnimation();
	void PreAbilityEnd();
	void AbilityCleanup();
	void BeginCharge();
	void BindBeginCharge();
	void ClientPlaySmallProjectileMontage();
	void ClientFX_EndCharge();
	void ClientFX_BeginCharge();
	void ForceShoot();
	void AutoShootOnMaxCharge();
	void BindAutoShootOnMaxCharge();
	void OnAbilityInputReleased();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCompleted_2B932747410EE89AB1DCE1915BC44EDB(const struct FGameplayTag& NotifyTag);
	void OnBlendOut_2B932747410EE89AB1DCE1915BC44EDB(const struct FGameplayTag& NotifyTag);
	void OnInterrupted_2B932747410EE89AB1DCE1915BC44EDB(const struct FGameplayTag& NotifyTag);
	void OnCancelled_2B932747410EE89AB1DCE1915BC44EDB(const struct FGameplayTag& NotifyTag);
	void OnNotifyBegin_2B932747410EE89AB1DCE1915BC44EDB(const struct FGameplayTag& NotifyTag);
	void OnNotifyEnd_2B932747410EE89AB1DCE1915BC44EDB(const struct FGameplayTag& NotifyTag);
	void SpawnSmallProjectile();
	void ConvertToScalingLevel(int32 Scale, int32* Out);
	void ConvertChargeTimeIntoLevel(int32* Out);
	void PlayForcedFeedBack(bool bSmallProjectile);

	void GetProjectileSpawnLocationAndDirection(struct FVector* Location, struct FRotator* Direction) const;
	void GetFortAvatarPawn(class AFortPlayerPawn** AsFort_Player_Pawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_LowTower_HeldObject_Chaplin_Primary_C">();
	}
	static class UGA_LowTower_HeldObject_Chaplin_Primary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_LowTower_HeldObject_Chaplin_Primary_C>();
	}
};
static_assert(alignof(UGA_LowTower_HeldObject_Chaplin_Primary_C) == 0x000010, "Wrong alignment on UGA_LowTower_HeldObject_Chaplin_Primary_C");
static_assert(sizeof(UGA_LowTower_HeldObject_Chaplin_Primary_C) == 0x000C80, "Wrong size on UGA_LowTower_HeldObject_Chaplin_Primary_C");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ActivationTime) == 0x000AB0, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ActivationTime' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ChargingTime) == 0x000AB4, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ChargingTime' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ProjectileForwardOffset) == 0x000AB8, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ProjectileForwardOffset' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, MaxChargeTime) == 0x000AC0, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::MaxChargeTime' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ProjectileTemplate) == 0x000AE0, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ProjectileTemplate' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, MaxChargeInitialSpeed) == 0x000AE8, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::MaxChargeInitialSpeed' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ProjectileUpOffset) == 0x000B08, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ProjectileUpOffset' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, MinChargeInitialSpeed) == 0x000B10, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::MinChargeInitialSpeed' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ActiveHeldObject) == 0x000B30, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ActiveHeldObject' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ProjectileGravityScale) == 0x000B38, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ProjectileGravityScale' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ExplosionEffectApplicationTag) == 0x000B58, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ExplosionEffectApplicationTag' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, AutoShootOnMaxChargeTimerHandle) == 0x000B60, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::AutoShootOnMaxChargeTimerHandle' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, GCNL_PrimaryChargeFX) == 0x000B68, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::GCNL_PrimaryChargeFX' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, MinimumChargeTime) == 0x000B70, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::MinimumChargeTime' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, GCN_PrimaryShoot) == 0x000B90, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::GCN_PrimaryShoot' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, GCN_SmallProjectile) == 0x000B98, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::GCN_SmallProjectile' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, BeginChargeTimerHandle) == 0x000BA0, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::BeginChargeTimerHandle' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, SmallProjectileInitialSpeed) == 0x000BA8, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::SmallProjectileInitialSpeed' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, SmallProjectileCount) == 0x000BC8, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::SmallProjectileCount' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, SmallProjectileMaxCount) == 0x000BD0, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::SmallProjectileMaxCount' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, DamageDataTableLevelCount) == 0x000BF0, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::DamageDataTableLevelCount' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ForceFeedbackSmallProjectile) == 0x000BF8, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ForceFeedbackSmallProjectile' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ForceFeedbackChargeProjectile) == 0x000C00, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ForceFeedbackChargeProjectile' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, OverrideTransform) == 0x000C10, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::OverrideTransform' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, GameplayTagCueExplosion) == 0x000C40, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::GameplayTagCueExplosion' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ThrowAnimationMontage) == 0x000C48, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ThrowAnimationMontage' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, bPendingEnd) == 0x000C50, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::bPendingEnd' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, WaitForTossAnimationTimerHandle) == 0x000C58, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::WaitForTossAnimationTimerHandle' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, WaitForTimerAnimationTimerHandle) == 0x000C60, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::WaitForTimerAnimationTimerHandle' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, WaitForFireAnimationTime) == 0x000C68, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::WaitForFireAnimationTime' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, ServerWaitForThrowAnimationTimerModifier) == 0x000C6C, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::ServerWaitForThrowAnimationTimerModifier' has a wrong offset!");
static_assert(offsetof(UGA_LowTower_HeldObject_Chaplin_Primary_C, GCN_PrimaryChargedShoot) == 0x000C70, "Member 'UGA_LowTower_HeldObject_Chaplin_Primary_C::GCN_PrimaryChargedShoot' has a wrong offset!");

}

