#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Melee_Dodge_Parent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Melee_Dodge_Parent.GA_Melee_Dodge_Parent_C
// 0x00C8 (0x0B70 - 0x0AA8)
class UGA_Melee_Dodge_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACharacter*                             PlayerCharacter;                                   // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            MovementStrengthCurve;                             // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            DodgeEffectHandle;                                 // 0x0AC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DodgeStrength;                                     // 0x0AC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DodgeDuration;                                     // 0x0AE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DodgeVelocityClamp;                                // 0x0B08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_DodgeNorth;                                     // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_DodgeSouth;                                     // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_DodgeEast;                                      // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_DodgeWest;                                      // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           M_DodgeNorth;                                      // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           M_DodgeSouth;                                      // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           M_DodgeEast;                                       // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           M_DodgeWest;                                       // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionConstantForce* RootMotionTask;                                 // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Melee_Dodge_Parent(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void EventReceived_0DCC408C4366EB38C244068D9E3611F2(const struct FGameplayEventData& Payload);
	void Added_970D853F45BA8BCC2D3927BB7DAD89D9();
	void OnCompleted_D8F7345E4DDCA4727E37CCBF0AEBF823();
	void OnBlendOut_D8F7345E4DDCA4727E37CCBF0AEBF823();
	void OnInterrupted_D8F7345E4DDCA4727E37CCBF0AEBF823();
	void OnCancelled_D8F7345E4DDCA4727E37CCBF0AEBF823();
	void OnFinish_91FD4F814D0D0B4FA70A4AA7AB146B6A();
	void SelectDodgeMontage(struct FVector* Direction, class UAnimMontage** DodgeMontage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Melee_Dodge_Parent_C">();
	}
	static class UGA_Melee_Dodge_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Melee_Dodge_Parent_C>();
	}
};
static_assert(alignof(UGA_Melee_Dodge_Parent_C) == 0x000008, "Wrong alignment on UGA_Melee_Dodge_Parent_C");
static_assert(sizeof(UGA_Melee_Dodge_Parent_C) == 0x000B70, "Wrong size on UGA_Melee_Dodge_Parent_C");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_Melee_Dodge_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, PlayerCharacter) == 0x000AB0, "Member 'UGA_Melee_Dodge_Parent_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, MovementStrengthCurve) == 0x000AB8, "Member 'UGA_Melee_Dodge_Parent_C::MovementStrengthCurve' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, DodgeEffectHandle) == 0x000AC0, "Member 'UGA_Melee_Dodge_Parent_C::DodgeEffectHandle' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, DodgeStrength) == 0x000AC8, "Member 'UGA_Melee_Dodge_Parent_C::DodgeStrength' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, DodgeDuration) == 0x000AE8, "Member 'UGA_Melee_Dodge_Parent_C::DodgeDuration' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, DodgeVelocityClamp) == 0x000B08, "Member 'UGA_Melee_Dodge_Parent_C::DodgeVelocityClamp' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, GE_DodgeNorth) == 0x000B28, "Member 'UGA_Melee_Dodge_Parent_C::GE_DodgeNorth' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, GE_DodgeSouth) == 0x000B30, "Member 'UGA_Melee_Dodge_Parent_C::GE_DodgeSouth' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, GE_DodgeEast) == 0x000B38, "Member 'UGA_Melee_Dodge_Parent_C::GE_DodgeEast' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, GE_DodgeWest) == 0x000B40, "Member 'UGA_Melee_Dodge_Parent_C::GE_DodgeWest' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, M_DodgeNorth) == 0x000B48, "Member 'UGA_Melee_Dodge_Parent_C::M_DodgeNorth' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, M_DodgeSouth) == 0x000B50, "Member 'UGA_Melee_Dodge_Parent_C::M_DodgeSouth' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, M_DodgeEast) == 0x000B58, "Member 'UGA_Melee_Dodge_Parent_C::M_DodgeEast' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, M_DodgeWest) == 0x000B60, "Member 'UGA_Melee_Dodge_Parent_C::M_DodgeWest' has a wrong offset!");
static_assert(offsetof(UGA_Melee_Dodge_Parent_C, RootMotionTask) == 0x000B68, "Member 'UGA_Melee_Dodge_Parent_C::RootMotionTask' has a wrong offset!");

}

