#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Melee_Dodge_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Melee_Dodge_Parent.GA_Melee_Dodge_Parent_C.ExecuteUbergraph_GA_Melee_Dodge_Parent
// 0x0270 (0x0270 - 0x0000)
struct GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0078(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0128(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_SelectDodgeMontage_Direction;             // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_SelectDodgeMontage_DodgeMontage;          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyRootMotionConstantForce* CallFunc_ApplyRootMotionConstantForce_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent) == 0x000008, "Wrong alignment on GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent");
static_assert(sizeof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent) == 0x000270, "Wrong size on GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, EntryPoint) == 0x000000, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000058, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000060, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_CustomEvent_Payload) == 0x000078, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, Temp_struct_Variable) == 0x000128, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0001D8, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_IsValid_ReturnValue_1) == 0x0001E0, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001E8, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_DynamicCast_AsCharacter) == 0x0001F0, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_Event_bWasCancelled) == 0x0001F9, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_GetController_ReturnValue) == 0x000200, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000208, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00020C, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000210, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, K2Node_CreateDelegate_OutputDelegate_6) == 0x000214, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_SelectDodgeMontage_Direction) == 0x000224, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_SelectDodgeMontage_Direction' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_SelectDodgeMontage_DodgeMontage) == 0x000230, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_SelectDodgeMontage_DodgeMontage' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_K2_CommitAbility_ReturnValue) == 0x000238, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000240, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_IsValid_ReturnValue_2) == 0x000248, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_ApplyRootMotionConstantForce_ReturnValue) == 0x000250, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_ApplyRootMotionConstantForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000258, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_GetController_ReturnValue_1) == 0x000260, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent, CallFunc_GetController_ReturnValue_2) == 0x000268, "Member 'GA_Melee_Dodge_Parent_C_ExecuteUbergraph_GA_Melee_Dodge_Parent::CallFunc_GetController_ReturnValue_2' has a wrong offset!");

// Function GA_Melee_Dodge_Parent.GA_Melee_Dodge_Parent_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Melee_Dodge_Parent_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Melee_Dodge_Parent_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Melee_Dodge_Parent_C_K2_OnEndAbility");
static_assert(sizeof(GA_Melee_Dodge_Parent_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Melee_Dodge_Parent_C_K2_OnEndAbility");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Melee_Dodge_Parent_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Melee_Dodge_Parent.GA_Melee_Dodge_Parent_C.EventReceived_0DCC408C4366EB38C244068D9E3611F2
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Melee_Dodge_Parent_C_EventReceived_0DCC408C4366EB38C244068D9E3611F2 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Melee_Dodge_Parent_C_EventReceived_0DCC408C4366EB38C244068D9E3611F2) == 0x000008, "Wrong alignment on GA_Melee_Dodge_Parent_C_EventReceived_0DCC408C4366EB38C244068D9E3611F2");
static_assert(sizeof(GA_Melee_Dodge_Parent_C_EventReceived_0DCC408C4366EB38C244068D9E3611F2) == 0x0000B0, "Wrong size on GA_Melee_Dodge_Parent_C_EventReceived_0DCC408C4366EB38C244068D9E3611F2");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_EventReceived_0DCC408C4366EB38C244068D9E3611F2, Payload) == 0x000000, "Member 'GA_Melee_Dodge_Parent_C_EventReceived_0DCC408C4366EB38C244068D9E3611F2::Payload' has a wrong offset!");

// Function GA_Melee_Dodge_Parent.GA_Melee_Dodge_Parent_C.SelectDodgeMontage
// 0x0108 (0x0108 - 0x0000)
struct GA_Melee_Dodge_Parent_C_SelectDodgeMontage final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           DodgeMontage;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LOCAL_Direction;                                   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default_1;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default_2;                           // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_2;     // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_3;     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Melee_Dodge_Parent_C_SelectDodgeMontage) == 0x000008, "Wrong alignment on GA_Melee_Dodge_Parent_C_SelectDodgeMontage");
static_assert(sizeof(GA_Melee_Dodge_Parent_C_SelectDodgeMontage) == 0x000108, "Wrong size on GA_Melee_Dodge_Parent_C_SelectDodgeMontage");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_SelectDodgeMontage, Direction) == 0x000000, "Member 'GA_Melee_Dodge_Parent_C_SelectDodgeMontage::Direction' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_SelectDodgeMontage, DodgeMontage) == 0x000010, "Member 'GA_Melee_Dodge_Parent_C_SelectDodgeMontage::DodgeMontage' has a wrong offset!");
static_assert(offsetof(GA_Melee_Dodge_Parent_C_SelectDodgeMontage, LOCAL_Direction) == 0x000018, "Member 'GA_Melee_Dodge_Parent_C_SelectDodgeMontage::LOCAL_Direction' has a wrong offset!");
