#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Melee_Mantis_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.ExecuteUbergraph_GA_Melee_Mantis_Parent
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_TargetDataHandle;                     // 0x0038(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_Event_ApplicationTag;                       // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentAbilitySourceLevel_OutSourceLevel; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0070(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Mantis_Weapon_Parent_C*              K2Node_DynamicCast_AsB_Mantis_Weapon_Parent;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue_1;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Mantis_Weapon_Parent_C*              K2Node_DynamicCast_AsB_Mantis_Weapon_Parent_1;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent) == 0x0000B8, "Wrong size on GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, EntryPoint) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000018, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_GetActivatingPawn_ReturnValue) == 0x000020, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000028, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_Event_TargetDataHandle) == 0x000038, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_Event_TargetDataHandle' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_Event_ApplicationTag) == 0x000060, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_Event_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_GetCurrentAbilitySourceLevel_OutSourceLevel) == 0x000068, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_GetCurrentAbilitySourceLevel_OutSourceLevel' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_FTrunc_ReturnValue) == 0x00006C, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000070, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_GetCurrentSourceWeapon_ReturnValue) == 0x000080, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_GetCurrentSourceWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_Event_bWasCancelled) == 0x000088, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_AsB_Mantis_Weapon_Parent) == 0x000090, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_AsB_Mantis_Weapon_Parent' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, CallFunc_GetCurrentSourceWeapon_ReturnValue_1) == 0x0000A0, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::CallFunc_GetCurrentSourceWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_AsB_Mantis_Weapon_Parent_1) == 0x0000A8, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_AsB_Mantis_Weapon_Parent_1' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'GA_Melee_Mantis_Parent_C_ExecuteUbergraph_GA_Melee_Mantis_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Melee_Mantis_Parent_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Melee_Mantis_Parent_C_K2_OnEndAbility");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Melee_Mantis_Parent_C_K2_OnEndAbility");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.BP_OnMantisTechniqueHit
// 0x0030 (0x0030 - 0x0000)
struct GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetDataHandle;                                  // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit) == 0x000030, "Wrong size on GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit, TargetDataHandle) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit::TargetDataHandle' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit, ApplicationTag) == 0x000028, "Member 'GA_Melee_Mantis_Parent_C_BP_OnMantisTechniqueHit::ApplicationTag' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.SetKnockbackImmunity
// 0x0020 (0x0020 - 0x0000)
struct GA_Melee_Mantis_Parent_C_SetKnockbackImmunity final
{
public:
	bool                                          ImmunityOn;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0008(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_SetKnockbackImmunity");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity) == 0x000020, "Wrong size on GA_Melee_Mantis_Parent_C_SetKnockbackImmunity");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity, ImmunityOn) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_SetKnockbackImmunity::ImmunityOn' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000008, "Member 'GA_Melee_Mantis_Parent_C_SetKnockbackImmunity::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetKnockbackImmunity, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000018, "Member 'GA_Melee_Mantis_Parent_C_SetKnockbackImmunity::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function GA_Melee_Mantis_Parent.GA_Melee_Mantis_Parent_C.SetPawnCollision
// 0x0018 (0x0018 - 0x0000)
struct GA_Melee_Mantis_Parent_C_SetPawnCollision final
{
public:
	class AFortPawn*                              Fort_Pawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Collision_On;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Melee_Mantis_Parent_C_SetPawnCollision) == 0x000008, "Wrong alignment on GA_Melee_Mantis_Parent_C_SetPawnCollision");
static_assert(sizeof(GA_Melee_Mantis_Parent_C_SetPawnCollision) == 0x000018, "Wrong size on GA_Melee_Mantis_Parent_C_SetPawnCollision");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, Fort_Pawn) == 0x000000, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::Fort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, Collision_On) == 0x000008, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::Collision_On' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, CallFunc_NotEqual_NameName_ReturnValue) == 0x000009, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Melee_Mantis_Parent_C_SetPawnCollision, CallFunc_GetCollisionProfileName_ReturnValue) == 0x00000C, "Member 'GA_Melee_Mantis_Parent_C_SetPawnCollision::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");

}

