#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Quest_PassiveAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Quest_PassiveAbility.GA_Quest_PassiveAbility_C
// 0x0018 (0x0AC0 - 0x0AA8)
class UGA_Quest_PassiveAbility_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        OwningPlayerPawn;                                  // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      OwningPlayerQuestManager;                          // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Quest_PassiveAbility(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Quest_PassiveAbility_C">();
	}
	static class UGA_Quest_PassiveAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Quest_PassiveAbility_C>();
	}
};
static_assert(alignof(UGA_Quest_PassiveAbility_C) == 0x000008, "Wrong alignment on UGA_Quest_PassiveAbility_C");
static_assert(sizeof(UGA_Quest_PassiveAbility_C) == 0x000AC0, "Wrong size on UGA_Quest_PassiveAbility_C");
static_assert(offsetof(UGA_Quest_PassiveAbility_C, UberGraphFrame) == 0x000AA8, "Member 'UGA_Quest_PassiveAbility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Quest_PassiveAbility_C, OwningPlayerPawn) == 0x000AB0, "Member 'UGA_Quest_PassiveAbility_C::OwningPlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Quest_PassiveAbility_C, OwningPlayerQuestManager) == 0x000AB8, "Member 'UGA_Quest_PassiveAbility_C::OwningPlayerQuestManager' has a wrong offset!");

}

