#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Quest_PassiveAbility

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Quest_PassiveAbility.GA_Quest_PassiveAbility_C.ExecuteUbergraph_GA_Quest_PassiveAbility
// 0x0030 (0x0030 - 0x0000)
struct GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility) == 0x000008, "Wrong alignment on GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility");
static_assert(sizeof(GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility) == 0x000030, "Wrong size on GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility");
static_assert(offsetof(GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility, EntryPoint) == 0x000000, "Member 'GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000010, "Member 'GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000018, "Member 'GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility, CallFunc_GetQuestManager_ReturnValue) == 0x000028, "Member 'GA_Quest_PassiveAbility_C_ExecuteUbergraph_GA_Quest_PassiveAbility::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

}

