#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Quest_Awakening_HightowerDate_VR

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Quest_Awakening_HightowerDate_VR.GA_Quest_Awakening_HightowerDate_VR_C.ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR
// 0x0070 (0x0070 - 0x0000)
struct GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreativeModePlaylist_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CallFunc_GetGameStateAthena_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhase                              K2Node_CustomEvent_GamePhase;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAthenaGamePhase GamePhase)>   K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR) == 0x000008, "Wrong alignment on GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR");
static_assert(sizeof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR) == 0x000070, "Wrong size on GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, EntryPoint) == 0x000000, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_GetGameStateAthena_ReturnValue) == 0x000008, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_GetGameStateAthena_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_IsCreativeModePlaylist_ReturnValue) == 0x000010, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_IsCreativeModePlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_GetGameStateAthena_ReturnValue_1) == 0x000018, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_GetGameStateAthena_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, K2Node_CustomEvent_GamePhase) == 0x000020, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::K2Node_CustomEvent_GamePhase' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000028, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000030, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput) == 0x000038, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_DoesTagAssetInterfaceHaveTag_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue) == 0x000048, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_DoesTagAssetInterfaceHaveTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000060, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000068, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000069, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x00006A, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR, CallFunc_Not_PreBool_ReturnValue) == 0x00006B, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function GA_Quest_Awakening_HightowerDate_VR.GA_Quest_Awakening_HightowerDate_VR_C.Wait End Game Phase
// 0x0001 (0x0001 - 0x0000)
struct GA_Quest_Awakening_HightowerDate_VR_C_Wait_End_Game_Phase final
{
public:
	EAthenaGamePhase                              GamePhase;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Quest_Awakening_HightowerDate_VR_C_Wait_End_Game_Phase) == 0x000001, "Wrong alignment on GA_Quest_Awakening_HightowerDate_VR_C_Wait_End_Game_Phase");
static_assert(sizeof(GA_Quest_Awakening_HightowerDate_VR_C_Wait_End_Game_Phase) == 0x000001, "Wrong size on GA_Quest_Awakening_HightowerDate_VR_C_Wait_End_Game_Phase");
static_assert(offsetof(GA_Quest_Awakening_HightowerDate_VR_C_Wait_End_Game_Phase, GamePhase) == 0x000000, "Member 'GA_Quest_Awakening_HightowerDate_VR_C_Wait_End_Game_Phase::GamePhase' has a wrong offset!");

}

