#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Trap_FrostedTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_TrapGeneric_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Trap_FrostedTips.GA_Trap_FrostedTips_C
// 0x0180 (0x0C58 - 0x0AD8)
class UGA_Trap_FrostedTips_C : public UGA_TrapGeneric_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Trap_FrostedTips_C;              // 0x0AD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFortGameplayEffectContainerSpec       GameplayEffectSpec;                                // 0x0AE0(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ATrap_Floor_FrostedTips_C*              FrostedTipsTrap;                                   // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         FireBallsToSpawn;                                  // 0x0BA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SpawnedProjectileMaxSpeed;                         // 0x0BC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SpawnedProjectileMinSpeed;                         // 0x0BE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ConeHalfAngleInDegrees;                            // 0x0C00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        ProjectileSpawnVectors;                            // 0x0C20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0C30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Trap_FrostedTips(int32 EntryPoint);
	void TriggerTrapGameplay();
	void K2_ActivateAbility();
	void Targeted_07C1C34E45CD85906A2BE8AC828863B9(const struct FGameplayAbilityTargetDataHandle& TargetData_0, const struct FGameplayTag& ApplicationTag);
	void Cancelled_07C1C34E45CD85906A2BE8AC828863B9(const struct FGameplayAbilityTargetDataHandle& TargetData_0, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Trap_FrostedTips_C">();
	}
	static class UGA_Trap_FrostedTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Trap_FrostedTips_C>();
	}
};
static_assert(alignof(UGA_Trap_FrostedTips_C) == 0x000008, "Wrong alignment on UGA_Trap_FrostedTips_C");
static_assert(sizeof(UGA_Trap_FrostedTips_C) == 0x000C58, "Wrong size on UGA_Trap_FrostedTips_C");
static_assert(offsetof(UGA_Trap_FrostedTips_C, UberGraphFrame_GA_Trap_FrostedTips_C) == 0x000AD8, "Member 'UGA_Trap_FrostedTips_C::UberGraphFrame_GA_Trap_FrostedTips_C' has a wrong offset!");
static_assert(offsetof(UGA_Trap_FrostedTips_C, GameplayEffectSpec) == 0x000AE0, "Member 'UGA_Trap_FrostedTips_C::GameplayEffectSpec' has a wrong offset!");
static_assert(offsetof(UGA_Trap_FrostedTips_C, FrostedTipsTrap) == 0x000B98, "Member 'UGA_Trap_FrostedTips_C::FrostedTipsTrap' has a wrong offset!");
static_assert(offsetof(UGA_Trap_FrostedTips_C, FireBallsToSpawn) == 0x000BA0, "Member 'UGA_Trap_FrostedTips_C::FireBallsToSpawn' has a wrong offset!");
static_assert(offsetof(UGA_Trap_FrostedTips_C, SpawnedProjectileMaxSpeed) == 0x000BC0, "Member 'UGA_Trap_FrostedTips_C::SpawnedProjectileMaxSpeed' has a wrong offset!");
static_assert(offsetof(UGA_Trap_FrostedTips_C, SpawnedProjectileMinSpeed) == 0x000BE0, "Member 'UGA_Trap_FrostedTips_C::SpawnedProjectileMinSpeed' has a wrong offset!");
static_assert(offsetof(UGA_Trap_FrostedTips_C, ConeHalfAngleInDegrees) == 0x000C00, "Member 'UGA_Trap_FrostedTips_C::ConeHalfAngleInDegrees' has a wrong offset!");
static_assert(offsetof(UGA_Trap_FrostedTips_C, ProjectileSpawnVectors) == 0x000C20, "Member 'UGA_Trap_FrostedTips_C::ProjectileSpawnVectors' has a wrong offset!");
static_assert(offsetof(UGA_Trap_FrostedTips_C, TargetData) == 0x000C30, "Member 'UGA_Trap_FrostedTips_C::TargetData' has a wrong offset!");

}

