#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStateMachine

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GameplayStateMachine.GameplayState.BeginState
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_BeginState final
{
public:
	struct FGameplayTag                           PrevStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayState_BeginState) == 0x000004, "Wrong alignment on GameplayState_BeginState");
static_assert(sizeof(GameplayState_BeginState) == 0x000008, "Wrong size on GameplayState_BeginState");
static_assert(offsetof(GameplayState_BeginState, PrevStateId) == 0x000000, "Member 'GameplayState_BeginState::PrevStateId' has a wrong offset!");

// Function GameplayStateMachine.GameplayState.EndState
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_EndState final
{
public:
	struct FGameplayTag                           NextStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayState_EndState) == 0x000004, "Wrong alignment on GameplayState_EndState");
static_assert(sizeof(GameplayState_EndState) == 0x000008, "Wrong size on GameplayState_EndState");
static_assert(offsetof(GameplayState_EndState, NextStateId) == 0x000000, "Member 'GameplayState_EndState::NextStateId' has a wrong offset!");

// Function GameplayStateMachine.GameplayState.UpdateState
// 0x0004 (0x0004 - 0x0000)
struct GameplayState_UpdateState final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayState_UpdateState) == 0x000004, "Wrong alignment on GameplayState_UpdateState");
static_assert(sizeof(GameplayState_UpdateState) == 0x000004, "Wrong size on GameplayState_UpdateState");
static_assert(offsetof(GameplayState_UpdateState, DeltaTime) == 0x000000, "Member 'GameplayState_UpdateState::DeltaTime' has a wrong offset!");

// Function GameplayStateMachine.GameplayState.GetStateId
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_GetStateId final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayState_GetStateId) == 0x000004, "Wrong alignment on GameplayState_GetStateId");
static_assert(sizeof(GameplayState_GetStateId) == 0x000008, "Wrong size on GameplayState_GetStateId");
static_assert(offsetof(GameplayState_GetStateId, ReturnValue) == 0x000000, "Member 'GameplayState_GetStateId::ReturnValue' has a wrong offset!");

// Function GameplayStateMachine.GameplayStateMachine.SetState
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_SetState final
{
public:
	struct FGameplayTag                           InStateId;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayStateMachine_SetState) == 0x000004, "Wrong alignment on GameplayStateMachine_SetState");
static_assert(sizeof(GameplayStateMachine_SetState) == 0x000008, "Wrong size on GameplayStateMachine_SetState");
static_assert(offsetof(GameplayStateMachine_SetState, InStateId) == 0x000000, "Member 'GameplayStateMachine_SetState::InStateId' has a wrong offset!");

// Function GameplayStateMachine.GameplayStateMachine.GetActiveStateId
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_GetActiveStateId final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayStateMachine_GetActiveStateId) == 0x000004, "Wrong alignment on GameplayStateMachine_GetActiveStateId");
static_assert(sizeof(GameplayStateMachine_GetActiveStateId) == 0x000008, "Wrong size on GameplayStateMachine_GetActiveStateId");
static_assert(offsetof(GameplayStateMachine_GetActiveStateId, ReturnValue) == 0x000000, "Member 'GameplayStateMachine_GetActiveStateId::ReturnValue' has a wrong offset!");

// Function GameplayStateMachine.GameplayStateMachine.GetActiveStateObject
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_GetActiveStateObject final
{
public:
	class UGameplayState*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayStateMachine_GetActiveStateObject) == 0x000008, "Wrong alignment on GameplayStateMachine_GetActiveStateObject");
static_assert(sizeof(GameplayStateMachine_GetActiveStateObject) == 0x000008, "Wrong size on GameplayStateMachine_GetActiveStateObject");
static_assert(offsetof(GameplayStateMachine_GetActiveStateObject, ReturnValue) == 0x000000, "Member 'GameplayStateMachine_GetActiveStateObject::ReturnValue' has a wrong offset!");

// Function GameplayStateMachine.GameplayStateMachine.GetStateMachineId
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_GetStateMachineId final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayStateMachine_GetStateMachineId) == 0x000004, "Wrong alignment on GameplayStateMachine_GetStateMachineId");
static_assert(sizeof(GameplayStateMachine_GetStateMachineId) == 0x000008, "Wrong size on GameplayStateMachine_GetStateMachineId");
static_assert(offsetof(GameplayStateMachine_GetStateMachineId, ReturnValue) == 0x000000, "Member 'GameplayStateMachine_GetStateMachineId::ReturnValue' has a wrong offset!");

}

