#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStateMachine

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayStateMachine_structs.hpp"


namespace SDK
{

// Class GameplayStateMachine.GameplayState
// 0x0010 (0x0038 - 0x0028)
class UGameplayState : public UObject
{
public:
	struct FGameplayTag                           StateId;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReplicates;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginState(const struct FGameplayTag& PrevStateId);
	void EndState(const struct FGameplayTag& NextStateId);
	void UpdateState(const float DeltaTime);

	struct FGameplayTag GetStateId() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayState">();
	}
	static class UGameplayState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayState>();
	}
};
static_assert(alignof(UGameplayState) == 0x000008, "Wrong alignment on UGameplayState");
static_assert(sizeof(UGameplayState) == 0x000038, "Wrong size on UGameplayState");
static_assert(offsetof(UGameplayState, StateId) == 0x000028, "Member 'UGameplayState::StateId' has a wrong offset!");
static_assert(offsetof(UGameplayState, bReplicates) == 0x000030, "Member 'UGameplayState::bReplicates' has a wrong offset!");

// Class GameplayStateMachine.GameplayStateMachine
// 0x0048 (0x0080 - 0x0038)
class UGameplayStateMachine final : public UGameplayState
{
public:
	struct FGameplayTag                           StateMachineId;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPubliclyBroadcast;                                // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPersistDelegatesOnUnregistration;                 // 0x0041(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayStateData               ActiveGameplayStateData;                           // 0x0048(0x0010)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayStateSettings>         GameplayStateSettings;                             // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           InitialGameplayStateId;                            // 0x0068(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameplayStateMachineManager*           StateMachineManager;                               // 0x0070(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameplayStateMachineSubsystem*         StateMachineSubSystem;                             // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void EvaluateStateTransition();
	void OnRep_ActiveGameplayStateData();
	void SetState(const struct FGameplayTag& InStateId);

	struct FGameplayTag GetActiveStateId() const;
	class UGameplayState* GetActiveStateObject() const;
	struct FGameplayTag GetStateMachineId() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayStateMachine">();
	}
	static class UGameplayStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayStateMachine>();
	}
};
static_assert(alignof(UGameplayStateMachine) == 0x000008, "Wrong alignment on UGameplayStateMachine");
static_assert(sizeof(UGameplayStateMachine) == 0x000080, "Wrong size on UGameplayStateMachine");
static_assert(offsetof(UGameplayStateMachine, StateMachineId) == 0x000038, "Member 'UGameplayStateMachine::StateMachineId' has a wrong offset!");
static_assert(offsetof(UGameplayStateMachine, bPubliclyBroadcast) == 0x000040, "Member 'UGameplayStateMachine::bPubliclyBroadcast' has a wrong offset!");
static_assert(offsetof(UGameplayStateMachine, bPersistDelegatesOnUnregistration) == 0x000041, "Member 'UGameplayStateMachine::bPersistDelegatesOnUnregistration' has a wrong offset!");
static_assert(offsetof(UGameplayStateMachine, ActiveGameplayStateData) == 0x000048, "Member 'UGameplayStateMachine::ActiveGameplayStateData' has a wrong offset!");
static_assert(offsetof(UGameplayStateMachine, GameplayStateSettings) == 0x000058, "Member 'UGameplayStateMachine::GameplayStateSettings' has a wrong offset!");
static_assert(offsetof(UGameplayStateMachine, InitialGameplayStateId) == 0x000068, "Member 'UGameplayStateMachine::InitialGameplayStateId' has a wrong offset!");
static_assert(offsetof(UGameplayStateMachine, StateMachineManager) == 0x000070, "Member 'UGameplayStateMachine::StateMachineManager' has a wrong offset!");
static_assert(offsetof(UGameplayStateMachine, StateMachineSubSystem) == 0x000078, "Member 'UGameplayStateMachine::StateMachineSubSystem' has a wrong offset!");

// Class GameplayStateMachine.GameplayStateMachineManager
// 0x0120 (0x01D0 - 0x00B0)
class UGameplayStateMachineManager final : public UActorComponent
{
public:
	struct FGameplayStateMachineArray             StateMachineList;                                  // 0x00B0(0x0120)(Net, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayStateMachineManager">();
	}
	static class UGameplayStateMachineManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayStateMachineManager>();
	}
};
static_assert(alignof(UGameplayStateMachineManager) == 0x000008, "Wrong alignment on UGameplayStateMachineManager");
static_assert(sizeof(UGameplayStateMachineManager) == 0x0001D0, "Wrong size on UGameplayStateMachineManager");
static_assert(offsetof(UGameplayStateMachineManager, StateMachineList) == 0x0000B0, "Member 'UGameplayStateMachineManager::StateMachineList' has a wrong offset!");

// Class GameplayStateMachine.GameplayStateMachineSubsystem
// 0x0050 (0x0080 - 0x0030)
class UGameplayStateMachineSubsystem final : public UGameInstanceSubsystem
{
public:
	TMap<struct FGameplayTag, struct FGameplayStateMachineData> StateMachineMap;                     // 0x0030(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayStateMachineSubsystem">();
	}
	static class UGameplayStateMachineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayStateMachineSubsystem>();
	}
};
static_assert(alignof(UGameplayStateMachineSubsystem) == 0x000008, "Wrong alignment on UGameplayStateMachineSubsystem");
static_assert(sizeof(UGameplayStateMachineSubsystem) == 0x000080, "Wrong size on UGameplayStateMachineSubsystem");
static_assert(offsetof(UGameplayStateMachineSubsystem, StateMachineMap) == 0x000030, "Member 'UGameplayStateMachineSubsystem::StateMachineMap' has a wrong offset!");

}

