#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HighTower_Tapas_SkyStrike_Explode

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_HighTower_Tapas_SkyStrike_Explode.GCN_HighTower_Tapas_SkyStrike_Explode_C.OnBurst
// 0x0208 (0x0208 - 0x0000)
struct GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00F0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0134(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    K2Node_DynamicCast_AsFort_Projectile_Base;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_1;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInWater_ReturnValue;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_2;                            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst) == 0x000008, "Wrong alignment on GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst");
static_assert(sizeof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst) == 0x000208, "Wrong size on GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, Temp_object_Variable) == 0x0000F0, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_Array_Get_Item) == 0x000100, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_Greater_IntInt_ReturnValue) == 0x00010C, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000110, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_Add_VectorVector_ReturnValue) == 0x00011C, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000128, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_LineTraceSingle_OutHit) == 0x000134, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_LineTraceSingle_ReturnValue) == 0x0001C0, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C4, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, K2Node_DynamicCast_AsFort_Projectile_Base) == 0x0001D0, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::K2Node_DynamicCast_AsFort_Projectile_Base' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, Temp_object_Variable_1) == 0x0001E0, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, CallFunc_IsInWater_ReturnValue) == 0x0001E8, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::CallFunc_IsInWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, Temp_object_Variable_2) == 0x0001F0, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, Temp_bool_Variable) == 0x0001F8, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst, K2Node_Select_Default) == 0x000200, "Member 'GCN_HighTower_Tapas_SkyStrike_Explode_C_OnBurst::K2Node_Select_Default' has a wrong offset!");

}

