#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HighTower_Wasabi_Claws_SpinSlash_Hit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_HighTower_Wasabi_Claws_SpinSlash_Hit.GCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C
// 0x0030 (0x01E8 - 0x01B8)
class UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C final : public UFortGameplayCueNotify_Burst
{
public:
	class UAnimMontage*                           FullBodyHitMontage;                                // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactRotation;                                    // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         ImpactFX;                                          // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ImpactDecal;                                       // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalScale;                                        // 0x01D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldSpawnDecal;                                  // 0x01E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnBurst(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance) const;
	void OnBurstNiagara(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UNiagaraComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C">();
	}
	static class UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C>();
	}
};
static_assert(alignof(UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C) == 0x000008, "Wrong alignment on UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C");
static_assert(sizeof(UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C) == 0x0001E8, "Wrong size on UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C");
static_assert(offsetof(UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C, FullBodyHitMontage) == 0x0001B8, "Member 'UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C::FullBodyHitMontage' has a wrong offset!");
static_assert(offsetof(UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C, ImpactRotation) == 0x0001C0, "Member 'UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C::ImpactRotation' has a wrong offset!");
static_assert(offsetof(UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C, ImpactFX) == 0x0001C8, "Member 'UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C::ImpactFX' has a wrong offset!");
static_assert(offsetof(UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C, ImpactDecal) == 0x0001D0, "Member 'UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C::ImpactDecal' has a wrong offset!");
static_assert(offsetof(UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C, DecalScale) == 0x0001D8, "Member 'UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C::DecalScale' has a wrong offset!");
static_assert(offsetof(UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C, ShouldSpawnDecal) == 0x0001E4, "Member 'UGCN_HighTower_Wasabi_Claws_SpinSlash_Hit_C::ShouldSpawnDecal' has a wrong offset!");

}

