#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HighTower_Date_ChainLightning_ChainBurst

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_HighTower_Date_ChainLightning_ChainBurst.GCN_HighTower_Date_ChainLightning_ChainBurst_C.OnBurstGeneric
// 0x0340 (0x0340 - 0x0000)
struct GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceBetweenActors_Distance;        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0228(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x02B4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric");
static_assert(sizeof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric) == 0x000340, "Wrong size on GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, ParticleComponents) == 0x0000C0, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, AudioComponents) == 0x0000D0, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, BurstDecalInstance) == 0x0000E8, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000100, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000104, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000128, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_Normal) == 0x00017C, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000188, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000190, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000198, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A0, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A8, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001AC, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B0, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, K2Node_DynamicCast_AsActor) == 0x0001B8, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_GetDistanceBetweenActors_Distance) == 0x0001C4, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_GetDistanceBetweenActors_Distance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C8, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_Conv_FloatToString_ReturnValue) == 0x0001D8, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0001E8, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_IsValid_ReturnValue) == 0x0001F4, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0001F8, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000204, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_FindLookAtRotation_ReturnValue) == 0x000210, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x00021C, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000228, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0002B4, "Member 'GCN_HighTower_Date_ChainLightning_ChainBurst_C_OnBurstGeneric::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

}

