#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HighTower_HoneyDew_JumpSmash_Land

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_HighTower_HoneyDew_JumpSmash_Land.GCN_HighTower_HoneyDew_JumpSmash_Land_C.OnBurstNiagara
// 0x0398 (0x0398 - 0x0000)
struct GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundBase*>                     BurstSounds;                                       // 0x00F0(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0118(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x01B8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x01E0(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0200(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0278(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x0304(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USoundBase*                             CallFunc_Array_Get_Item_1;                         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara) == 0x000008, "Wrong alignment on GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara");
static_assert(sizeof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara) == 0x000398, "Wrong size on GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, MyTarget) == 0x000000, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, Parameters) == 0x000008, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, ParticleComponents) == 0x0000C0, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, AudioComponents) == 0x0000D0, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, BurstDecalInstance) == 0x0000E8, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, BurstSounds) == 0x0000F0, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::BurstSounds' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, K2Node_MakeArray_Array) == 0x000100, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000110, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000118, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0001B0, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0001B4, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0001B8, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0001D0, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0001D8, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0001E0, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000200, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_Location) == 0x000220, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_Normal) == 0x00022C, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000238, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000240, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000248, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000250, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000258, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00025C, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000260, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000268, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_FTrunc_ReturnValue) == 0x000274, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000278, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x000304, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara, CallFunc_Array_Get_Item_1) == 0x000390, "Member 'GCN_HighTower_HoneyDew_JumpSmash_Land_C_OnBurstNiagara::CallFunc_Array_Get_Item_1' has a wrong offset!");

}

