#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_LowTower_Chaplin_ChargedShoot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_LowTower_Chaplin_ChargedShoot.GCN_LowTower_Chaplin_ChargedShoot_C.OnBurstGeneric
// 0x0100 (0x0100 - 0x0000)
struct GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric) == 0x000008, "Wrong alignment on GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric");
static_assert(sizeof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric) == 0x000100, "Wrong size on GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric, MyTarget) == 0x000000, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric, Parameters) == 0x000008, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric, ParticleComponents) == 0x0000C0, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric, AudioComponents) == 0x0000D0, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric, BurstDecalInstance) == 0x0000E8, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000F0, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_OnBurstGeneric::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GCN_LowTower_Chaplin_ChargedShoot.GCN_LowTower_Chaplin_ChargedShoot_C.BurstApplied
// 0x0058 (0x0058 - 0x0000)
struct GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied) == 0x000008, "Wrong alignment on GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied");
static_assert(sizeof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied) == 0x000058, "Wrong size on GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, PlayerPawn) == 0x000000, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::PlayerPawn' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000008, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, K2Node_MakeArray_Array) == 0x000020, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, CallFunc_GetAnimInstance_ReturnValue) == 0x000038, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000048, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, CallFunc_Montage_Play_ReturnValue) == 0x000050, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied, CallFunc_Montage_Play_ReturnValue_1) == 0x000054, "Member 'GCN_LowTower_Chaplin_ChargedShoot_C_BurstApplied::CallFunc_Montage_Play_ReturnValue_1' has a wrong offset!");

}

