#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HighTower_Squash_WhirlwindBlast_Activate

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GCN_HighTower_Squash_WhirlwindBlast_Activate.GCN_HighTower_Squash_WhirlwindBlast_Activate_C.OnBurstNiagara
// 0x0110 (0x0110 - 0x0000)
struct GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara) == 0x000008, "Wrong alignment on GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara");
static_assert(sizeof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara) == 0x000110, "Wrong size on GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara");
static_assert(offsetof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara, MyTarget) == 0x000000, "Member 'GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara, Parameters) == 0x000008, "Member 'GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara, ParticleComponents) == 0x0000C0, "Member 'GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara, AudioComponents) == 0x0000D0, "Member 'GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara, BurstDecalInstance) == 0x0000E8, "Member 'GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara, K2Node_MakeArray_Array) == 0x0000F0, "Member 'GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000100, "Member 'GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara, CallFunc_GetActorTeam_ReturnValue) == 0x00010C, "Member 'GCN_HighTower_Squash_WhirlwindBlast_Activate_C_OnBurstNiagara::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");

}

