#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_HighTower_Date_Ball_Lightning_HitWorld

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_HighTower_Date_Ball_Lightning_HitWorld.GCN_HighTower_Date_Ball_Lightning_HitWorld_C.OnBurst
// 0x0280 (0x0280 - 0x0000)
struct GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x00F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0120(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0148(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0168(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01F0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst) == 0x000008, "Wrong alignment on GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst");
static_assert(sizeof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst) == 0x000280, "Wrong size on GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, HitNormal) == 0x0000F0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::HitNormal' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000100, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_MakeRotFromX_ReturnValue) == 0x000108, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000114, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000118, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000120, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000138, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000140, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000148, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000168, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x000188, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x000194, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001A0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A8, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001B0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B8, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001C0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001C4, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C8, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakRotator_Roll) == 0x0001D0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakRotator_Pitch) == 0x0001D4, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_BreakRotator_Yaw) == 0x0001D8, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001DC, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001E0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_MakeRotator_ReturnValue) == 0x0001E4, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001F0, "Member 'GCN_HighTower_Date_Ball_Lightning_HitWorld_C_OnBurst::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

