#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_FallDamageImmunity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_FallDamageImmunity.GCNL_Athena_FallDamageImmunity_C
// 0x0018 (0x07D8 - 0x07C0)
class AGCNL_Athena_FallDamageImmunity_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        InUseLoopAudio;                                    // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_FallDamageImmunity(int32 EntryPoint);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_FallDamageImmunity_C">();
	}
	static class AGCNL_Athena_FallDamageImmunity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_FallDamageImmunity_C>();
	}
};
static_assert(alignof(AGCNL_Athena_FallDamageImmunity_C) == 0x000008, "Wrong alignment on AGCNL_Athena_FallDamageImmunity_C");
static_assert(sizeof(AGCNL_Athena_FallDamageImmunity_C) == 0x0007D8, "Wrong size on AGCNL_Athena_FallDamageImmunity_C");
static_assert(offsetof(AGCNL_Athena_FallDamageImmunity_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_Athena_FallDamageImmunity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_FallDamageImmunity_C, InUseLoopAudio) == 0x0007C8, "Member 'AGCNL_Athena_FallDamageImmunity_C::InUseLoopAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_FallDamageImmunity_C, Target) == 0x0007D0, "Member 'AGCNL_Athena_FallDamageImmunity_C::Target' has a wrong offset!");

}

