#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_HighTower_Grape_BrambleShield_Active

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_HighTower_Grape_BrambleShield_Active.GCNL_HighTower_Grape_BrambleShield_Active_C.ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active
// 0x0230 (0x0230 - 0x0000)
struct GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFoleySoundSubsystem*                   CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0020(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x00D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x00E8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance_1;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0110(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x01C8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFoleySoundSubsystem*                   CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active) == 0x000008, "Wrong alignment on GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active");
static_assert(sizeof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active) == 0x000230, "Wrong size on GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, EntryPoint) == 0x000000, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_MyTarget_1) == 0x000018, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_Parameters_1) == 0x000020, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_ParticleComponents_1) == 0x0000D8, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_AudioComponents_1) == 0x0000E8, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_BurstCameraShakeInstance_1) == 0x0000F8, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_BurstDecalInstance_1) == 0x000100, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_MyTarget) == 0x000108, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_Parameters) == 0x000110, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_ParticleComponents) == 0x0001C8, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_AudioComponents) == 0x0001D8, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_BurstCameraShakeInstance) == 0x0001E8, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_Event_BurstDecalInstance) == 0x0001F0, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_DynamicCast_AsFort_Pawn) == 0x0001F8, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000208, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000210, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, CallFunc_IsValid_ReturnValue) == 0x000211, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, CallFunc_GetVelocity_ReturnValue) == 0x000214, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, CallFunc_VSize_ReturnValue) == 0x000220, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, CallFunc_MapRangeClamped_ReturnValue) == 0x000224, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000228, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");

// Function GCNL_HighTower_Grape_BrambleShield_Active.GCNL_HighTower_Grape_BrambleShield_Active_C.OnRemovalGeneric
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric) == 0x0000F0, "Wrong size on GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric, ParticleComponents) == 0x0000C0, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric, AudioComponents) == 0x0000D0, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnRemovalGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_HighTower_Grape_BrambleShield_Active.GCNL_HighTower_Grape_BrambleShield_Active_C.OnApplicationGeneric
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric) == 0x000008, "Wrong alignment on GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric");
static_assert(sizeof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric) == 0x0000F0, "Wrong size on GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric, MyTarget) == 0x000000, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric, Parameters) == 0x000008, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric, ParticleComponents) == 0x0000C0, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric, AudioComponents) == 0x0000D0, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_OnApplicationGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_HighTower_Grape_BrambleShield_Active.GCNL_HighTower_Grape_BrambleShield_Active_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCNL_HighTower_Grape_BrambleShield_Active_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_HighTower_Grape_BrambleShield_Active_C_ReceiveTick) == 0x000004, "Wrong alignment on GCNL_HighTower_Grape_BrambleShield_Active_C_ReceiveTick");
static_assert(sizeof(GCNL_HighTower_Grape_BrambleShield_Active_C_ReceiveTick) == 0x000004, "Wrong size on GCNL_HighTower_Grape_BrambleShield_Active_C_ReceiveTick");
static_assert(offsetof(GCNL_HighTower_Grape_BrambleShield_Active_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCNL_HighTower_Grape_BrambleShield_Active_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

