#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_ReactiveProp_FireExtinguisher_Smoking

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Athena_ReactiveProp_FireExtinguisher_Smoking.GCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C
// 0x0018 (0x07D8 - 0x07C0)
class AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           TimerHandle;                                       // 0x07C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            SpawnRampCurve;                                    // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Athena_ReactiveProp_FireExtinguisher_Smoking(int32 EntryPoint);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void Loop();
	void StartLoop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C">();
	}
	static class AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C>();
	}
};
static_assert(alignof(AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C) == 0x000008, "Wrong alignment on AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C");
static_assert(sizeof(AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C) == 0x0007D8, "Wrong size on AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C");
static_assert(offsetof(AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C, TimerHandle) == 0x0007C8, "Member 'AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C, SpawnRampCurve) == 0x0007D0, "Member 'AGCNL_Athena_ReactiveProp_FireExtinguisher_Smoking_C::SpawnRampCurve' has a wrong offset!");

}

