#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_LowTower_Chaplin_PrimaryCharge

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCNL_LowTower_Chaplin_PrimaryCharge.GCNL_LowTower_Chaplin_PrimaryCharge_C.ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge
// 0x02B8 (0x02B8 - 0x0000)
struct GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0040(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents_1;                 // 0x00F8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x0108(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0140(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             K2Node_Event_ParticleComponents;                   // 0x01F8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0208(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item;                           // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x022C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetPlayerAndWeaponAnimInstance_Player;    // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetPlayerAndWeaponAnimInstance_Weapon;    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetPlayerAndWeaponAnimInstance_Player_1;  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetPlayerAndWeaponAnimInstance_Weapon_1;  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_1;               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge) == 0x000008, "Wrong alignment on GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge");
static_assert(sizeof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge) == 0x0002B8, "Wrong size on GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, EntryPoint) == 0x000000, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000030, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_MyTarget_1) == 0x000038, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_Parameters_1) == 0x000040, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_ParticleComponents_1) == 0x0000F8, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_AudioComponents_1) == 0x000108, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_BurstCameraShakeInstance) == 0x000118, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_BurstDecalInstance) == 0x000120, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000128, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_MyTarget) == 0x000138, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_Parameters) == 0x000140, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_ParticleComponents) == 0x0001F8, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_Event_AudioComponents) == 0x000208, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_Array_Get_Item) == 0x000218, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1) == 0x000220, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_DynamicCast_bSuccess_1) == 0x000228, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, K2Node_CreateDelegate_OutputDelegate_2) == 0x00022C, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_GetValueAtLevel_ReturnValue) == 0x00023C, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000240, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000248, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_IsValid_ReturnValue) == 0x000249, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x00024C, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000250, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000258, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000260, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000270, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_GetPlayerAndWeaponAnimInstance_Player) == 0x000278, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_GetPlayerAndWeaponAnimInstance_Player' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_GetPlayerAndWeaponAnimInstance_Weapon) == 0x000280, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_GetPlayerAndWeaponAnimInstance_Weapon' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_GetPlayerAndWeaponAnimInstance_Player_1) == 0x000288, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_GetPlayerAndWeaponAnimInstance_Player_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_GetPlayerAndWeaponAnimInstance_Weapon_1) == 0x000290, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_GetPlayerAndWeaponAnimInstance_Weapon_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_IsValid_ReturnValue_1) == 0x000298, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00029C, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0002A8, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_Montage_Play_ReturnValue) == 0x0002B0, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge, CallFunc_Montage_Play_ReturnValue_1) == 0x0002B4, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge::CallFunc_Montage_Play_ReturnValue_1' has a wrong offset!");

// Function GCNL_LowTower_Chaplin_PrimaryCharge.GCNL_LowTower_Chaplin_PrimaryCharge_C.OnLoopingStartGeneric
// 0x00E0 (0x00E0 - 0x0000)
struct GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric) == 0x000008, "Wrong alignment on GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric");
static_assert(sizeof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric) == 0x0000E0, "Wrong size on GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric, MyTarget) == 0x000000, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric, Parameters) == 0x000008, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric, ParticleComponents) == 0x0000C0, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric, AudioComponents) == 0x0000D0, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnLoopingStartGeneric::AudioComponents' has a wrong offset!");

// Function GCNL_LowTower_Chaplin_PrimaryCharge.GCNL_LowTower_Chaplin_PrimaryCharge_C.OnRemovalGeneric
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UFXSystemComponent*>             ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric) == 0x000008, "Wrong alignment on GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric");
static_assert(sizeof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric) == 0x0000F0, "Wrong size on GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric, MyTarget) == 0x000000, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric, Parameters) == 0x000008, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric, ParticleComponents) == 0x0000C0, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric, AudioComponents) == 0x0000D0, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_OnRemovalGeneric::BurstDecalInstance' has a wrong offset!");

// Function GCNL_LowTower_Chaplin_PrimaryCharge.GCNL_LowTower_Chaplin_PrimaryCharge_C.GetPlayerAndWeaponAnimInstance
// 0x0020 (0x0020 - 0x0000)
struct GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance final
{
public:
	class UAnimInstance*                          Player;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          Weapon;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance) == 0x000008, "Wrong alignment on GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance");
static_assert(sizeof(GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance) == 0x000020, "Wrong size on GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance, Player) == 0x000000, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance::Player' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance, Weapon) == 0x000008, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance::Weapon' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000018, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_GetPlayerAndWeaponAnimInstance::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");

// Function GCNL_LowTower_Chaplin_PrimaryCharge.GCNL_LowTower_Chaplin_PrimaryCharge_C.PulseAudioViz
// 0x0028 (0x0028 - 0x0000)
struct GCNL_LowTower_Chaplin_PrimaryCharge_C_PulseAudioViz final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_LowTower_Chaplin_PrimaryCharge_C_PulseAudioViz) == 0x000008, "Wrong alignment on GCNL_LowTower_Chaplin_PrimaryCharge_C_PulseAudioViz");
static_assert(sizeof(GCNL_LowTower_Chaplin_PrimaryCharge_C_PulseAudioViz) == 0x000028, "Wrong size on GCNL_LowTower_Chaplin_PrimaryCharge_C_PulseAudioViz");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_PulseAudioViz, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_PulseAudioViz::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_LowTower_Chaplin_PrimaryCharge_C_PulseAudioViz, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'GCNL_LowTower_Chaplin_PrimaryCharge_C_PulseAudioViz::CallFunc_IsValid_ReturnValue' has a wrong offset!");
