#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_HighTower_Tomato_RepulsorCannon_Beam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_HighTower_Tomato_RepulsorCannon_Beam.GCNL_HighTower_Tomato_RepulsorCannon_Beam_C
// 0x0040 (0x0800 - 0x07C0)
class AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        FlyBySound;                                        // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Range;                                             // 0x07D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bPlayedSound;                                      // 0x07F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F1[0x7];                                      // 0x07F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NewVar_0;                                          // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_HighTower_Tomato_RepulsorCannon_Beam(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_HighTower_Tomato_RepulsorCannon_Beam_C">();
	}
	static class AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C>();
	}
};
static_assert(alignof(AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C) == 0x000008, "Wrong alignment on AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C");
static_assert(sizeof(AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C) == 0x000800, "Wrong size on AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C");
static_assert(offsetof(AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C, FlyBySound) == 0x0007C8, "Member 'AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C::FlyBySound' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C, Range) == 0x0007D0, "Member 'AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C::Range' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C, bPlayedSound) == 0x0007F0, "Member 'AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C::bPlayedSound' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C, NewVar_0) == 0x0007F8, "Member 'AGCNL_HighTower_Tomato_RepulsorCannon_Beam_C::NewVar_0' has a wrong offset!");

}

