#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_HighTower_Tomato_RepulsorCannon_ChargeUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_HighTower_Tomato_RepulsorCannon_ChargeUp.GCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C
// 0x0040 (0x0800 - 0x07C0)
class AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Hightower_Tomato_Secondary_Charge_FlyBy;           // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxRange;                                          // 0x07D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRotator                               SavedRotation;                                     // 0x07F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GCNL_HighTower_Tomato_RepulsorCannon_ChargeUp(int32 EntryPoint);
	void Update_Audio_Location();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void ReceiveTick(float DeltaSeconds);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C">();
	}
	static class AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C>();
	}
};
static_assert(alignof(AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C) == 0x000008, "Wrong alignment on AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C");
static_assert(sizeof(AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C) == 0x000800, "Wrong size on AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C");
static_assert(offsetof(AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C, Hightower_Tomato_Secondary_Charge_FlyBy) == 0x0007C8, "Member 'AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C::Hightower_Tomato_Secondary_Charge_FlyBy' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C, MaxRange) == 0x0007D0, "Member 'AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C::MaxRange' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C, SavedRotation) == 0x0007F0, "Member 'AGCNL_HighTower_Tomato_RepulsorCannon_ChargeUp_C::SavedRotation' has a wrong offset!");

}

