#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_HighTower_Trails_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_HighTower_Trails_Parent.GCNL_HighTower_Trails_Parent_C
// 0x0068 (0x0828 - 0x07C0)
class AGCNL_HighTower_Trails_Parent_C : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Athena_C*                   AthenaPlayerPawn;                                  // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        EmitterTemplate_Aura;                              // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        EmitterTemplate_Trails;                            // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Aura_Ref;                                        // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Trails_Ref;                                      // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TrailsCheckInterval;                               // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_TrailsCheck;                                 // 0x07F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FX_Color;                                          // 0x0800(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FX_Alpha;                                          // 0x0810(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814[0x4];                                      // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnLoop;                                       // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnStop;                                       // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_HighTower_Trails_Parent(int32 EntryPoint);
	void OnRemovalGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void SetColors();
	void CheckTrails();
	void OnLoopingStartGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void AudioComponentSetup(class UAudioComponent* AudioComponent, bool Starting);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_HighTower_Trails_Parent_C">();
	}
	static class AGCNL_HighTower_Trails_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_HighTower_Trails_Parent_C>();
	}
};
static_assert(alignof(AGCNL_HighTower_Trails_Parent_C) == 0x000008, "Wrong alignment on AGCNL_HighTower_Trails_Parent_C");
static_assert(sizeof(AGCNL_HighTower_Trails_Parent_C) == 0x000828, "Wrong size on AGCNL_HighTower_Trails_Parent_C");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_HighTower_Trails_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, AthenaPlayerPawn) == 0x0007C8, "Member 'AGCNL_HighTower_Trails_Parent_C::AthenaPlayerPawn' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, EmitterTemplate_Aura) == 0x0007D0, "Member 'AGCNL_HighTower_Trails_Parent_C::EmitterTemplate_Aura' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, EmitterTemplate_Trails) == 0x0007D8, "Member 'AGCNL_HighTower_Trails_Parent_C::EmitterTemplate_Trails' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, P_Aura_Ref) == 0x0007E0, "Member 'AGCNL_HighTower_Trails_Parent_C::P_Aura_Ref' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, P_Trails_Ref) == 0x0007E8, "Member 'AGCNL_HighTower_Trails_Parent_C::P_Trails_Ref' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, TrailsCheckInterval) == 0x0007F0, "Member 'AGCNL_HighTower_Trails_Parent_C::TrailsCheckInterval' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, Timer_TrailsCheck) == 0x0007F8, "Member 'AGCNL_HighTower_Trails_Parent_C::Timer_TrailsCheck' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, FX_Color) == 0x000800, "Member 'AGCNL_HighTower_Trails_Parent_C::FX_Color' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, FX_Alpha) == 0x000810, "Member 'AGCNL_HighTower_Trails_Parent_C::FX_Alpha' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, SoundOnLoop) == 0x000818, "Member 'AGCNL_HighTower_Trails_Parent_C::SoundOnLoop' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Trails_Parent_C, SoundOnStop) == 0x000820, "Member 'AGCNL_HighTower_Trails_Parent_C::SoundOnStop' has a wrong offset!");

}

