#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_FallDamageImmunity

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_FallDamageImmunity.GCNL_Athena_FallDamageImmunity_C.ExecuteUbergraph_GCNL_Athena_FallDamageImmunity
// 0x0138 (0x0138 - 0x0000)
struct GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00D0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity) == 0x000008, "Wrong alignment on GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity");
static_assert(sizeof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity) == 0x000138, "Wrong size on GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, EntryPoint) == 0x000000, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, K2Node_Event_MyTarget) == 0x000010, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, K2Node_Event_Parameters) == 0x000018, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, K2Node_Event_ParticleComponents) == 0x0000D0, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, K2Node_Event_AudioComponents) == 0x0000E0, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_IsValid_ReturnValue_1) == 0x0000F8, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, K2Node_DynamicCast_AsFort_Pawn) == 0x000100, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_GetVelocity_ReturnValue) == 0x00010C, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_BreakVector_X) == 0x000118, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_BreakVector_Y) == 0x00011C, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_BreakVector_Z) == 0x000120, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_IsFalling_ReturnValue) == 0x000124, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_Abs_ReturnValue) == 0x000128, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_MapRangeClamped_ReturnValue) == 0x00012C, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity, CallFunc_IsLocallyControlled_ReturnValue) == 0x000130, "Member 'GCNL_Athena_FallDamageImmunity_C_ExecuteUbergraph_GCNL_Athena_FallDamageImmunity::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_FallDamageImmunity.GCNL_Athena_FallDamageImmunity_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GCNL_Athena_FallDamageImmunity_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_FallDamageImmunity_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Athena_FallDamageImmunity_C_OnLoopingStart");
static_assert(sizeof(GCNL_Athena_FallDamageImmunity_C_OnLoopingStart) == 0x0000E0, "Wrong size on GCNL_Athena_FallDamageImmunity_C_OnLoopingStart");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Athena_FallDamageImmunity_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Athena_FallDamageImmunity_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_OnLoopingStart, ParticleComponents) == 0x0000C0, "Member 'GCNL_Athena_FallDamageImmunity_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_OnLoopingStart, AudioComponents) == 0x0000D0, "Member 'GCNL_Athena_FallDamageImmunity_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_FallDamageImmunity.GCNL_Athena_FallDamageImmunity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCNL_Athena_FallDamageImmunity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_FallDamageImmunity_C_ReceiveTick) == 0x000004, "Wrong alignment on GCNL_Athena_FallDamageImmunity_C_ReceiveTick");
static_assert(sizeof(GCNL_Athena_FallDamageImmunity_C_ReceiveTick) == 0x000004, "Wrong size on GCNL_Athena_FallDamageImmunity_C_ReceiveTick");
static_assert(offsetof(GCNL_Athena_FallDamageImmunity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCNL_Athena_FallDamageImmunity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

