#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_LowTower_Chaplin_PrimaryCharge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_LowTower_Chaplin_PrimaryCharge.GCNL_LowTower_Chaplin_PrimaryCharge_C
// 0x0080 (0x0840 - 0x07C0)
class AGCNL_LowTower_Chaplin_PrimaryCharge_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawnAthena*                  FortPawn;                                          // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AudioVisMaxDistance;                               // 0x07D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AudioVizTimer;                                     // 0x07D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ChargeTimer;                                       // 0x07E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MaxChargeTimer;                                    // 0x07E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MinimumChargeTime;                                 // 0x07F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxChargeTime;                                     // 0x0810(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           WeaponSpinUpMontage;                               // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PlayerSpinUpMontage;                               // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_LowTower_Chaplin_PrimaryCharge(int32 EntryPoint);
	void MaxCharged();
	void OnLoopingStartGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemovalGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void MinCharged();
	void GetPlayerAndWeaponAnimInstance(class UAnimInstance** Player, class UAnimInstance** Weapon);

	void PulseAudioViz() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_LowTower_Chaplin_PrimaryCharge_C">();
	}
	static class AGCNL_LowTower_Chaplin_PrimaryCharge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_LowTower_Chaplin_PrimaryCharge_C>();
	}
};
static_assert(alignof(AGCNL_LowTower_Chaplin_PrimaryCharge_C) == 0x000008, "Wrong alignment on AGCNL_LowTower_Chaplin_PrimaryCharge_C");
static_assert(sizeof(AGCNL_LowTower_Chaplin_PrimaryCharge_C) == 0x000840, "Wrong size on AGCNL_LowTower_Chaplin_PrimaryCharge_C");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, FortPawn) == 0x0007C8, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::FortPawn' has a wrong offset!");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, AudioVisMaxDistance) == 0x0007D0, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::AudioVisMaxDistance' has a wrong offset!");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, AudioVizTimer) == 0x0007D8, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::AudioVizTimer' has a wrong offset!");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, ChargeTimer) == 0x0007E0, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::ChargeTimer' has a wrong offset!");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, MaxChargeTimer) == 0x0007E8, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::MaxChargeTimer' has a wrong offset!");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, MinimumChargeTime) == 0x0007F0, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::MinimumChargeTime' has a wrong offset!");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, MaxChargeTime) == 0x000810, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::MaxChargeTime' has a wrong offset!");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, WeaponSpinUpMontage) == 0x000830, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::WeaponSpinUpMontage' has a wrong offset!");
static_assert(offsetof(AGCNL_LowTower_Chaplin_PrimaryCharge_C, PlayerSpinUpMontage) == 0x000838, "Member 'AGCNL_LowTower_Chaplin_PrimaryCharge_C::PlayerSpinUpMontage' has a wrong offset!");

}

