#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_HighTower_Grape_BrambleShield_Active

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_HighTower_Grape_BrambleShield_Active.GCNL_HighTower_Grape_BrambleShield_Active_C
// 0x0018 (0x07D8 - 0x07C0)
class AGCNL_HighTower_Grape_BrambleShield_Active_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLayeredAudioComponent*             FortLayeredAudio;                                  // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              FP;                                                // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_HighTower_Grape_BrambleShield_Active(int32 EntryPoint);
	void OnRemovalGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnApplicationGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_HighTower_Grape_BrambleShield_Active_C">();
	}
	static class AGCNL_HighTower_Grape_BrambleShield_Active_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_HighTower_Grape_BrambleShield_Active_C>();
	}
};
static_assert(alignof(AGCNL_HighTower_Grape_BrambleShield_Active_C) == 0x000008, "Wrong alignment on AGCNL_HighTower_Grape_BrambleShield_Active_C");
static_assert(sizeof(AGCNL_HighTower_Grape_BrambleShield_Active_C) == 0x0007D8, "Wrong size on AGCNL_HighTower_Grape_BrambleShield_Active_C");
static_assert(offsetof(AGCNL_HighTower_Grape_BrambleShield_Active_C, UberGraphFrame) == 0x0007C0, "Member 'AGCNL_HighTower_Grape_BrambleShield_Active_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Grape_BrambleShield_Active_C, FortLayeredAudio) == 0x0007C8, "Member 'AGCNL_HighTower_Grape_BrambleShield_Active_C::FortLayeredAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_HighTower_Grape_BrambleShield_Active_C, FP) == 0x0007D0, "Member 'AGCNL_HighTower_Grape_BrambleShield_Active_C::FP' has a wrong offset!");

}

