#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeldObjectLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C
// 0x1A00 (0x1D10 - 0x0310)
class UHeldObjectLayerAnimBP_C final : public UFortItemLayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0320(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x0350(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x03D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0408(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0490(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x04C0(0x0088)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0548(0x0188)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x06D0(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0758(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0820(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x0848(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0878(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0900(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0978(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0A18(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0A48(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0AD0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0B00(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0B88(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0BB8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0BE8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0C18(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0C90(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0CC0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0D38(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0D68(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0DE0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0E10(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0E88(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0EB8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0F30(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0F60(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x0FD8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1008(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x1080(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x10B0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x10E0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x1110(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1198(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x11C8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1250(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x1280(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1308(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1338(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x13C0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x13F0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x1478(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x14A8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1530(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1560(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x15E8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1618(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x16A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x16D0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1758(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1788(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1810(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1840(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x18C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x18F8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x1970(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x19A0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1A18(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1A48(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1AC0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1AF0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1B68(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1B98(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1C10(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1C40(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1CC8(0x0030)()
	float                                         Pitch;                                             // 0x1CF8(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x1CFC(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimOffsetAlpha;                                    // 0x1D00(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHeldObjectDropped;                               // 0x1D04(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HeldObjectLayerAnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimNotify_HeldObjectPickUp();
	void AnimNotify_HeldObjectPlace();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha_0, float Yaw_0, float Pitch_0, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeldObjectLayerAnimBP_C">();
	}
	static class UHeldObjectLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeldObjectLayerAnimBP_C>();
	}
};
static_assert(alignof(UHeldObjectLayerAnimBP_C) == 0x000010, "Wrong alignment on UHeldObjectLayerAnimBP_C");
static_assert(sizeof(UHeldObjectLayerAnimBP_C) == 0x001D10, "Wrong size on UHeldObjectLayerAnimBP_C");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, UberGraphFrame) == 0x000310, "Member 'UHeldObjectLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000318, "Member 'UHeldObjectLayerAnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_34) == 0x000320, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_34' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_18) == 0x000350, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_18' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_33) == 0x0003D8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_33' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_17) == 0x000408, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_17' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_32) == 0x000490, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_32' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_16) == 0x0004C0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_16' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000548, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_15) == 0x0006D0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_15' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000758, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_UseCachedPose) == 0x000820, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_31) == 0x000848, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_31' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_14) == 0x000878, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_14' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_12) == 0x000900, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_BlendListByBool) == 0x000978, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_30) == 0x000A18, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_30' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_13) == 0x000A48, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_29) == 0x000AD0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_29' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_12) == 0x000B00, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_28) == 0x000B88, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_28' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_27) == 0x000BB8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_27' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_26) == 0x000BE8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_26' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_11) == 0x000C18, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_25) == 0x000C90, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_25' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_10) == 0x000CC0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_24) == 0x000D38, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_24' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x000D68, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_23) == 0x000DE0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_23' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x000E10, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_22) == 0x000E88, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000EB8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_21) == 0x000F30, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000F60, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_20) == 0x000FD8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001008, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_19) == 0x001080, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_18) == 0x0010B0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_17) == 0x0010E0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_11) == 0x001110, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_16) == 0x001198, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_10) == 0x0011C8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_15) == 0x001250, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_9) == 0x001280, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_14) == 0x001308, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_8) == 0x001338, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_13) == 0x0013C0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_7) == 0x0013F0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_12) == 0x001478, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x0014A8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_11) == 0x001530, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x001560, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_10) == 0x0015E8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x001618, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_9) == 0x0016A0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x0016D0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_8) == 0x001758, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x001788, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_7) == 0x001810, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x001840, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_6) == 0x0018C8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x0018F8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_5) == 0x001970, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0019A0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_4) == 0x001A18, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x001A48, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_3) == 0x001AC0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001AF0, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_2) == 0x001B68, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_SequencePlayer) == 0x001B98, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root_1) == 0x001C10, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001C40, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AnimGraphNode_Root) == 0x001CC8, "Member 'UHeldObjectLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, Pitch) == 0x001CF8, "Member 'UHeldObjectLayerAnimBP_C::Pitch' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, Yaw) == 0x001CFC, "Member 'UHeldObjectLayerAnimBP_C::Yaw' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, AimOffsetAlpha) == 0x001D00, "Member 'UHeldObjectLayerAnimBP_C::AimOffsetAlpha' has a wrong offset!");
static_assert(offsetof(UHeldObjectLayerAnimBP_C, IsHeldObjectDropped) == 0x001D04, "Member 'UHeldObjectLayerAnimBP_C::IsHeldObjectDropped' has a wrong offset!");

}

