#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HighTower_Tapas_Axe_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HighTower_Tapas_Axe_AnimBP.HighTower_Tapas_Axe_AnimBP_C
// 0x10F0 (0x1590 - 0x04A0)
class UHighTower_Tapas_Axe_AnimBP_C final : public UCustomCharacterPartAnimInstance_HightowerTapasAxe
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x04B0(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x04D0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0610(0x0030)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x0640(0x0260)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x08A0(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x09A8(0x00A0)()
	uint8                                         Pad_A48[0x8];                                      // 0x0A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0A50(0x0650)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x10A0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x10C0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x10E0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x11A8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x11D0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x11F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1218(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1240(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1348(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1368(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1388(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x13D0(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1498(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1560(0x0028)()

public:
	void ExecuteUbergraph_HighTower_Tapas_Axe_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HighTower_Tapas_Axe_AnimBP_C">();
	}
	static class UHighTower_Tapas_Axe_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighTower_Tapas_Axe_AnimBP_C>();
	}
};
static_assert(alignof(UHighTower_Tapas_Axe_AnimBP_C) == 0x000010, "Wrong alignment on UHighTower_Tapas_Axe_AnimBP_C");
static_assert(sizeof(UHighTower_Tapas_Axe_AnimBP_C) == 0x001590, "Wrong size on UHighTower_Tapas_Axe_AnimBP_C");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, UberGraphFrame) == 0x0004A0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0004A8, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x0004B0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0004D0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_Root) == 0x000610, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_Trail) == 0x000640, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_Trail' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0008A0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x0009A8, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_RigidBody) == 0x000A50, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x0010A0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0010C0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x0010E0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x0011A8, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0011D0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x0011F0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x001218, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ModifyBone) == 0x001240, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001348, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001368, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_Slot) == 0x001388, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0013D0, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_TwoWayBlend) == 0x001498, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UHighTower_Tapas_Axe_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001560, "Member 'UHighTower_Tapas_Axe_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

