#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HighTower_HoneyDew_LayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HighTower_HoneyDew_LayerAnimBP.HighTower_HoneyDew_LayerAnimBP_C
// 0x0780 (0x0B00 - 0x0380)
class UHighTower_HoneyDew_LayerAnimBP_C final : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0390(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x03C0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0448(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0478(0x0088)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0500(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x05E0(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x06A8(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0730(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x07F8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0820(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x08E8(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x09C8(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x09F8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A98(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0AC0(0x0030)()
	bool                                          IsJumping;                                         // 0x0AF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOnGround;                                        // 0x0AF1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsJumpLand;                                        // 0x0AF2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFalling;                                         // 0x0AF3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsNewFalling;                                      // 0x0AF4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTurning;                                        // 0x0AF5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF6[0x2];                                      // 0x0AF6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         YawDeltaSmoothed;                                  // 0x0AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawDeltaSlowDecay;                                 // 0x0AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HighTower_HoneyDew_LayerAnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void Update_Yaw_Delta(float YawDelta, float DeltaTime, float DecayRate);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void CustomLocomotionPreIKLayer(const struct FPoseLink& InPosePreIK, struct FPoseLink* CustomLocomotionPreIKLayer_0);
	void CustomLocomotionFullBodyLayer(const struct FPoseLink& PassThroughCustomFullBody, struct FPoseLink* CustomLocomotionFullBodyLayer_0);
	void CustomLocomotionFullBodyAdditive(const struct FPoseLink& InPoseFullBodyAdditive, struct FPoseLink* CustomLocomotionFullBodyAdditive_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HighTower_HoneyDew_LayerAnimBP_C">();
	}
	static class UHighTower_HoneyDew_LayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighTower_HoneyDew_LayerAnimBP_C>();
	}
};
static_assert(alignof(UHighTower_HoneyDew_LayerAnimBP_C) == 0x000010, "Wrong alignment on UHighTower_HoneyDew_LayerAnimBP_C");
static_assert(sizeof(UHighTower_HoneyDew_LayerAnimBP_C) == 0x000B00, "Wrong size on UHighTower_HoneyDew_LayerAnimBP_C");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, UberGraphFrame) == 0x000380, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000388, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_Root_3) == 0x000390, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x0003C0, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_Root_2) == 0x000448, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x000478, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000500, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_ApplyAdditive_1) == 0x0005E0, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x0006A8, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000730, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0007F8, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_ApplyAdditive) == 0x000820, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0008E8, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_Root_1) == 0x0009C8, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_BlendListByBool) == 0x0009F8, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_UseCachedPose) == 0x000A98, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, AnimGraphNode_Root) == 0x000AC0, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, IsJumping) == 0x000AF0, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::IsJumping' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, IsOnGround) == 0x000AF1, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::IsOnGround' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, IsJumpLand) == 0x000AF2, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::IsJumpLand' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, IsFalling) == 0x000AF3, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::IsFalling' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, IsNewFalling) == 0x000AF4, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::IsNewFalling' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, bIsTurning) == 0x000AF5, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::bIsTurning' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, YawDeltaSmoothed) == 0x000AF8, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::YawDeltaSmoothed' has a wrong offset!");
static_assert(offsetof(UHighTower_HoneyDew_LayerAnimBP_C, YawDeltaSlowDecay) == 0x000AFC, "Member 'UHighTower_HoneyDew_LayerAnimBP_C::YawDeltaSlowDecay' has a wrong offset!");

}

