#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoagieRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HoagieRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class HoagieRuntime.FortHoagieVehicle
// 0x03C0 (0x1BA0 - 0x17E0)
class AFortHoagieVehicle final : public AFortAthenaSKVehicle
{
public:
	class FName                                   PassengerCollision;                                // 0x17E0(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraBoomDistance;                                // 0x17E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraBoomHeight;                                  // 0x17EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EHoagieBoostState State)> OnBoostStateChanged;                     // 0x17F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnAltimeterTraceUpdated;                           // 0x1800(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCrashingStateEntered;                            // 0x1810(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         LiftRumbleTimer;                                   // 0x1820(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLiftUp;                                           // 0x1824(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1825[0x3];                                     // 0x1825(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        LiftForceFeedbackHandle;                           // 0x1828(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint64                                        PassiveForceFeedbackHandle;                        // 0x1830(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Theta_Native;                                      // 0x1838(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WashAltAlpha_Native;                               // 0x183C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RotorWashTickTimer;                                // 0x1840(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1844[0x4];                                     // 0x1844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        RotorTraceArray;                                   // 0x1848(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<EObjectTypeQuery>                      RotorWashObjectsTypes;                             // 0x1858(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoagieVehicleConfigs*              FortHoagieVehicleConfigs;                          // 0x1868(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FVehicleSpecificUIDetails>      CustomUI;                                          // 0x1870(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FVehicleSpecificUIDetails>      CustomFuelUI;                                      // 0x1880(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            RumbleIntensity;                                   // 0x1890(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FActiveVehicleUI>               ActiveUI;                                          // 0x1898(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortHeliFlightModel                   FlightModel;                                       // 0x18A8(0x0110)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bClearPitchInput;                                  // 0x19B8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBoosting;                                         // 0x19B9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19BA[0x2];                                     // 0x19BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoostTimeLeft;                                     // 0x19BC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostBrakingTimeLeft;                              // 0x19C0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostCooldown;                                     // 0x19C4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ShutdownTimer;                                     // 0x19C8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FoliageDestructionTimer;                           // 0x19CC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CrashingScrapingTimer;                             // 0x19D0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CrashingNotMovingTimer;                            // 0x19D4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanSleep;                                         // 0x19D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasAppliedCrashDamage;                            // 0x19D9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOrientedForLanding;                               // 0x19DA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceNegativeLift;                                // 0x19DB(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExploded;                                         // 0x19DC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19DD[0x3];                                     // 0x19DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AltimeterTraceTimer;                               // 0x19E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LastRotorImpulseTime;                              // 0x19E4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CriticalExplodeTimer;                              // 0x19E8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeWhileCritical;                                 // 0x19EC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeWhileLanding;                                  // 0x19F0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LiftFromOverrideButton;                            // 0x19F4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                BoostDirection;                                    // 0x19F8(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LastRotorSweepDirection;                           // 0x1A04(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FHitResult                             AltimeterTraceResult;                              // 0x1A10(0x008C)(Transient, IsPlainOldData, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                         HoagieStateRep;                                    // 0x1A9C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AA0[0x4];                                     // 0x1AA0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentRotorSpeed;                                 // 0x1AA4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentRotorAngle;                                 // 0x1AA8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RotorImpactTraceAngle;                             // 0x1AAC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveUpPressTime;                                   // 0x1AB0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveDownPressTime;                                 // 0x1AB4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ServerCriticalHealth;                              // 0x1AB8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1ABC[0x4];                                     // 0x1ABC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRotorHit>                      RotorHits;                                         // 0x1AC0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCachedSeatCollision>           CachedSeatCollision;                               // 0x1AD0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaVehicleFuelComponent*        FuelComponent;                                     // 0x1AE0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int8                                          IsUsingNewFuelSystemState;                         // 0x1AE8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AE9[0x7];                                     // 0x1AE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      HoagieIdleFX_Native;                               // 0x1AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      DamageFX_Native;                                   // 0x1AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      RotorWashFX_Native;                                // 0x1B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoagieVehicleAnimInstance*         HoagieAnimBP_Native;                               // 0x1B08(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortHoagieVehicleConfigs>  FortHoagieVehicleConfigsClass;                     // 0x1B10(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   AltimeterTraceSocketName;                          // 0x1B18(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   RotorDamageTraceSocketName;                        // 0x1B20(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MainRotorCritSocketName;                           // 0x1B28(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   TailRotorCritSocketName;                           // 0x1B30(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           SeatTransition_ToDriver;                           // 0x1B38(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           SeatTransition_ToPassenger;                        // 0x1B40(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   RotorTraceProfile;                                 // 0x1B48(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FoliageOverlapsBoxTag;                             // 0x1B50(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AController>             KillerController;                                  // 0x1B58(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AActor>                  KillerCauser;                                      // 0x1B60(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FReplicatedHeliControlState            ControlState;                                      // 0x1B68(0x0018)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         CurrentViewDistanceScale;                          // 0x1B80(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentHLODDistanceOverrideScale;                  // 0x1B84(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentHLODMaxDrawDistanceScale;                   // 0x1B88(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B8C[0x14];                                    // 0x1B8C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MulticastRotorImpulse(const struct FHitResult& RotorHit);
	void OnBoostFailed();
	void OnBoostFinished();
	void OnBoostReady();
	void OnBoostStarted();
	void OnCritRotor(float Damage, const struct FVector& ImpactLocation, class AController* DamageInstigator, class AActor* DamageCauser, bool bMainRotor);
	void OnExplode();
	void OnImpactOtherHoagie(const struct FVector& HitLocation, const struct FVector& NormalImpulse);
	void OnImpactWhileCritical();
	void OnRefueledFromEmpty();
	void OnRep_ControlState();
	void OnRep_HoagieState();
	void OnRep_IsUsingNewFuelSystemState();
	void OnRotorDamageDealt(const struct FHitResult& Impact, bool bInner);
	void OnRotorDamageDealtInner(const struct FHitResult& Impact);
	void OnRotorDamageDealtOuter(const struct FHitResult& Impact);
	void OnRotorDamagePlayer(const struct FHitResult& Impact);
	void OnRotorsStop();
	void OnStartCriticalHealth();
	void OnStartupBegin();
	void OnStartupEnd();
	void OnTickRotors(float RotorAngleDegrees);
	void ServerUpdateControlState(const struct FReplicatedHeliControlState& InControlState);
	void SetMainRotorRotation(float Degrees);
	void SetRotorWashActive(bool bActive);
	void SetTailRotorRotation(float Degrees);
	void UpdateDamageStateNative(float Damage);

	float GetAltitude() const;
	float GetBoostCooldown() const;
	struct FVector GetBoostDirection() const;
	float GetBoostDuration() const;
	float GetBoostTimeLeft() const;
	float GetDistanceToGround() const;
	float GetForwardAlpha() const;
	bool GetIsCriticalHealth() const;
	bool GetIsEngineOn() const;
	float GetLiftAlpha() const;
	float GetMaxAltitude() const;
	float GetMaxBoostCooldown() const;
	float GetRotorAngleDegrees() const;
	struct FVector GetRotorCenterPosition() const;
	float GetRotorSpeed() const;
	float GetRotorSpeedPercent() const;
	float GetShutdownTimeLeft() const;
	float GetSteerAlpha() const;
	float GetStrafeAlpha() const;
	struct FVector GetThrustDirection(bool bWorldSpace) const;
	float GetVerticalSpeedKmh() const;
	bool IsScrapingBottom() const;
	bool IsShuttingDown() const;
	bool IsStartingUp() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHoagieVehicle">();
	}
	static class AFortHoagieVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortHoagieVehicle>();
	}
};
static_assert(alignof(AFortHoagieVehicle) == 0x000010, "Wrong alignment on AFortHoagieVehicle");
static_assert(sizeof(AFortHoagieVehicle) == 0x001BA0, "Wrong size on AFortHoagieVehicle");
static_assert(offsetof(AFortHoagieVehicle, PassengerCollision) == 0x0017E0, "Member 'AFortHoagieVehicle::PassengerCollision' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CameraBoomDistance) == 0x0017E8, "Member 'AFortHoagieVehicle::CameraBoomDistance' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CameraBoomHeight) == 0x0017EC, "Member 'AFortHoagieVehicle::CameraBoomHeight' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, OnBoostStateChanged) == 0x0017F0, "Member 'AFortHoagieVehicle::OnBoostStateChanged' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, OnAltimeterTraceUpdated) == 0x001800, "Member 'AFortHoagieVehicle::OnAltimeterTraceUpdated' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, OnCrashingStateEntered) == 0x001810, "Member 'AFortHoagieVehicle::OnCrashingStateEntered' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, LiftRumbleTimer) == 0x001820, "Member 'AFortHoagieVehicle::LiftRumbleTimer' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, bLiftUp) == 0x001824, "Member 'AFortHoagieVehicle::bLiftUp' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, LiftForceFeedbackHandle) == 0x001828, "Member 'AFortHoagieVehicle::LiftForceFeedbackHandle' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, PassiveForceFeedbackHandle) == 0x001830, "Member 'AFortHoagieVehicle::PassiveForceFeedbackHandle' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, Theta_Native) == 0x001838, "Member 'AFortHoagieVehicle::Theta_Native' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, WashAltAlpha_Native) == 0x00183C, "Member 'AFortHoagieVehicle::WashAltAlpha_Native' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, RotorWashTickTimer) == 0x001840, "Member 'AFortHoagieVehicle::RotorWashTickTimer' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, RotorTraceArray) == 0x001848, "Member 'AFortHoagieVehicle::RotorTraceArray' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, RotorWashObjectsTypes) == 0x001858, "Member 'AFortHoagieVehicle::RotorWashObjectsTypes' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, FortHoagieVehicleConfigs) == 0x001868, "Member 'AFortHoagieVehicle::FortHoagieVehicleConfigs' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CustomUI) == 0x001870, "Member 'AFortHoagieVehicle::CustomUI' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CustomFuelUI) == 0x001880, "Member 'AFortHoagieVehicle::CustomFuelUI' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, RumbleIntensity) == 0x001890, "Member 'AFortHoagieVehicle::RumbleIntensity' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, ActiveUI) == 0x001898, "Member 'AFortHoagieVehicle::ActiveUI' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, FlightModel) == 0x0018A8, "Member 'AFortHoagieVehicle::FlightModel' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, bClearPitchInput) == 0x0019B8, "Member 'AFortHoagieVehicle::bClearPitchInput' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, bBoosting) == 0x0019B9, "Member 'AFortHoagieVehicle::bBoosting' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, BoostTimeLeft) == 0x0019BC, "Member 'AFortHoagieVehicle::BoostTimeLeft' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, BoostBrakingTimeLeft) == 0x0019C0, "Member 'AFortHoagieVehicle::BoostBrakingTimeLeft' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, BoostCooldown) == 0x0019C4, "Member 'AFortHoagieVehicle::BoostCooldown' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, ShutdownTimer) == 0x0019C8, "Member 'AFortHoagieVehicle::ShutdownTimer' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, FoliageDestructionTimer) == 0x0019CC, "Member 'AFortHoagieVehicle::FoliageDestructionTimer' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CrashingScrapingTimer) == 0x0019D0, "Member 'AFortHoagieVehicle::CrashingScrapingTimer' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CrashingNotMovingTimer) == 0x0019D4, "Member 'AFortHoagieVehicle::CrashingNotMovingTimer' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, bCanSleep) == 0x0019D8, "Member 'AFortHoagieVehicle::bCanSleep' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, bHasAppliedCrashDamage) == 0x0019D9, "Member 'AFortHoagieVehicle::bHasAppliedCrashDamage' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, bOrientedForLanding) == 0x0019DA, "Member 'AFortHoagieVehicle::bOrientedForLanding' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, bForceNegativeLift) == 0x0019DB, "Member 'AFortHoagieVehicle::bForceNegativeLift' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, bExploded) == 0x0019DC, "Member 'AFortHoagieVehicle::bExploded' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, AltimeterTraceTimer) == 0x0019E0, "Member 'AFortHoagieVehicle::AltimeterTraceTimer' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, LastRotorImpulseTime) == 0x0019E4, "Member 'AFortHoagieVehicle::LastRotorImpulseTime' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CriticalExplodeTimer) == 0x0019E8, "Member 'AFortHoagieVehicle::CriticalExplodeTimer' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, TimeWhileCritical) == 0x0019EC, "Member 'AFortHoagieVehicle::TimeWhileCritical' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, TimeWhileLanding) == 0x0019F0, "Member 'AFortHoagieVehicle::TimeWhileLanding' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, LiftFromOverrideButton) == 0x0019F4, "Member 'AFortHoagieVehicle::LiftFromOverrideButton' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, BoostDirection) == 0x0019F8, "Member 'AFortHoagieVehicle::BoostDirection' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, LastRotorSweepDirection) == 0x001A04, "Member 'AFortHoagieVehicle::LastRotorSweepDirection' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, AltimeterTraceResult) == 0x001A10, "Member 'AFortHoagieVehicle::AltimeterTraceResult' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, HoagieStateRep) == 0x001A9C, "Member 'AFortHoagieVehicle::HoagieStateRep' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CurrentRotorSpeed) == 0x001AA4, "Member 'AFortHoagieVehicle::CurrentRotorSpeed' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CurrentRotorAngle) == 0x001AA8, "Member 'AFortHoagieVehicle::CurrentRotorAngle' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, RotorImpactTraceAngle) == 0x001AAC, "Member 'AFortHoagieVehicle::RotorImpactTraceAngle' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, MoveUpPressTime) == 0x001AB0, "Member 'AFortHoagieVehicle::MoveUpPressTime' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, MoveDownPressTime) == 0x001AB4, "Member 'AFortHoagieVehicle::MoveDownPressTime' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, ServerCriticalHealth) == 0x001AB8, "Member 'AFortHoagieVehicle::ServerCriticalHealth' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, RotorHits) == 0x001AC0, "Member 'AFortHoagieVehicle::RotorHits' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CachedSeatCollision) == 0x001AD0, "Member 'AFortHoagieVehicle::CachedSeatCollision' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, FuelComponent) == 0x001AE0, "Member 'AFortHoagieVehicle::FuelComponent' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, IsUsingNewFuelSystemState) == 0x001AE8, "Member 'AFortHoagieVehicle::IsUsingNewFuelSystemState' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, HoagieIdleFX_Native) == 0x001AF0, "Member 'AFortHoagieVehicle::HoagieIdleFX_Native' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, DamageFX_Native) == 0x001AF8, "Member 'AFortHoagieVehicle::DamageFX_Native' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, RotorWashFX_Native) == 0x001B00, "Member 'AFortHoagieVehicle::RotorWashFX_Native' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, HoagieAnimBP_Native) == 0x001B08, "Member 'AFortHoagieVehicle::HoagieAnimBP_Native' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, FortHoagieVehicleConfigsClass) == 0x001B10, "Member 'AFortHoagieVehicle::FortHoagieVehicleConfigsClass' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, AltimeterTraceSocketName) == 0x001B18, "Member 'AFortHoagieVehicle::AltimeterTraceSocketName' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, RotorDamageTraceSocketName) == 0x001B20, "Member 'AFortHoagieVehicle::RotorDamageTraceSocketName' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, MainRotorCritSocketName) == 0x001B28, "Member 'AFortHoagieVehicle::MainRotorCritSocketName' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, TailRotorCritSocketName) == 0x001B30, "Member 'AFortHoagieVehicle::TailRotorCritSocketName' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, SeatTransition_ToDriver) == 0x001B38, "Member 'AFortHoagieVehicle::SeatTransition_ToDriver' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, SeatTransition_ToPassenger) == 0x001B40, "Member 'AFortHoagieVehicle::SeatTransition_ToPassenger' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, RotorTraceProfile) == 0x001B48, "Member 'AFortHoagieVehicle::RotorTraceProfile' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, FoliageOverlapsBoxTag) == 0x001B50, "Member 'AFortHoagieVehicle::FoliageOverlapsBoxTag' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, KillerController) == 0x001B58, "Member 'AFortHoagieVehicle::KillerController' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, KillerCauser) == 0x001B60, "Member 'AFortHoagieVehicle::KillerCauser' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, ControlState) == 0x001B68, "Member 'AFortHoagieVehicle::ControlState' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CurrentViewDistanceScale) == 0x001B80, "Member 'AFortHoagieVehicle::CurrentViewDistanceScale' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CurrentHLODDistanceOverrideScale) == 0x001B84, "Member 'AFortHoagieVehicle::CurrentHLODDistanceOverrideScale' has a wrong offset!");
static_assert(offsetof(AFortHoagieVehicle, CurrentHLODMaxDrawDistanceScale) == 0x001B88, "Member 'AFortHoagieVehicle::CurrentHLODMaxDrawDistanceScale' has a wrong offset!");

// Class HoagieRuntime.FortCameraMode_Hoagie
// 0x0040 (0x0E10 - 0x0DD0)
class UFortCameraMode_Hoagie final : public UFortCameraMode_AthenaVehicle
{
public:
	float                                         CurrentRollMultiplier;                             // 0x0DC8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentPitchMultiplier;                            // 0x0DCC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LastOrigin;                                        // 0x0DD0(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CurrentInterpSpeed;                                // 0x0DDC(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                BoostInterpSpeed;                                  // 0x0DE8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BaseRollMultiplier;                                // 0x0DF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BasePitchMultiplier;                               // 0x0DF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostRollMultiplier;                               // 0x0DFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostPitchMultiplier;                              // 0x0E00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostRollDampFactor;                               // 0x0E04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostRollRecoveryDampFactor;                       // 0x0E08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostRecoveryInterpSpeed;                          // 0x0E0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraMode_Hoagie">();
	}
	static class UFortCameraMode_Hoagie* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraMode_Hoagie>();
	}
};
static_assert(alignof(UFortCameraMode_Hoagie) == 0x000010, "Wrong alignment on UFortCameraMode_Hoagie");
static_assert(sizeof(UFortCameraMode_Hoagie) == 0x000E10, "Wrong size on UFortCameraMode_Hoagie");
static_assert(offsetof(UFortCameraMode_Hoagie, CurrentRollMultiplier) == 0x000DC8, "Member 'UFortCameraMode_Hoagie::CurrentRollMultiplier' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, CurrentPitchMultiplier) == 0x000DCC, "Member 'UFortCameraMode_Hoagie::CurrentPitchMultiplier' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, LastOrigin) == 0x000DD0, "Member 'UFortCameraMode_Hoagie::LastOrigin' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, CurrentInterpSpeed) == 0x000DDC, "Member 'UFortCameraMode_Hoagie::CurrentInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, BoostInterpSpeed) == 0x000DE8, "Member 'UFortCameraMode_Hoagie::BoostInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, BaseRollMultiplier) == 0x000DF4, "Member 'UFortCameraMode_Hoagie::BaseRollMultiplier' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, BasePitchMultiplier) == 0x000DF8, "Member 'UFortCameraMode_Hoagie::BasePitchMultiplier' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, BoostRollMultiplier) == 0x000DFC, "Member 'UFortCameraMode_Hoagie::BoostRollMultiplier' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, BoostPitchMultiplier) == 0x000E00, "Member 'UFortCameraMode_Hoagie::BoostPitchMultiplier' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, BoostRollDampFactor) == 0x000E04, "Member 'UFortCameraMode_Hoagie::BoostRollDampFactor' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, BoostRollRecoveryDampFactor) == 0x000E08, "Member 'UFortCameraMode_Hoagie::BoostRollRecoveryDampFactor' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Hoagie, BoostRecoveryInterpSpeed) == 0x000E0C, "Member 'UFortCameraMode_Hoagie::BoostRecoveryInterpSpeed' has a wrong offset!");

// Class HoagieRuntime.FortHoagieAudioController
// 0x0050 (0x0270 - 0x0220)
class AFortHoagieAudioController final : public AActor
{
public:
	bool                                          bHighQualityOverride;                              // 0x0220(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLocalPlayerInHoagie;                              // 0x0221(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCriticalDamageNative;                             // 0x0222(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRotorHitNative;                                   // 0x0223(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsRotorWashActiveNative;                          // 0x0224(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotorWashRelativeZOffset;                          // 0x0228(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortHoagieVehicle>      Vehicle;                                           // 0x022C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLayeredAudioComponent*             EngineAudio;                                       // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLayeredAudioComponent*             RotorAudio;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_248[0x28];                                     // 0x0248(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CacheAudioComponents(class UFortLayeredAudioComponent* InEngine, class UFortLayeredAudioComponent* InRotor);
	void CacheHoagieVehicle(class AFortHoagieVehicle* InVehicle);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHoagieAudioController">();
	}
	static class AFortHoagieAudioController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortHoagieAudioController>();
	}
};
static_assert(alignof(AFortHoagieAudioController) == 0x000008, "Wrong alignment on AFortHoagieAudioController");
static_assert(sizeof(AFortHoagieAudioController) == 0x000270, "Wrong size on AFortHoagieAudioController");
static_assert(offsetof(AFortHoagieAudioController, bHighQualityOverride) == 0x000220, "Member 'AFortHoagieAudioController::bHighQualityOverride' has a wrong offset!");
static_assert(offsetof(AFortHoagieAudioController, bLocalPlayerInHoagie) == 0x000221, "Member 'AFortHoagieAudioController::bLocalPlayerInHoagie' has a wrong offset!");
static_assert(offsetof(AFortHoagieAudioController, bCriticalDamageNative) == 0x000222, "Member 'AFortHoagieAudioController::bCriticalDamageNative' has a wrong offset!");
static_assert(offsetof(AFortHoagieAudioController, bRotorHitNative) == 0x000223, "Member 'AFortHoagieAudioController::bRotorHitNative' has a wrong offset!");
static_assert(offsetof(AFortHoagieAudioController, bIsRotorWashActiveNative) == 0x000224, "Member 'AFortHoagieAudioController::bIsRotorWashActiveNative' has a wrong offset!");
static_assert(offsetof(AFortHoagieAudioController, RotorWashRelativeZOffset) == 0x000228, "Member 'AFortHoagieAudioController::RotorWashRelativeZOffset' has a wrong offset!");
static_assert(offsetof(AFortHoagieAudioController, Vehicle) == 0x00022C, "Member 'AFortHoagieAudioController::Vehicle' has a wrong offset!");
static_assert(offsetof(AFortHoagieAudioController, EngineAudio) == 0x000238, "Member 'AFortHoagieAudioController::EngineAudio' has a wrong offset!");
static_assert(offsetof(AFortHoagieAudioController, RotorAudio) == 0x000240, "Member 'AFortHoagieAudioController::RotorAudio' has a wrong offset!");

// Class HoagieRuntime.FortHoagieDriverAnimInstance
// 0x0050 (0x0650 - 0x0600)
class UFortHoagieDriverAnimInstance final : public UFortVehicleOccupantAnimInstance
{
public:
	struct FVector                                LeftHandIKPositionOffset;                          // 0x05F8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RightHandIKPositionOffset;                         // 0x0604(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LeftHandIKRotationOffset;                          // 0x0610(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               RightHandIKRotationOffset;                         // 0x061C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EFortCardinalDirection                        BoostCardinalDirection;                            // 0x0628(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NormalizedAcceleration;                            // 0x062C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleRoll;                                       // 0x0630(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleYaw;                                        // 0x0634(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardSpeed;                                      // 0x0638(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMovingAnyDirection;                             // 0x063C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMovingFastAnyDirection;                         // 0x063D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldReverse;                                    // 0x063E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldGoBackToIdle;                               // 0x063F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Default_ReverseStart;                  // 0x0640(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_BoostLoop_Reverse;                     // 0x0641(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_642[0xE];                                      // 0x0642(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHoagieDriverAnimInstance">();
	}
	static class UFortHoagieDriverAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHoagieDriverAnimInstance>();
	}
};
static_assert(alignof(UFortHoagieDriverAnimInstance) == 0x000010, "Wrong alignment on UFortHoagieDriverAnimInstance");
static_assert(sizeof(UFortHoagieDriverAnimInstance) == 0x000650, "Wrong size on UFortHoagieDriverAnimInstance");
static_assert(offsetof(UFortHoagieDriverAnimInstance, LeftHandIKPositionOffset) == 0x0005F8, "Member 'UFortHoagieDriverAnimInstance::LeftHandIKPositionOffset' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, RightHandIKPositionOffset) == 0x000604, "Member 'UFortHoagieDriverAnimInstance::RightHandIKPositionOffset' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, LeftHandIKRotationOffset) == 0x000610, "Member 'UFortHoagieDriverAnimInstance::LeftHandIKRotationOffset' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, RightHandIKRotationOffset) == 0x00061C, "Member 'UFortHoagieDriverAnimInstance::RightHandIKRotationOffset' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, BoostCardinalDirection) == 0x000628, "Member 'UFortHoagieDriverAnimInstance::BoostCardinalDirection' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, NormalizedAcceleration) == 0x00062C, "Member 'UFortHoagieDriverAnimInstance::NormalizedAcceleration' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, VehicleRoll) == 0x000630, "Member 'UFortHoagieDriverAnimInstance::VehicleRoll' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, VehicleYaw) == 0x000634, "Member 'UFortHoagieDriverAnimInstance::VehicleYaw' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, ForwardSpeed) == 0x000638, "Member 'UFortHoagieDriverAnimInstance::ForwardSpeed' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, bIsMovingAnyDirection) == 0x00063C, "Member 'UFortHoagieDriverAnimInstance::bIsMovingAnyDirection' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, bIsMovingFastAnyDirection) == 0x00063D, "Member 'UFortHoagieDriverAnimInstance::bIsMovingFastAnyDirection' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, bShouldReverse) == 0x00063E, "Member 'UFortHoagieDriverAnimInstance::bShouldReverse' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, bShouldGoBackToIdle) == 0x00063F, "Member 'UFortHoagieDriverAnimInstance::bShouldGoBackToIdle' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, bTransition_Default_ReverseStart) == 0x000640, "Member 'UFortHoagieDriverAnimInstance::bTransition_Default_ReverseStart' has a wrong offset!");
static_assert(offsetof(UFortHoagieDriverAnimInstance, bTransition_BoostLoop_Reverse) == 0x000641, "Member 'UFortHoagieDriverAnimInstance::bTransition_BoostLoop_Reverse' has a wrong offset!");

// Class HoagieRuntime.FortHoagieVehicleAnimInstance
// 0x0130 (0x0500 - 0x03D0)
class UFortHoagieVehicleAnimInstance final : public UFortVehicleAnimInstance
{
public:
	uint8                                         Pad_3D0[0xA0];                                     // 0x03D0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               EngineRotation;                                    // 0x0470(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               MainRotorRotation;                                 // 0x047C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               TailRotorRotaton;                                  // 0x0488(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               BoosterFanRotation;                                // 0x0494(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EFortCardinalDirection                        BoostCardinalDirection;                            // 0x04A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1[0x1B];                                     // 0x04A1(0x001B)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EngineRotationInterpSpeed;                         // 0x04BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EngineRotationDuringBoostInterpSpeed;              // 0x04C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EngineFlipSpeedThreshold;                          // 0x04C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostDirectionDeadzone;                            // 0x04C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EngineFlipDeadzone;                                // 0x04CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DriverRoll;                                        // 0x04D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DriverYaw;                                         // 0x04D4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalSpeed;                                     // 0x04D8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FwdSpeed;                                          // 0x04DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalBoostDirection;                               // 0x04E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawBlendSpaceInput;                                // 0x04E4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalizedAcceleration;                            // 0x04E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4EC[0x1];                                      // 0x04EC(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShouldHideBlades;                                 // 0x04ED(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoostOnCD;                                      // 0x04EE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoostReady;                                     // 0x04EF(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMovingForward;                                  // 0x04F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReversing;                                      // 0x04F1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMovingAnyDirection;                             // 0x04F2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoosting;                                       // 0x04F3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldReverse;                                    // 0x04F4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldGoBackToIdle;                               // 0x04F5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldApplyBoostAdditive;                         // 0x04F6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEngineShuttingOff;                              // 0x04F7(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Default_ReverseStart;                  // 0x04F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_BoostLoop_Reverse;                     // 0x04F9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4FA[0x6];                                      // 0x04FA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHoagieVehicleAnimInstance">();
	}
	static class UFortHoagieVehicleAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHoagieVehicleAnimInstance>();
	}
};
static_assert(alignof(UFortHoagieVehicleAnimInstance) == 0x000010, "Wrong alignment on UFortHoagieVehicleAnimInstance");
static_assert(sizeof(UFortHoagieVehicleAnimInstance) == 0x000500, "Wrong size on UFortHoagieVehicleAnimInstance");
