#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hotfix_Container_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Hotfix_Container_Parent.Hotfix_Container_Parent_C
// 0x0070 (0x0D98 - 0x0D28)
class AHotfix_Container_Parent_C : public ABuildingContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_ActorEnabled;                                  // 0x0D30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_InteractEnabled;                               // 0x0D50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        FX_Open;                                           // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FX_OpenOffsetLocation;                             // 0x0D78(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FX_OpenPitchOffset;                                // 0x0D84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Open;                                        // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableLootOnDisableInteract;                      // 0x0D90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnReady_8BE6ADB6479A5EF3145F32B245E584C6(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void ReceiveBeginPlay();
	void OnLoot();
	void ExecuteUbergraph_Hotfix_Container_Parent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Hotfix_Container_Parent_C">();
	}
	static class AHotfix_Container_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHotfix_Container_Parent_C>();
	}
};
static_assert(alignof(AHotfix_Container_Parent_C) == 0x000008, "Wrong alignment on AHotfix_Container_Parent_C");
static_assert(sizeof(AHotfix_Container_Parent_C) == 0x000D98, "Wrong size on AHotfix_Container_Parent_C");
static_assert(offsetof(AHotfix_Container_Parent_C, UberGraphFrame) == 0x000D28, "Member 'AHotfix_Container_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHotfix_Container_Parent_C, Row_ActorEnabled) == 0x000D30, "Member 'AHotfix_Container_Parent_C::Row_ActorEnabled' has a wrong offset!");
static_assert(offsetof(AHotfix_Container_Parent_C, Row_InteractEnabled) == 0x000D50, "Member 'AHotfix_Container_Parent_C::Row_InteractEnabled' has a wrong offset!");
static_assert(offsetof(AHotfix_Container_Parent_C, FX_Open) == 0x000D70, "Member 'AHotfix_Container_Parent_C::FX_Open' has a wrong offset!");
static_assert(offsetof(AHotfix_Container_Parent_C, FX_OpenOffsetLocation) == 0x000D78, "Member 'AHotfix_Container_Parent_C::FX_OpenOffsetLocation' has a wrong offset!");
static_assert(offsetof(AHotfix_Container_Parent_C, FX_OpenPitchOffset) == 0x000D84, "Member 'AHotfix_Container_Parent_C::FX_OpenPitchOffset' has a wrong offset!");
static_assert(offsetof(AHotfix_Container_Parent_C, Sound_Open) == 0x000D88, "Member 'AHotfix_Container_Parent_C::Sound_Open' has a wrong offset!");
static_assert(offsetof(AHotfix_Container_Parent_C, DisableLootOnDisableInteract) == 0x000D90, "Member 'AHotfix_Container_Parent_C::DisableLootOnDisableInteract' has a wrong offset!");

}

