#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_AbilityInteractionContext

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD_AbilityInteractionContext.HUD_AbilityInteractionContext_C
// 0x01A0 (0x0400 - 0x0260)
class UHUD_AbilityInteractionContext_C : public UFortInteractContextInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_TooltipBG;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Secondary;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Subtitle;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Title;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortInteractContextInfo*               CurrentInteraction;                                // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BG_MID;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UMaterialInstance*> StringTagMap;                                      // 0x02A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ShortDescription;                                  // 0x02F8(0x0018)(Edit, BlueprintVisible)
	class FText                                   AdditionalInfo;                                    // 0x0310(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture2D>              TooltipTexture;                                    // 0x0328(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FGameplayTag                           GameplayTag;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    AttachedAbility;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, class UMaterialInstance*> GameplayTagMap;                              // 0x0360(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TMap<struct FGameplayTag, class FString>      GameplayTagRichText;                               // 0x03B0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void ExecuteUbergraph_HUD_AbilityInteractionContext(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnContextInfoUpdated(const class UFortInteractContextInfo* ContextInfo);
	void GetInteractText(class FText* InteractText, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_AbilityInteractionContext_C">();
	}
	static class UHUD_AbilityInteractionContext_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_AbilityInteractionContext_C>();
	}
};
static_assert(alignof(UHUD_AbilityInteractionContext_C) == 0x000008, "Wrong alignment on UHUD_AbilityInteractionContext_C");
static_assert(sizeof(UHUD_AbilityInteractionContext_C) == 0x000400, "Wrong size on UHUD_AbilityInteractionContext_C");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, UberGraphFrame) == 0x000260, "Member 'UHUD_AbilityInteractionContext_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, Image_BG) == 0x000268, "Member 'UHUD_AbilityInteractionContext_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, Image_Shadow) == 0x000270, "Member 'UHUD_AbilityInteractionContext_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, Image_TooltipBG) == 0x000278, "Member 'UHUD_AbilityInteractionContext_C::Image_TooltipBG' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, RichText_Secondary) == 0x000280, "Member 'UHUD_AbilityInteractionContext_C::RichText_Secondary' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, RichText_Subtitle) == 0x000288, "Member 'UHUD_AbilityInteractionContext_C::RichText_Subtitle' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, RichText_Title) == 0x000290, "Member 'UHUD_AbilityInteractionContext_C::RichText_Title' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, CurrentInteraction) == 0x000298, "Member 'UHUD_AbilityInteractionContext_C::CurrentInteraction' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, BG_MID) == 0x0002A0, "Member 'UHUD_AbilityInteractionContext_C::BG_MID' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, StringTagMap) == 0x0002A8, "Member 'UHUD_AbilityInteractionContext_C::StringTagMap' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, ShortDescription) == 0x0002F8, "Member 'UHUD_AbilityInteractionContext_C::ShortDescription' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, AdditionalInfo) == 0x000310, "Member 'UHUD_AbilityInteractionContext_C::AdditionalInfo' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, TooltipTexture) == 0x000328, "Member 'UHUD_AbilityInteractionContext_C::TooltipTexture' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, GameplayTag) == 0x000350, "Member 'UHUD_AbilityInteractionContext_C::GameplayTag' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, AttachedAbility) == 0x000358, "Member 'UHUD_AbilityInteractionContext_C::AttachedAbility' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, GameplayTagMap) == 0x000360, "Member 'UHUD_AbilityInteractionContext_C::GameplayTagMap' has a wrong offset!");
static_assert(offsetof(UHUD_AbilityInteractionContext_C, GameplayTagRichText) == 0x0003B0, "Member 'UHUD_AbilityInteractionContext_C::GameplayTagRichText' has a wrong offset!");

}

