#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HydrogenRuntime

#include "Basic.hpp"

#include "HydrogenRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class HydrogenRuntime.FortAthenaMutator_Hydrogen
// 0x0498 (0x0818 - 0x0380)
class AFortAthenaMutator_Hydrogen final : public AFortAthenaMutator_GameModeBase
{
public:
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bInitialized;                                      // 0x0388(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWinnerDeclared;                                   // 0x0389(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         VictoryPointImbalanceRespawnTimeMultiplier;        // 0x0390(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighVictoryPointImbalanceRespawnTimeMultiplier;    // 0x03B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinRespawnTime;                                    // 0x03D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FTeamPointsEntry>               HydrogenTeamPoints;                                // 0x03F0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnHydrogenTeamPointsChanged;                       // 0x0400(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         WinningTeam;                                       // 0x0410(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WinningScore;                                      // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AHydrogenObjectiveActor*>        CapturePointActors;                                // 0x0418(0x0010)(Net, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         NonCapturePointActorsForPath;                      // 0x0428(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SafeZoneRadius;                                    // 0x0438(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AircraftOffsetFromRadius;                          // 0x0458(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bShouldDropSupplyDropsBetweenCurrentAndNextSafeZones; // 0x0478(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SupplyDropPercentDistanceToNextPathLocation;       // 0x0498(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SupplyDropPercentSafeZoneRadius;                   // 0x04B8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UMaterialParameterCollection*           MinimapMaterialParameterCollection;                // 0x04D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinRespawnHeightAboveGround;                       // 0x04E0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   DefaultRespawnLabelText;                           // 0x0500(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UTexture2D*                             DefaultRespawnTexture;                             // 0x0518(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DefaultRespawnDisplayPriority;                     // 0x0520(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     DefaultRespawnCameraActorClass;                    // 0x0528(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_530[0x10];                                     // 0x0530(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         HydrogenCapturePointsPathsIndex;                   // 0x0540(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FHydrogenPathNames>             HydrogenCapturePointsPaths;                        // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HydrogenCapturePointsPathSpeedToNextNode;          // 0x0570(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                         TickHydrogenStormShield_TimeBetweenTicks;          // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HydrogenCompassIconOverlap;                        // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStormActive;                                      // 0x0598(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SecondsTilStormActivation;                         // 0x059C(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A0[0x28];                                     // 0x05A0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bAllowCheckWinnerWithOneTeamLeft;                  // 0x05C8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ObjectiveAccoladeTag;                              // 0x05E8(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           EOMBonusAccoladeTag;                               // 0x05F0(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bOnlyCapturePointsInsideSafeZoneCount;             // 0x05F8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAwardVictoryPointsWhenFullyCaptured;              // 0x0618(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BonusVictoryPointsAwardedForCapturingPoint;        // 0x0638(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BonusVictoryPointsAwardedForLockedCapturedPoint;   // 0x0658(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                         HydrogenVictoryPointCheckTime;                     // 0x0678(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         HydrogenVictoryPointGoal;                          // 0x0680(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HydrogenCloseToVictoryPointGoal;                   // 0x06A0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                         HydrogenTotalTimeForOneCapturePoint;               // 0x06C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         HydrogenMaxCapturePoints;                          // 0x06C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HydrogenTotalTimeForMaxCapturePoints;              // 0x06C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         HydrogenVictoryPointIncreaseReducedRate;           // 0x06D0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HydrogenVictoryPointIncrease;                      // 0x06F0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HydrogenVictoryPointRateIncreasePerPoint;          // 0x0710(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                         HydrogenVictoryPointCheckTimePassed;               // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_734[0xC];                                      // 0x0734(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SafeZoneCameraActor;                               // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_748[0x4];                                      // 0x0748(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HydrogenCapturePointsPathsIndexToUse;              // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StormHeadingYawReplicated;                         // 0x0750(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PathGameplayTagToUse;                              // 0x0754(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnInitialized;                                     // 0x0760(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(uint8 TheWinningTeam)> OnWinningTeamDeclared;                      // 0x0770(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InventoryItemTagsToCount;                          // 0x0780(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                 MatchEndAnalyticsEventName;                        // 0x07A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EarlyExitAnalyticsEventName;                       // 0x07B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C0[0x58];                                     // 0x07C0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateTheStormShield();
	void AddBonusVictoryPointsForLockedCapturePoints(uint8 InTeam);
	void CheckVictoryPoints(float TimePassed);
	void EndGame(uint8 Winner);
	struct FVector GetActorOnPathLocation(int32 InPathIndex);
	struct FVector GetNextActorOnPathLocation(int32 InPathIndex);
	int32 GetOwnedCapturePointCount(int32 InIndex);
	float GetTimeToNextNode();
	void GiveEOMBonusAccolade();
	void GiveObjectiveAccolade(class AFortPlayerControllerAthena* FortController);
	void GotoNextStormShieldNode();
	void OnGamePhaseStepChanged(const TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterfaceConst, EAthenaGamePhaseStep GamePhaseStep);
	void OnRep_HydrogenTeamPointsChanged();
	void OnRep_WinningTeam();
	void OwningTeamChange(class AHydrogenObjectiveActor* Objective, uint8 NewTeam, uint8 OldTeam);
	void PositionHydrogenStormShield();
	void SetupSafeZoneRoute(const struct FVector& StartVector, const struct FVector& EndVector);
	bool TickHydrogenStormShield(float DeltaSeconds);
	void UpdateCapturePointsCounted();

	bool bHasStormStarted() const;
	bool bHasWinnerBeenDeclared() const;
	const TArray<class AHydrogenObjectiveActor*> GetAllCapturePoints() const;
	void GetSortedActivePointIndices(TArray<int32>* OutSortedIndices) const;
	float GetStormSpeed() const;
	bool IsInStormShield(const struct FVector& TestLocation) const;
	void SetCapturePointFillAmount(class AHydrogenObjectiveActor* InCapturePointActor, uint8 InPlayerTeam) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Hydrogen">();
	}
	static class AFortAthenaMutator_Hydrogen* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Hydrogen>();
	}
};
static_assert(alignof(AFortAthenaMutator_Hydrogen) == 0x000008, "Wrong alignment on AFortAthenaMutator_Hydrogen");
static_assert(sizeof(AFortAthenaMutator_Hydrogen) == 0x000818, "Wrong size on AFortAthenaMutator_Hydrogen");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, bInitialized) == 0x000388, "Member 'AFortAthenaMutator_Hydrogen::bInitialized' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, bWinnerDeclared) == 0x000389, "Member 'AFortAthenaMutator_Hydrogen::bWinnerDeclared' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, VictoryPointImbalanceRespawnTimeMultiplier) == 0x000390, "Member 'AFortAthenaMutator_Hydrogen::VictoryPointImbalanceRespawnTimeMultiplier' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HighVictoryPointImbalanceRespawnTimeMultiplier) == 0x0003B0, "Member 'AFortAthenaMutator_Hydrogen::HighVictoryPointImbalanceRespawnTimeMultiplier' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, MinRespawnTime) == 0x0003D0, "Member 'AFortAthenaMutator_Hydrogen::MinRespawnTime' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenTeamPoints) == 0x0003F0, "Member 'AFortAthenaMutator_Hydrogen::HydrogenTeamPoints' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, OnHydrogenTeamPointsChanged) == 0x000400, "Member 'AFortAthenaMutator_Hydrogen::OnHydrogenTeamPointsChanged' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, WinningTeam) == 0x000410, "Member 'AFortAthenaMutator_Hydrogen::WinningTeam' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, WinningScore) == 0x000414, "Member 'AFortAthenaMutator_Hydrogen::WinningScore' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, CapturePointActors) == 0x000418, "Member 'AFortAthenaMutator_Hydrogen::CapturePointActors' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, NonCapturePointActorsForPath) == 0x000428, "Member 'AFortAthenaMutator_Hydrogen::NonCapturePointActorsForPath' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, SafeZoneRadius) == 0x000438, "Member 'AFortAthenaMutator_Hydrogen::SafeZoneRadius' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, AircraftOffsetFromRadius) == 0x000458, "Member 'AFortAthenaMutator_Hydrogen::AircraftOffsetFromRadius' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, bShouldDropSupplyDropsBetweenCurrentAndNextSafeZones) == 0x000478, "Member 'AFortAthenaMutator_Hydrogen::bShouldDropSupplyDropsBetweenCurrentAndNextSafeZones' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, SupplyDropPercentDistanceToNextPathLocation) == 0x000498, "Member 'AFortAthenaMutator_Hydrogen::SupplyDropPercentDistanceToNextPathLocation' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, SupplyDropPercentSafeZoneRadius) == 0x0004B8, "Member 'AFortAthenaMutator_Hydrogen::SupplyDropPercentSafeZoneRadius' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, MinimapMaterialParameterCollection) == 0x0004D8, "Member 'AFortAthenaMutator_Hydrogen::MinimapMaterialParameterCollection' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, MinRespawnHeightAboveGround) == 0x0004E0, "Member 'AFortAthenaMutator_Hydrogen::MinRespawnHeightAboveGround' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, DefaultRespawnLabelText) == 0x000500, "Member 'AFortAthenaMutator_Hydrogen::DefaultRespawnLabelText' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, DefaultRespawnTexture) == 0x000518, "Member 'AFortAthenaMutator_Hydrogen::DefaultRespawnTexture' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, DefaultRespawnDisplayPriority) == 0x000520, "Member 'AFortAthenaMutator_Hydrogen::DefaultRespawnDisplayPriority' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, DefaultRespawnCameraActorClass) == 0x000528, "Member 'AFortAthenaMutator_Hydrogen::DefaultRespawnCameraActorClass' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenCapturePointsPathsIndex) == 0x000540, "Member 'AFortAthenaMutator_Hydrogen::HydrogenCapturePointsPathsIndex' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenCapturePointsPaths) == 0x000560, "Member 'AFortAthenaMutator_Hydrogen::HydrogenCapturePointsPaths' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenCapturePointsPathSpeedToNextNode) == 0x000570, "Member 'AFortAthenaMutator_Hydrogen::HydrogenCapturePointsPathSpeedToNextNode' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, TickHydrogenStormShield_TimeBetweenTicks) == 0x000590, "Member 'AFortAthenaMutator_Hydrogen::TickHydrogenStormShield_TimeBetweenTicks' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenCompassIconOverlap) == 0x000594, "Member 'AFortAthenaMutator_Hydrogen::HydrogenCompassIconOverlap' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, bStormActive) == 0x000598, "Member 'AFortAthenaMutator_Hydrogen::bStormActive' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, SecondsTilStormActivation) == 0x00059C, "Member 'AFortAthenaMutator_Hydrogen::SecondsTilStormActivation' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, bAllowCheckWinnerWithOneTeamLeft) == 0x0005C8, "Member 'AFortAthenaMutator_Hydrogen::bAllowCheckWinnerWithOneTeamLeft' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, ObjectiveAccoladeTag) == 0x0005E8, "Member 'AFortAthenaMutator_Hydrogen::ObjectiveAccoladeTag' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, EOMBonusAccoladeTag) == 0x0005F0, "Member 'AFortAthenaMutator_Hydrogen::EOMBonusAccoladeTag' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, bOnlyCapturePointsInsideSafeZoneCount) == 0x0005F8, "Member 'AFortAthenaMutator_Hydrogen::bOnlyCapturePointsInsideSafeZoneCount' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, bAwardVictoryPointsWhenFullyCaptured) == 0x000618, "Member 'AFortAthenaMutator_Hydrogen::bAwardVictoryPointsWhenFullyCaptured' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, BonusVictoryPointsAwardedForCapturingPoint) == 0x000638, "Member 'AFortAthenaMutator_Hydrogen::BonusVictoryPointsAwardedForCapturingPoint' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, BonusVictoryPointsAwardedForLockedCapturedPoint) == 0x000658, "Member 'AFortAthenaMutator_Hydrogen::BonusVictoryPointsAwardedForLockedCapturedPoint' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenVictoryPointCheckTime) == 0x000678, "Member 'AFortAthenaMutator_Hydrogen::HydrogenVictoryPointCheckTime' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenVictoryPointGoal) == 0x000680, "Member 'AFortAthenaMutator_Hydrogen::HydrogenVictoryPointGoal' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenCloseToVictoryPointGoal) == 0x0006A0, "Member 'AFortAthenaMutator_Hydrogen::HydrogenCloseToVictoryPointGoal' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenTotalTimeForOneCapturePoint) == 0x0006C0, "Member 'AFortAthenaMutator_Hydrogen::HydrogenTotalTimeForOneCapturePoint' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenMaxCapturePoints) == 0x0006C4, "Member 'AFortAthenaMutator_Hydrogen::HydrogenMaxCapturePoints' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenTotalTimeForMaxCapturePoints) == 0x0006C8, "Member 'AFortAthenaMutator_Hydrogen::HydrogenTotalTimeForMaxCapturePoints' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenVictoryPointIncreaseReducedRate) == 0x0006D0, "Member 'AFortAthenaMutator_Hydrogen::HydrogenVictoryPointIncreaseReducedRate' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenVictoryPointIncrease) == 0x0006F0, "Member 'AFortAthenaMutator_Hydrogen::HydrogenVictoryPointIncrease' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenVictoryPointRateIncreasePerPoint) == 0x000710, "Member 'AFortAthenaMutator_Hydrogen::HydrogenVictoryPointRateIncreasePerPoint' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenVictoryPointCheckTimePassed) == 0x000730, "Member 'AFortAthenaMutator_Hydrogen::HydrogenVictoryPointCheckTimePassed' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, SafeZoneCameraActor) == 0x000740, "Member 'AFortAthenaMutator_Hydrogen::SafeZoneCameraActor' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, HydrogenCapturePointsPathsIndexToUse) == 0x00074C, "Member 'AFortAthenaMutator_Hydrogen::HydrogenCapturePointsPathsIndexToUse' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, StormHeadingYawReplicated) == 0x000750, "Member 'AFortAthenaMutator_Hydrogen::StormHeadingYawReplicated' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, PathGameplayTagToUse) == 0x000754, "Member 'AFortAthenaMutator_Hydrogen::PathGameplayTagToUse' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, OnInitialized) == 0x000760, "Member 'AFortAthenaMutator_Hydrogen::OnInitialized' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, OnWinningTeamDeclared) == 0x000770, "Member 'AFortAthenaMutator_Hydrogen::OnWinningTeamDeclared' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, InventoryItemTagsToCount) == 0x000780, "Member 'AFortAthenaMutator_Hydrogen::InventoryItemTagsToCount' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, MatchEndAnalyticsEventName) == 0x0007A0, "Member 'AFortAthenaMutator_Hydrogen::MatchEndAnalyticsEventName' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_Hydrogen, EarlyExitAnalyticsEventName) == 0x0007B0, "Member 'AFortAthenaMutator_Hydrogen::EarlyExitAnalyticsEventName' has a wrong offset!");

// Class HydrogenRuntime.HydrogenObjectiveActor
// 0x05A0 (0x0BC8 - 0x0628)
class AHydrogenObjectiveActor final : public ABuildingActor
{
public:
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 TeamsOnPoint;                                      // 0x0630(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CaptureProgress;                                   // 0x0640(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CapturingTeam;                                     // 0x0644(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         OwningTeam;                                        // 0x0645(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBeenCaptured;                                     // 0x0646(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_647[0x1];                                      // 0x0647(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bContested)> OnContestedChange;                               // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FTeamPlayerCountEntry>& TeamsOnCapturePoint)> OnTeamsOnPointChange; // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCapturePointChange;                              // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AHydrogenObjectiveActor* Objective, uint8 NewTeam, uint8 OldTeam)> OnOwningTeamChange; // 0x0678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStormIsNear;                                     // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         PreviousOwningTeam;                                // 0x0698(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHydrogenCaptureStateEnum                     HydrogenCaptureStateEnum;                          // 0x0699(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69A[0x2];                                      // 0x069A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfPlayersOnPoint;                            // 0x069C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfTeamsOnPoint;                              // 0x06A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTeamPlayerCountEntry>          TeamsOnCapturePoint;                               // 0x06A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CaptureProgressAdditionalPlayersMultiplier;        // 0x06B8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         AmountOfGainEveryLoop;                             // 0x06D8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CaptureProgressGoal;                               // 0x06F8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         MaxPlayerMultiplier;                               // 0x0718(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdateTime;                                        // 0x071C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnActivePointsChanged;                             // 0x0720(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PathGameplayTags;                                  // 0x0730(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FName                                   CaptureCollisionName;                              // 0x0750(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CapturePointLetter;                                // 0x0758(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Locked_MapIconBrush;                               // 0x0770(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                              LockedMinimapIconScale;                            // 0x07F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Contested_MapIconBrush;                            // 0x0800(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                              ContestedMinimapIconScale;                         // 0x0888(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ContestedIconLinearColor;                          // 0x0890(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ContestedLetterTextLinearColor;                    // 0x08A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EnemyCapturing_MapIconBrush;                       // 0x08B0(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AllyCapturing_MapIconBrush;                        // 0x0938(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EnemyCap_MapIconBrush;                             // 0x09C0(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AllyCap_MapIconBrush;                              // 0x0A48(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FName                                   FillAmountName;                                    // 0x0AD0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MiniMapIconScale;                                  // 0x0AD8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TextScale;                                         // 0x0AE0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CompassIconScale;                                  // 0x0AE4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CompassMaxPawnDistanceForScaling;                  // 0x0AEC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CompassYOffset;                                    // 0x0AF0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AF4[0x4];                                      // 0x0AF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         LetterFontInfo;                                    // 0x0AF8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               EnemyCapturing_DrawBrushMID;                       // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               AllyCapturing_DrawBrushMID;                        // 0x0B50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInStormShield;                                  // 0x0B58(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B59[0x17];                                     // 0x0B59(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     IconFlashTimeline;                                 // 0x0B70(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            IconFlashCurve;                                    // 0x0B78(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B80[0x10];                                     // 0x0B80(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckForStormTimerHandle;                          // 0x0B90(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CheckForStormRate;                                 // 0x0B98(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B9C[0x4];                                      // 0x0B9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   CachedGameState;                                   // 0x0BA0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaMutator_Hydrogen*            CachedMutator;                                     // 0x0BA8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsActive;                                         // 0x0BB0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BB1[0x7];                                      // 0x0BB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShapeComponent*                        CaptureCollisionComponent;                         // 0x0BB8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BC0[0x8];                                      // 0x0BC0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckForStorm();
	void FlashIcon();
	void OnComponentBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnMutatorAvailable();
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnRep_bIsActive();
	void OnRep_HydrogenCaptureStateEnum();
	void OnRep_OwningTeam();
	void OnRep_TeamsOnCapturePoint();
	void OnTimelineFlashing(float IconOpacity);
	void PlayContestedMapTimeline();
	void ProcessOverlap(class AActor* OtherActor);
	void SetActive(bool bInIsActive);
	void SetUpMaterialInstanceDynamic(struct FSlateBrush* MapIconBrush, class UMaterialInstanceDynamic** DrawBrushMID);
	void WaitForMutator();

	bool GetIsActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HydrogenObjectiveActor">();
	}
	static class AHydrogenObjectiveActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHydrogenObjectiveActor>();
	}
};
static_assert(alignof(AHydrogenObjectiveActor) == 0x000008, "Wrong alignment on AHydrogenObjectiveActor");
static_assert(sizeof(AHydrogenObjectiveActor) == 0x000BC8, "Wrong size on AHydrogenObjectiveActor");
static_assert(offsetof(AHydrogenObjectiveActor, TeamsOnPoint) == 0x000630, "Member 'AHydrogenObjectiveActor::TeamsOnPoint' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CaptureProgress) == 0x000640, "Member 'AHydrogenObjectiveActor::CaptureProgress' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CapturingTeam) == 0x000644, "Member 'AHydrogenObjectiveActor::CapturingTeam' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, OwningTeam) == 0x000645, "Member 'AHydrogenObjectiveActor::OwningTeam' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, bBeenCaptured) == 0x000646, "Member 'AHydrogenObjectiveActor::bBeenCaptured' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, OnContestedChange) == 0x000648, "Member 'AHydrogenObjectiveActor::OnContestedChange' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, OnTeamsOnPointChange) == 0x000658, "Member 'AHydrogenObjectiveActor::OnTeamsOnPointChange' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, OnCapturePointChange) == 0x000668, "Member 'AHydrogenObjectiveActor::OnCapturePointChange' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, OnOwningTeamChange) == 0x000678, "Member 'AHydrogenObjectiveActor::OnOwningTeamChange' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, OnStormIsNear) == 0x000688, "Member 'AHydrogenObjectiveActor::OnStormIsNear' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, PreviousOwningTeam) == 0x000698, "Member 'AHydrogenObjectiveActor::PreviousOwningTeam' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, HydrogenCaptureStateEnum) == 0x000699, "Member 'AHydrogenObjectiveActor::HydrogenCaptureStateEnum' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, NumberOfPlayersOnPoint) == 0x00069C, "Member 'AHydrogenObjectiveActor::NumberOfPlayersOnPoint' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, NumberOfTeamsOnPoint) == 0x0006A0, "Member 'AHydrogenObjectiveActor::NumberOfTeamsOnPoint' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, TeamsOnCapturePoint) == 0x0006A8, "Member 'AHydrogenObjectiveActor::TeamsOnCapturePoint' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CaptureProgressAdditionalPlayersMultiplier) == 0x0006B8, "Member 'AHydrogenObjectiveActor::CaptureProgressAdditionalPlayersMultiplier' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, AmountOfGainEveryLoop) == 0x0006D8, "Member 'AHydrogenObjectiveActor::AmountOfGainEveryLoop' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CaptureProgressGoal) == 0x0006F8, "Member 'AHydrogenObjectiveActor::CaptureProgressGoal' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, MaxPlayerMultiplier) == 0x000718, "Member 'AHydrogenObjectiveActor::MaxPlayerMultiplier' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, UpdateTime) == 0x00071C, "Member 'AHydrogenObjectiveActor::UpdateTime' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, OnActivePointsChanged) == 0x000720, "Member 'AHydrogenObjectiveActor::OnActivePointsChanged' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, PathGameplayTags) == 0x000730, "Member 'AHydrogenObjectiveActor::PathGameplayTags' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CaptureCollisionName) == 0x000750, "Member 'AHydrogenObjectiveActor::CaptureCollisionName' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CapturePointLetter) == 0x000758, "Member 'AHydrogenObjectiveActor::CapturePointLetter' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, Locked_MapIconBrush) == 0x000770, "Member 'AHydrogenObjectiveActor::Locked_MapIconBrush' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, LockedMinimapIconScale) == 0x0007F8, "Member 'AHydrogenObjectiveActor::LockedMinimapIconScale' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, Contested_MapIconBrush) == 0x000800, "Member 'AHydrogenObjectiveActor::Contested_MapIconBrush' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, ContestedMinimapIconScale) == 0x000888, "Member 'AHydrogenObjectiveActor::ContestedMinimapIconScale' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, ContestedIconLinearColor) == 0x000890, "Member 'AHydrogenObjectiveActor::ContestedIconLinearColor' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, ContestedLetterTextLinearColor) == 0x0008A0, "Member 'AHydrogenObjectiveActor::ContestedLetterTextLinearColor' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, EnemyCapturing_MapIconBrush) == 0x0008B0, "Member 'AHydrogenObjectiveActor::EnemyCapturing_MapIconBrush' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, AllyCapturing_MapIconBrush) == 0x000938, "Member 'AHydrogenObjectiveActor::AllyCapturing_MapIconBrush' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, EnemyCap_MapIconBrush) == 0x0009C0, "Member 'AHydrogenObjectiveActor::EnemyCap_MapIconBrush' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, AllyCap_MapIconBrush) == 0x000A48, "Member 'AHydrogenObjectiveActor::AllyCap_MapIconBrush' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, FillAmountName) == 0x000AD0, "Member 'AHydrogenObjectiveActor::FillAmountName' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, MiniMapIconScale) == 0x000AD8, "Member 'AHydrogenObjectiveActor::MiniMapIconScale' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, TextScale) == 0x000AE0, "Member 'AHydrogenObjectiveActor::TextScale' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CompassIconScale) == 0x000AE4, "Member 'AHydrogenObjectiveActor::CompassIconScale' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CompassMaxPawnDistanceForScaling) == 0x000AEC, "Member 'AHydrogenObjectiveActor::CompassMaxPawnDistanceForScaling' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CompassYOffset) == 0x000AF0, "Member 'AHydrogenObjectiveActor::CompassYOffset' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, LetterFontInfo) == 0x000AF8, "Member 'AHydrogenObjectiveActor::LetterFontInfo' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, EnemyCapturing_DrawBrushMID) == 0x000B48, "Member 'AHydrogenObjectiveActor::EnemyCapturing_DrawBrushMID' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, AllyCapturing_DrawBrushMID) == 0x000B50, "Member 'AHydrogenObjectiveActor::AllyCapturing_DrawBrushMID' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, bIsInStormShield) == 0x000B58, "Member 'AHydrogenObjectiveActor::bIsInStormShield' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, IconFlashTimeline) == 0x000B70, "Member 'AHydrogenObjectiveActor::IconFlashTimeline' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, IconFlashCurve) == 0x000B78, "Member 'AHydrogenObjectiveActor::IconFlashCurve' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CheckForStormTimerHandle) == 0x000B90, "Member 'AHydrogenObjectiveActor::CheckForStormTimerHandle' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CheckForStormRate) == 0x000B98, "Member 'AHydrogenObjectiveActor::CheckForStormRate' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CachedGameState) == 0x000BA0, "Member 'AHydrogenObjectiveActor::CachedGameState' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CachedMutator) == 0x000BA8, "Member 'AHydrogenObjectiveActor::CachedMutator' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, bIsActive) == 0x000BB0, "Member 'AHydrogenObjectiveActor::bIsActive' has a wrong offset!");
static_assert(offsetof(AHydrogenObjectiveActor, CaptureCollisionComponent) == 0x000BB8, "Member 'AHydrogenObjectiveActor::CaptureCollisionComponent' has a wrong offset!");

// Class HydrogenRuntime.HydrogenPathActor
// 0x0028 (0x0248 - 0x0220)
class AHydrogenPathActor final : public AActor
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PathGameplayTags;                                  // 0x0228(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HydrogenPathActor">();
	}
	static class AHydrogenPathActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHydrogenPathActor>();
	}
};
static_assert(alignof(AHydrogenPathActor) == 0x000008, "Wrong alignment on AHydrogenPathActor");
static_assert(sizeof(AHydrogenPathActor) == 0x000248, "Wrong size on AHydrogenPathActor");
static_assert(offsetof(AHydrogenPathActor, PathGameplayTags) == 0x000228, "Member 'AHydrogenPathActor::PathGameplayTags' has a wrong offset!");

}

