#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInfoPresentationWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemInfoPresentationWidget.ItemInfoPresentationWidget_C
// 0x0018 (0x02D0 - 0x02B8)
class UItemInfoPresentationWidget_C final : public UFortItemInfoPresentationWidget
{
public:
	class UWidgetAnimation*                       FadeAnim;                                          // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InitialState;                                      // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void HandleIntro();
	void HandleInitialState();
	void HandleOutro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemInfoPresentationWidget_C">();
	}
	static class UItemInfoPresentationWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInfoPresentationWidget_C>();
	}
};
static_assert(alignof(UItemInfoPresentationWidget_C) == 0x000008, "Wrong alignment on UItemInfoPresentationWidget_C");
static_assert(sizeof(UItemInfoPresentationWidget_C) == 0x0002D0, "Wrong size on UItemInfoPresentationWidget_C");
static_assert(offsetof(UItemInfoPresentationWidget_C, FadeAnim) == 0x0002B8, "Member 'UItemInfoPresentationWidget_C::FadeAnim' has a wrong offset!");
static_assert(offsetof(UItemInfoPresentationWidget_C, InitialState) == 0x0002C0, "Member 'UItemInfoPresentationWidget_C::InitialState' has a wrong offset!");
static_assert(offsetof(UItemInfoPresentationWidget_C, IntroAnim) == 0x0002C8, "Member 'UItemInfoPresentationWidget_C::IntroAnim' has a wrong offset!");

}

