#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemPresentationGenericRewardHeader

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemPresentationGenericRewardHeader.ItemPresentationGenericRewardHeader_C
// 0x0018 (0x02C8 - 0x02B0)
class UItemPresentationGenericRewardHeader_C final : public UFortItemReceivedHeaderBase
{
public:
	class UWidgetAnimation*                       FadeAnim;                                          // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InitialState;                                      // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void HandleIntro();
	void HandleInitialState();
	void HandleOutro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemPresentationGenericRewardHeader_C">();
	}
	static class UItemPresentationGenericRewardHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemPresentationGenericRewardHeader_C>();
	}
};
static_assert(alignof(UItemPresentationGenericRewardHeader_C) == 0x000008, "Wrong alignment on UItemPresentationGenericRewardHeader_C");
static_assert(sizeof(UItemPresentationGenericRewardHeader_C) == 0x0002C8, "Wrong size on UItemPresentationGenericRewardHeader_C");
static_assert(offsetof(UItemPresentationGenericRewardHeader_C, FadeAnim) == 0x0002B0, "Member 'UItemPresentationGenericRewardHeader_C::FadeAnim' has a wrong offset!");
static_assert(offsetof(UItemPresentationGenericRewardHeader_C, InitialState) == 0x0002B8, "Member 'UItemPresentationGenericRewardHeader_C::InitialState' has a wrong offset!");
static_assert(offsetof(UItemPresentationGenericRewardHeader_C, IntroAnim) == 0x0002C0, "Member 'UItemPresentationGenericRewardHeader_C::IntroAnim' has a wrong offset!");

}

