#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LMG_Anim_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass LMG_Anim_BP.LMG_Anim_BP_C
// 0x0140 (0x0400 - 0x02C0)
class ULMG_Anim_BP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D0(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0300(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0348(0x0018)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_SubInstance;                         // 0x0360(0x00A0)()

public:
	void ExecuteUbergraph_LMG_Anim_BP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LMG_Anim_BP_C">();
	}
	static class ULMG_Anim_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULMG_Anim_BP_C>();
	}
};
static_assert(alignof(ULMG_Anim_BP_C) == 0x000010, "Wrong alignment on ULMG_Anim_BP_C");
static_assert(sizeof(ULMG_Anim_BP_C) == 0x000400, "Wrong size on ULMG_Anim_BP_C");
static_assert(offsetof(ULMG_Anim_BP_C, UberGraphFrame) == 0x0002C0, "Member 'ULMG_Anim_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULMG_Anim_BP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0002C8, "Member 'ULMG_Anim_BP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ULMG_Anim_BP_C, AnimGraphNode_Root) == 0x0002D0, "Member 'ULMG_Anim_BP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ULMG_Anim_BP_C, AnimGraphNode_Slot) == 0x000300, "Member 'ULMG_Anim_BP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ULMG_Anim_BP_C, AnimGraphNode_LocalRefPose) == 0x000348, "Member 'ULMG_Anim_BP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(ULMG_Anim_BP_C, AnimGraphNode_SubInstance) == 0x000360, "Member 'ULMG_Anim_BP_C::AnimGraphNode_SubInstance' has a wrong offset!");

}

