#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LMG_Anim_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LMG_Anim_BP.LMG_Anim_BP_C.ExecuteUbergraph_LMG_Anim_BP
// 0x0004 (0x0004 - 0x0000)
struct LMG_Anim_BP_C_ExecuteUbergraph_LMG_Anim_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LMG_Anim_BP_C_ExecuteUbergraph_LMG_Anim_BP) == 0x000004, "Wrong alignment on LMG_Anim_BP_C_ExecuteUbergraph_LMG_Anim_BP");
static_assert(sizeof(LMG_Anim_BP_C_ExecuteUbergraph_LMG_Anim_BP) == 0x000004, "Wrong size on LMG_Anim_BP_C_ExecuteUbergraph_LMG_Anim_BP");
static_assert(offsetof(LMG_Anim_BP_C_ExecuteUbergraph_LMG_Anim_BP, EntryPoint) == 0x000000, "Member 'LMG_Anim_BP_C_ExecuteUbergraph_LMG_Anim_BP::EntryPoint' has a wrong offset!");

// Function LMG_Anim_BP.LMG_Anim_BP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct LMG_Anim_BP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(LMG_Anim_BP_C_AnimGraph) == 0x000008, "Wrong alignment on LMG_Anim_BP_C_AnimGraph");
static_assert(sizeof(LMG_Anim_BP_C_AnimGraph) == 0x000010, "Wrong size on LMG_Anim_BP_C_AnimGraph");
static_assert(offsetof(LMG_Anim_BP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'LMG_Anim_BP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

