#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LowTowerRuntime

#include "Basic.hpp"

#include "LowTowerRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class LowTowerRuntime.FortHardyAnimInstance
// 0x0100 (0x03F0 - 0x02F0)
class UFortHardyAnimInstance final : public UFortBaseAnimInstance
{
public:
	struct FRotator                               VentRotationOffset;                                // 0x02E8(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         VentSpinRateDirect;                                // 0x02F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RoamingDeltaYawOffsetRemapA;                       // 0x02F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RoamingDeltaYawOffsetRemapB;                       // 0x02FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         NeckXRotOffset;                                    // 0x0300(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               NeckRotationOffset;                                // 0x0304(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         NeckRotationOffsetSpeed;                           // 0x0310(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         NeckTurnAlpha;                                     // 0x0314(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         NeckTurnTarget;                                    // 0x0318(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         NeckRotationSpeed;                                 // 0x031C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RoamingDeltaYawDurationRemapA;                     // 0x0320(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RoamingDeltaYawDurationRemapB;                     // 0x0324(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_328[0x4];                                      // 0x0328(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EyeAccentAlpha;                                    // 0x032C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EyeAccentInterpSpeed;                              // 0x0330(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EyeAccentDurationWhenCanNotEyeDart;                // 0x0334(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EyeAccentDurationWhenCanEyeDart;                   // 0x0338(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EyeLaunchPoseCurveName;                            // 0x0340(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EyeLaunchPoseMaxPitch;                             // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               EyeRotLaunchValue;                                 // 0x034C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	class AActor*                                 TargetActor;                                       // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APawn*                                  TargetPawn;                                        // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   HardyEyeSocketName;                                // 0x0368(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   DisableEyeTrackingCurveName;                       // 0x0370(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EyeTrackingTargetSpeed;                            // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EyeTrackingTargetAlpha;                            // 0x037C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               EyeTrackingTargetRotationOffset;                   // 0x0380(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FRotator                               EyeTrackingTargetRotationTarget;                   // 0x038C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	class FName                                   HardyHeadSocketName;                               // 0x0398(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   DisableHeadTrackingCurveName;                      // 0x03A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         HeadTrackingTargetSpeed;                           // 0x03A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         HeadTrackingTargetAlpha;                           // 0x03AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               HeadTrackingTargetRotationOffset;                  // 0x03B0(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FRotator                               HeadTrackingTargetRotationTarget;                  // 0x03BC(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	ESkydivingDirection                           TurnDirection;                                     // 0x03C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HeadingAngle;                                      // 0x03CC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RoamingDesiredYaw;                                 // 0x03D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RoamingCurrentYaw;                                 // 0x03D4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RoamingDeltaYaw;                                   // 0x03D8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RoamingDeltaYawSnapshot;                           // 0x03DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsStopped : 1;                                    // 0x03E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsTurning : 1;                                    // 0x03E0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bCanStartTurning : 1;                              // 0x03E0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bHasTarget : 1;                                    // 0x03E0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bCanEyeDart : 1;                                   // 0x03E0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_3E1[0xF];                                      // 0x03E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHardyAnimInstance">();
	}
	static class UFortHardyAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHardyAnimInstance>();
	}
};
static_assert(alignof(UFortHardyAnimInstance) == 0x000010, "Wrong alignment on UFortHardyAnimInstance");
static_assert(sizeof(UFortHardyAnimInstance) == 0x0003F0, "Wrong size on UFortHardyAnimInstance");
static_assert(offsetof(UFortHardyAnimInstance, VentRotationOffset) == 0x0002E8, "Member 'UFortHardyAnimInstance::VentRotationOffset' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, VentSpinRateDirect) == 0x0002F4, "Member 'UFortHardyAnimInstance::VentSpinRateDirect' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, RoamingDeltaYawOffsetRemapA) == 0x0002F8, "Member 'UFortHardyAnimInstance::RoamingDeltaYawOffsetRemapA' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, RoamingDeltaYawOffsetRemapB) == 0x0002FC, "Member 'UFortHardyAnimInstance::RoamingDeltaYawOffsetRemapB' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, NeckXRotOffset) == 0x000300, "Member 'UFortHardyAnimInstance::NeckXRotOffset' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, NeckRotationOffset) == 0x000304, "Member 'UFortHardyAnimInstance::NeckRotationOffset' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, NeckRotationOffsetSpeed) == 0x000310, "Member 'UFortHardyAnimInstance::NeckRotationOffsetSpeed' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, NeckTurnAlpha) == 0x000314, "Member 'UFortHardyAnimInstance::NeckTurnAlpha' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, NeckTurnTarget) == 0x000318, "Member 'UFortHardyAnimInstance::NeckTurnTarget' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, NeckRotationSpeed) == 0x00031C, "Member 'UFortHardyAnimInstance::NeckRotationSpeed' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, RoamingDeltaYawDurationRemapA) == 0x000320, "Member 'UFortHardyAnimInstance::RoamingDeltaYawDurationRemapA' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, RoamingDeltaYawDurationRemapB) == 0x000324, "Member 'UFortHardyAnimInstance::RoamingDeltaYawDurationRemapB' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeAccentAlpha) == 0x00032C, "Member 'UFortHardyAnimInstance::EyeAccentAlpha' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeAccentInterpSpeed) == 0x000330, "Member 'UFortHardyAnimInstance::EyeAccentInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeAccentDurationWhenCanNotEyeDart) == 0x000334, "Member 'UFortHardyAnimInstance::EyeAccentDurationWhenCanNotEyeDart' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeAccentDurationWhenCanEyeDart) == 0x000338, "Member 'UFortHardyAnimInstance::EyeAccentDurationWhenCanEyeDart' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeLaunchPoseCurveName) == 0x000340, "Member 'UFortHardyAnimInstance::EyeLaunchPoseCurveName' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeLaunchPoseMaxPitch) == 0x000348, "Member 'UFortHardyAnimInstance::EyeLaunchPoseMaxPitch' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeRotLaunchValue) == 0x00034C, "Member 'UFortHardyAnimInstance::EyeRotLaunchValue' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, TargetActor) == 0x000358, "Member 'UFortHardyAnimInstance::TargetActor' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, TargetPawn) == 0x000360, "Member 'UFortHardyAnimInstance::TargetPawn' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, HardyEyeSocketName) == 0x000368, "Member 'UFortHardyAnimInstance::HardyEyeSocketName' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, DisableEyeTrackingCurveName) == 0x000370, "Member 'UFortHardyAnimInstance::DisableEyeTrackingCurveName' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeTrackingTargetSpeed) == 0x000378, "Member 'UFortHardyAnimInstance::EyeTrackingTargetSpeed' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeTrackingTargetAlpha) == 0x00037C, "Member 'UFortHardyAnimInstance::EyeTrackingTargetAlpha' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeTrackingTargetRotationOffset) == 0x000380, "Member 'UFortHardyAnimInstance::EyeTrackingTargetRotationOffset' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, EyeTrackingTargetRotationTarget) == 0x00038C, "Member 'UFortHardyAnimInstance::EyeTrackingTargetRotationTarget' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, HardyHeadSocketName) == 0x000398, "Member 'UFortHardyAnimInstance::HardyHeadSocketName' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, DisableHeadTrackingCurveName) == 0x0003A0, "Member 'UFortHardyAnimInstance::DisableHeadTrackingCurveName' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, HeadTrackingTargetSpeed) == 0x0003A8, "Member 'UFortHardyAnimInstance::HeadTrackingTargetSpeed' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, HeadTrackingTargetAlpha) == 0x0003AC, "Member 'UFortHardyAnimInstance::HeadTrackingTargetAlpha' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, HeadTrackingTargetRotationOffset) == 0x0003B0, "Member 'UFortHardyAnimInstance::HeadTrackingTargetRotationOffset' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, HeadTrackingTargetRotationTarget) == 0x0003BC, "Member 'UFortHardyAnimInstance::HeadTrackingTargetRotationTarget' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, TurnDirection) == 0x0003C8, "Member 'UFortHardyAnimInstance::TurnDirection' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, HeadingAngle) == 0x0003CC, "Member 'UFortHardyAnimInstance::HeadingAngle' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, RoamingDesiredYaw) == 0x0003D0, "Member 'UFortHardyAnimInstance::RoamingDesiredYaw' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, RoamingCurrentYaw) == 0x0003D4, "Member 'UFortHardyAnimInstance::RoamingCurrentYaw' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, RoamingDeltaYaw) == 0x0003D8, "Member 'UFortHardyAnimInstance::RoamingDeltaYaw' has a wrong offset!");
static_assert(offsetof(UFortHardyAnimInstance, RoamingDeltaYawSnapshot) == 0x0003DC, "Member 'UFortHardyAnimInstance::RoamingDeltaYawSnapshot' has a wrong offset!");

// Class LowTowerRuntime.FortHardyComponent_Telemetry
// 0x0008 (0x0120 - 0x0118)
class UFortHardyComponent_Telemetry final : public UFortAIComponent_Telemetry
{
public:
	EHardyExtractionReason                        ExtractionReason;                                  // 0x0118(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetExtractionReason(const EHardyExtractionReason Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHardyComponent_Telemetry">();
	}
	static class UFortHardyComponent_Telemetry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHardyComponent_Telemetry>();
	}
};
static_assert(alignof(UFortHardyComponent_Telemetry) == 0x000008, "Wrong alignment on UFortHardyComponent_Telemetry");
static_assert(sizeof(UFortHardyComponent_Telemetry) == 0x000120, "Wrong size on UFortHardyComponent_Telemetry");
static_assert(offsetof(UFortHardyComponent_Telemetry, ExtractionReason) == 0x000118, "Member 'UFortHardyComponent_Telemetry::ExtractionReason' has a wrong offset!");

// Class LowTowerRuntime.FortLaurelAnimInstance
// 0x00C0 (0x03B0 - 0x02F0)
class UFortLaurelAnimInstance final : public UFortBaseAnimInstance
{
public:
	float                                         VelocityMultiplierWithItemInInventory;             // 0x02E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AggroPitchCurveName;                               // 0x02EC(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultAggroPitch;                                 // 0x02F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringAlphaTarget;                                 // 0x02F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringAlphaInterpSpeed;                            // 0x02FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicLegRotationSpeedUpdateRate;                 // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicLegRotationSpeedWithItem;                   // 0x0304(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicLegRotationSpeedWithoutItemMin;             // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicLegRotationSpeedWithoutItemMax;             // 0x030C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicLegRotationInterpSpeed;                     // 0x0310(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0314(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HorizontalSpeed;                                   // 0x0320(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324[0xC];                                      // 0x0324(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorTransform;                                    // 0x0330(0x0030)(BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ActorLocation;                                     // 0x0360(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ActorRotation;                                     // 0x036C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LeanDirection;                                     // 0x0378(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AggroPitch;                                        // 0x037C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AggroPitchAlpha;                                   // 0x0380(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFalling;                                        // 0x0384(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnYaw;                                          // 0x0388(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnPitch;                                        // 0x038C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringAlpha;                                       // 0x0390(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicLegRotationSpeed;                           // 0x0394(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicLegRotationSpeedSmooth;                     // 0x0398(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicLegRotation;                                // 0x039C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x03A0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasItemInInventory;                               // 0x03A1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPawnIsDestroyingBuildingForNav;                   // 0x03A2(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasPawnGoal;                                      // 0x03A3(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DynamicLegRotationSpeedUpdateTime;                 // 0x03A4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 GoalActor;                                         // 0x03A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetAnimInstanceInformation(const bool bInIsActive);
	void SetLaurelInformation(const bool bInHasItemInInventory, const bool bInPawnIsDestroyingBuildingForNav, const bool bInHasPawnGoal, const class AActor* InGoalActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortLaurelAnimInstance">();
	}
	static class UFortLaurelAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLaurelAnimInstance>();
	}
};
static_assert(alignof(UFortLaurelAnimInstance) == 0x000010, "Wrong alignment on UFortLaurelAnimInstance");
static_assert(sizeof(UFortLaurelAnimInstance) == 0x0003B0, "Wrong size on UFortLaurelAnimInstance");
static_assert(offsetof(UFortLaurelAnimInstance, VelocityMultiplierWithItemInInventory) == 0x0002E8, "Member 'UFortLaurelAnimInstance::VelocityMultiplierWithItemInInventory' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, AggroPitchCurveName) == 0x0002EC, "Member 'UFortLaurelAnimInstance::AggroPitchCurveName' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DefaultAggroPitch) == 0x0002F4, "Member 'UFortLaurelAnimInstance::DefaultAggroPitch' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, SpringAlphaTarget) == 0x0002F8, "Member 'UFortLaurelAnimInstance::SpringAlphaTarget' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, SpringAlphaInterpSpeed) == 0x0002FC, "Member 'UFortLaurelAnimInstance::SpringAlphaInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DynamicLegRotationSpeedUpdateRate) == 0x000300, "Member 'UFortLaurelAnimInstance::DynamicLegRotationSpeedUpdateRate' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DynamicLegRotationSpeedWithItem) == 0x000304, "Member 'UFortLaurelAnimInstance::DynamicLegRotationSpeedWithItem' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DynamicLegRotationSpeedWithoutItemMin) == 0x000308, "Member 'UFortLaurelAnimInstance::DynamicLegRotationSpeedWithoutItemMin' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DynamicLegRotationSpeedWithoutItemMax) == 0x00030C, "Member 'UFortLaurelAnimInstance::DynamicLegRotationSpeedWithoutItemMax' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DynamicLegRotationInterpSpeed) == 0x000310, "Member 'UFortLaurelAnimInstance::DynamicLegRotationInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, Velocity) == 0x000314, "Member 'UFortLaurelAnimInstance::Velocity' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, HorizontalSpeed) == 0x000320, "Member 'UFortLaurelAnimInstance::HorizontalSpeed' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, ActorTransform) == 0x000330, "Member 'UFortLaurelAnimInstance::ActorTransform' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, ActorLocation) == 0x000360, "Member 'UFortLaurelAnimInstance::ActorLocation' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, ActorRotation) == 0x00036C, "Member 'UFortLaurelAnimInstance::ActorRotation' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, LeanDirection) == 0x000378, "Member 'UFortLaurelAnimInstance::LeanDirection' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, AggroPitch) == 0x00037C, "Member 'UFortLaurelAnimInstance::AggroPitch' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, AggroPitchAlpha) == 0x000380, "Member 'UFortLaurelAnimInstance::AggroPitchAlpha' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, bIsFalling) == 0x000384, "Member 'UFortLaurelAnimInstance::bIsFalling' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, SpawnYaw) == 0x000388, "Member 'UFortLaurelAnimInstance::SpawnYaw' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, SpawnPitch) == 0x00038C, "Member 'UFortLaurelAnimInstance::SpawnPitch' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, SpringAlpha) == 0x000390, "Member 'UFortLaurelAnimInstance::SpringAlpha' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DynamicLegRotationSpeed) == 0x000394, "Member 'UFortLaurelAnimInstance::DynamicLegRotationSpeed' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DynamicLegRotationSpeedSmooth) == 0x000398, "Member 'UFortLaurelAnimInstance::DynamicLegRotationSpeedSmooth' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DynamicLegRotation) == 0x00039C, "Member 'UFortLaurelAnimInstance::DynamicLegRotation' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, bIsActive) == 0x0003A0, "Member 'UFortLaurelAnimInstance::bIsActive' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, bHasItemInInventory) == 0x0003A1, "Member 'UFortLaurelAnimInstance::bHasItemInInventory' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, bPawnIsDestroyingBuildingForNav) == 0x0003A2, "Member 'UFortLaurelAnimInstance::bPawnIsDestroyingBuildingForNav' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, bHasPawnGoal) == 0x0003A3, "Member 'UFortLaurelAnimInstance::bHasPawnGoal' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, DynamicLegRotationSpeedUpdateTime) == 0x0003A4, "Member 'UFortLaurelAnimInstance::DynamicLegRotationSpeedUpdateTime' has a wrong offset!");
static_assert(offsetof(UFortLaurelAnimInstance, GoalActor) == 0x0003A8, "Member 'UFortLaurelAnimInstance::GoalActor' has a wrong offset!");

// Class LowTowerRuntime.FortLaurelComponent_Telemetry
// 0x0008 (0x0120 - 0x0118)
class UFortLaurelComponent_Telemetry final : public UFortAIComponent_Telemetry
{
public:
	ELaurelType                                   LaurelType;                                        // 0x0118(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELaurelExtractionReason                       ExtractionReason;                                  // 0x0119(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDropAllItems(const ELaurelDropItemReason DropItemReason);
	void SetExtractionReason(const ELaurelExtractionReason Reason);
	void SetLaurelType(const ELaurelType Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortLaurelComponent_Telemetry">();
	}
	static class UFortLaurelComponent_Telemetry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLaurelComponent_Telemetry>();
	}
};
static_assert(alignof(UFortLaurelComponent_Telemetry) == 0x000008, "Wrong alignment on UFortLaurelComponent_Telemetry");
static_assert(sizeof(UFortLaurelComponent_Telemetry) == 0x000120, "Wrong size on UFortLaurelComponent_Telemetry");
static_assert(offsetof(UFortLaurelComponent_Telemetry, LaurelType) == 0x000118, "Member 'UFortLaurelComponent_Telemetry::LaurelType' has a wrong offset!");
