#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Tactical_Scuba_Maskless_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Tactical_Scuba_Maskless_AnimBP.M_MED_Tactical_Scuba_Maskless_AnimBP_C
// 0x0B70 (0x1010 - 0x04A0)
class UM_MED_Tactical_Scuba_Maskless_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04B0(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x04E0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0620(0x0650)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C70(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C90(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0CB0(0x0360)()

public:
	void ExecuteUbergraph_M_MED_Tactical_Scuba_Maskless_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Tactical_Scuba_Maskless_AnimBP_C">();
	}
	static class UM_MED_Tactical_Scuba_Maskless_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Tactical_Scuba_Maskless_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Tactical_Scuba_Maskless_AnimBP_C");
static_assert(sizeof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C) == 0x001010, "Wrong size on UM_MED_Tactical_Scuba_Maskless_AnimBP_C");
static_assert(offsetof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C, UberGraphFrame) == 0x0004A0, "Member 'UM_MED_Tactical_Scuba_Maskless_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0004A8, "Member 'UM_MED_Tactical_Scuba_Maskless_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C, AnimGraphNode_Root) == 0x0004B0, "Member 'UM_MED_Tactical_Scuba_Maskless_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0004E0, "Member 'UM_MED_Tactical_Scuba_Maskless_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C, AnimGraphNode_RigidBody) == 0x000620, "Member 'UM_MED_Tactical_Scuba_Maskless_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000C70, "Member 'UM_MED_Tactical_Scuba_Maskless_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000C90, "Member 'UM_MED_Tactical_Scuba_Maskless_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Tactical_Scuba_Maskless_AnimBP_C, AnimGraphNode_ControlRig) == 0x000CB0, "Member 'UM_MED_Tactical_Scuba_Maskless_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");

}

