#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_HighTower_Tapas_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_HighTower_Tapas_AnimBP.M_MED_HighTower_Tapas_AnimBP_C
// 0x3320 (0x3810 - 0x04F0)
class M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C final : public UCustomCharacterPartAnimInstance_HightowerTapasBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0500(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0530(0x0140)(ContainsInstancedReference)
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0670(0x0650)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0CC0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0CE0(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_16;                       // 0x0D00(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_15;                       // 0x0E08(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_14;                       // 0x0F10(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_13;                       // 0x1018(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_12;                       // 0x1120(0x0108)()
	uint8                                         Pad_1228[0x8];                                     // 0x1228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_3;                            // 0x1230(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x13E0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x1590(0x01B0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0x1740(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_11;                       // 0x1848(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_10;                       // 0x1950(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x1A58(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_9;                        // 0x1B60(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_8;                        // 0x1C68(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x1D70(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x1E78(0x0108)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1F80(0x01B0)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x2130(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x2238(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x2340(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x2448(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x2550(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x2658(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x2760(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x2868(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x2970(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x2A78(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x2B80(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x2C88(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x2D90(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x2E98(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x2FA0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x30A8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x31B0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x32B8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x33C0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x34C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x35D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x36D8(0x0108)()
	class UAnimMontage*                           NewVar_0;                                          // 0x37E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           NewVar_1;                                          // 0x37E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           NewVar_2;                                          // 0x37F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_3;                                          // 0x37F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         isFrontendAndSkydivingAlpha;                       // 0x37FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         tapasGliderAlpha;                                  // 0x3800(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_HighTower_Tapas_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void OnCharacterCustomizationLoaded();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBlueprintGeneratedClass M_MED_HighTower_Tapas_AnimBP.M_MED_HighTower_Tapas_AnimBP_C", true, "M_MED_HighTower_Tapas_AnimBP_C">();
	}
	static class M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C>();
	}
};
static_assert(alignof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C) == 0x000010, "Wrong alignment on M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C");
static_assert(sizeof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C) == 0x003810, "Wrong size on M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, UberGraphFrame) == 0x0004F0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0004F8, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Root) == 0x000500, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000530, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_RigidBody) == 0x000670, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000CC0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000CE0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_16) == 0x000D00, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_16' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_15) == 0x000E08, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_15' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_14) == 0x000F10, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_14' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_13) == 0x001018, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_13' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_12) == 0x001120, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_12' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_LookAt_3) == 0x001230, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_LookAt_3' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_LookAt_2) == 0x0013E0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_LookAt_1) == 0x001590, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_17) == 0x001740, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_17' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_11) == 0x001848, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_11' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_10) == 0x001950, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_10' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_16) == 0x001A58, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_16' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_9) == 0x001B60, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_9' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_8) == 0x001C68, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_8' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_15) == 0x001D70, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_15' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_7) == 0x001E78, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_7' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_LookAt) == 0x001F80, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_6) == 0x002130, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_14) == 0x002238, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_13) == 0x002340, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_12) == 0x002448, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_11) == 0x002550, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_10) == 0x002658, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_9) == 0x002760, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_5) == 0x002868, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_4) == 0x002970, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x002A78, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x002B80, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x002C88, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x002D90, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x002E98, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x002FA0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_3) == 0x0030A8, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_2) == 0x0031B0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x0032B8, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint_1) == 0x0033C0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_Constraint) == 0x0034C8, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0035D0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0036D8, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, NewVar_0) == 0x0037E0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, NewVar_1) == 0x0037E8, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, NewVar_2) == 0x0037F0, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::NewVar_2' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, NewVar_3) == 0x0037F8, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::NewVar_3' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, isFrontendAndSkydivingAlpha) == 0x0037FC, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::isFrontendAndSkydivingAlpha' has a wrong offset!");
static_assert(offsetof(M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C, tapasGliderAlpha) == 0x003800, "Member 'M_MED_HighTower_Tapas_AnimBP::UM_MED_HighTower_Tapas_AnimBP_C::tapasGliderAlpha' has a wrong offset!");

}

