#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Tapas_Pack_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Tapas_Pack_AnimBP.M_MED_Tapas_Pack_AnimBP_C
// 0x28B0 (0x2F10 - 0x0660)
class UM_MED_Tapas_Pack_AnimBP_C final : public UCustomCharacterPartAnimInstance_HightowerTapasCape
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0670(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0690(0x0020)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail_4;                             // 0x06B0(0x0260)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail_3;                             // 0x0910(0x0260)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail_2;                             // 0x0B70(0x0260)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail_1;                             // 0x0DD0(0x0260)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1030(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x10F8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1120(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x11E8(0x0028)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x1210(0x0260)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1470(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1490(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x14B0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x15F0(0x0030)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1620(0x0650)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0x1C70(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x1D78(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x1E80(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x1F88(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x2090(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x2198(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x22A0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x23A8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x24B0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x25B8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x26C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x27C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x28D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x29D8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x2AE0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x2BE8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2CF0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2DF8(0x0108)()
	float                                         RigidBodyAlpha_b;                                  // 0x2F00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         isCrouchingAlpha;                                  // 0x2F04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         isEmotingAlpha;                                    // 0x2F08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_Tapas_Pack_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void OnEndPlayingEmote();
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Tapas_Pack_AnimBP_C">();
	}
	static class UM_MED_Tapas_Pack_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Tapas_Pack_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Tapas_Pack_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Tapas_Pack_AnimBP_C");
static_assert(sizeof(UM_MED_Tapas_Pack_AnimBP_C) == 0x002F10, "Wrong size on UM_MED_Tapas_Pack_AnimBP_C");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, UberGraphFrame) == 0x000660, "Member 'UM_MED_Tapas_Pack_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000668, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000670, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000690, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_Trail_4) == 0x0006B0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_Trail_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_Trail_3) == 0x000910, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_Trail_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_Trail_2) == 0x000B70, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_Trail_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_Trail_1) == 0x000DD0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_Trail_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x001030, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0010F8, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x001120, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0011E8, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_Trail) == 0x001210, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_Trail' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001470, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001490, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0014B0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_Root) == 0x0015F0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_RigidBody) == 0x001620, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_17) == 0x001C70, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_17' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_16) == 0x001D78, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_16' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_15) == 0x001E80, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_15' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_14) == 0x001F88, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_13) == 0x002090, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_12) == 0x002198, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_11) == 0x0022A0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_10) == 0x0023A8, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_9) == 0x0024B0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x0025B8, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x0026C0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x0027C8, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x0028D0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x0029D8, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x002AE0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x002BE8, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x002CF0, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002DF8, "Member 'UM_MED_Tapas_Pack_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, RigidBodyAlpha_b) == 0x002F00, "Member 'UM_MED_Tapas_Pack_AnimBP_C::RigidBodyAlpha_b' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, isCrouchingAlpha) == 0x002F04, "Member 'UM_MED_Tapas_Pack_AnimBP_C::isCrouchingAlpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Tapas_Pack_AnimBP_C, isEmotingAlpha) == 0x002F08, "Member 'UM_MED_Tapas_Pack_AnimBP_C::isEmotingAlpha' has a wrong offset!");

}

