#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuScreen_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MenuScreen_Athena.MenuScreen_Athena_C
// 0x1C30 (0x2030 - 0x0400)
class UMenuScreen_Athena_C final : public UFrontendAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x0410(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x04C0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0538(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x05B0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0628(0x0078)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x06A0(0x00A0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x0740(0x00A0)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_2;                             // 0x07E0(0x00F8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x08D8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x09E0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0A08(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0A50(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0B10(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0BD8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0C00(0x0028)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_1;                             // 0x0C28(0x00F8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5;                          // 0x0D20(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4;                          // 0x0E10(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x0F00(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0FF0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1038(0x0048)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x1080(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1170(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1238(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1280(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1320(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1348(0x00C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1410(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1430(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1450(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1480(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x14A8(0x0078)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x1520(0x00F8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1618(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1720(0x0108)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x1828(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x1918(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1A08(0x0108)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x1B10(0x0058)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x1B68(0x00B0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x1C18(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1CC8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1D40(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1DB8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1E30(0x0078)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x1EA8(0x00A0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x1F48(0x00A0)()
	TMulticastInlineDelegate<void()>              MenuScreenDispatcher;                              // 0x1FE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasBeenSelected;                                   // 0x1FF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF9[0x3];                                     // 0x1FF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PoseInt;                                           // 0x1FFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OffsetTranslate;                                   // 0x2000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OffsetRotate;                                      // 0x200C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APlayerPawn_Athena_C*                   PawnOwner;                                         // 0x2018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTime;                                         // 0x2020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayRate;                                          // 0x2024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HidePropTimeRemaining;                             // 0x2028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HidePropBones;                                     // 0x202C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MenuScreen_Athena(int32 EntryPoint);
	void OnMontageBlendingOut_Event_HideProps(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageStarted_Event_HideProps(class UAnimMontage* Montage);
	void AnimNotify_LobbySkydive_Gliding();
	void AnimNotify_LobbySkydive_Diving();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MenuScreen_Athena_AnimGraphNode_LayeredBoneBlend_8D2B60D44BBADFD01AC9A6BF39472D0B();
	void AnimNotify_LeftB();
	void UserFocus();
	void AnimNotify_playFacialAnim();
	void HidePropsForBlend(class UAnimMontage* NewMontage);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuScreen_Athena_C">();
	}
	static class UMenuScreen_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuScreen_Athena_C>();
	}
};
static_assert(alignof(UMenuScreen_Athena_C) == 0x000010, "Wrong alignment on UMenuScreen_Athena_C");
static_assert(sizeof(UMenuScreen_Athena_C) == 0x002030, "Wrong size on UMenuScreen_Athena_C");
static_assert(offsetof(UMenuScreen_Athena_C, UberGraphFrame) == 0x000400, "Member 'UMenuScreen_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000408, "Member 'UMenuScreen_Athena_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByEnum_2) == 0x000410, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_8) == 0x0004C0, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_7) == 0x000538, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_6) == 0x0005B0, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_5) == 0x000628, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByInt_3) == 0x0006A0, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByInt_3' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByInt_2) == 0x000740, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByInt_2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LegIK_2) == 0x0007E0, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LegIK_2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_ModifyBone_3) == 0x0008D8, "Member 'UMenuScreen_Athena_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_UseCachedPose_4) == 0x0009E0, "Member 'UMenuScreen_Athena_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Slot_3) == 0x000A08, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LayeredBoneBlend) == 0x000A50, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SaveCachedPose_2) == 0x000B10, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_UseCachedPose_3) == 0x000BD8, "Member 'UMenuScreen_Athena_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_UseCachedPose_2) == 0x000C00, "Member 'UMenuScreen_Athena_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LegIK_1) == 0x000C28, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LegIK_1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_CopyBone_5) == 0x000D20, "Member 'UMenuScreen_Athena_C::AnimGraphNode_CopyBone_5' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_CopyBone_4) == 0x000E10, "Member 'UMenuScreen_Athena_C::AnimGraphNode_CopyBone_4' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_CopyBone_3) == 0x000F00, "Member 'UMenuScreen_Athena_C::AnimGraphNode_CopyBone_3' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Slot_2) == 0x000FF0, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Slot_1) == 0x001038, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_CopyBone_2) == 0x001080, "Member 'UMenuScreen_Athena_C::AnimGraphNode_CopyBone_2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SaveCachedPose_1) == 0x001170, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Slot) == 0x001238, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByBool) == 0x001280, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_UseCachedPose_1) == 0x001320, "Member 'UMenuScreen_Athena_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SaveCachedPose) == 0x001348, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_ComponentToLocalSpace) == 0x001410, "Member 'UMenuScreen_Athena_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LocalToComponentSpace) == 0x001430, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_Root) == 0x001450, "Member 'UMenuScreen_Athena_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_UseCachedPose) == 0x001480, "Member 'UMenuScreen_Athena_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_4) == 0x0014A8, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_LegIK) == 0x001520, "Member 'UMenuScreen_Athena_C::AnimGraphNode_LegIK' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_ModifyBone_2) == 0x001618, "Member 'UMenuScreen_Athena_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_ModifyBone_1) == 0x001720, "Member 'UMenuScreen_Athena_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_CopyBone_1) == 0x001828, "Member 'UMenuScreen_Athena_C::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_CopyBone) == 0x001918, "Member 'UMenuScreen_Athena_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_ModifyBone) == 0x001A08, "Member 'UMenuScreen_Athena_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_ModifyCurve) == 0x001B10, "Member 'UMenuScreen_Athena_C::AnimGraphNode_ModifyCurve' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByEnum_1) == 0x001B68, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByEnum) == 0x001C18, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_3) == 0x001CC8, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_2) == 0x001D40, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer_1) == 0x001DB8, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_SequencePlayer) == 0x001E30, "Member 'UMenuScreen_Athena_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByInt_1) == 0x001EA8, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByInt_1' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, AnimGraphNode_BlendListByInt) == 0x001F48, "Member 'UMenuScreen_Athena_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, MenuScreenDispatcher) == 0x001FE8, "Member 'UMenuScreen_Athena_C::MenuScreenDispatcher' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, HasBeenSelected) == 0x001FF8, "Member 'UMenuScreen_Athena_C::HasBeenSelected' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, PoseInt) == 0x001FFC, "Member 'UMenuScreen_Athena_C::PoseInt' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, OffsetTranslate) == 0x002000, "Member 'UMenuScreen_Athena_C::OffsetTranslate' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, OffsetRotate) == 0x00200C, "Member 'UMenuScreen_Athena_C::OffsetRotate' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, PawnOwner) == 0x002018, "Member 'UMenuScreen_Athena_C::PawnOwner' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, StartTime) == 0x002020, "Member 'UMenuScreen_Athena_C::StartTime' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, PlayRate) == 0x002024, "Member 'UMenuScreen_Athena_C::PlayRate' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, HidePropTimeRemaining) == 0x002028, "Member 'UMenuScreen_Athena_C::HidePropTimeRemaining' has a wrong offset!");
static_assert(offsetof(UMenuScreen_Athena_C, HidePropBones) == 0x00202C, "Member 'UMenuScreen_Athena_C::HidePropBones' has a wrong offset!");

}

