#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mustache_SkBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Mustache_SkBP.Mustache_SkBP_C
// 0x02E0 (0x05E0 - 0x0300)
class UMustache_SkBP_C final : public UFortWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0310(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0368(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0390(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0408(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0438(0x0078)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x04B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x04F8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0528(0x00B0)()

public:
	void ExecuteUbergraph_Mustache_SkBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mustache_SkBP_C">();
	}
	static class UMustache_SkBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMustache_SkBP_C>();
	}
};
static_assert(alignof(UMustache_SkBP_C) == 0x000010, "Wrong alignment on UMustache_SkBP_C");
static_assert(sizeof(UMustache_SkBP_C) == 0x0005E0, "Wrong size on UMustache_SkBP_C");
static_assert(offsetof(UMustache_SkBP_C, UberGraphFrame) == 0x000300, "Member 'UMustache_SkBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x000308, "Member 'UMustache_SkBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimGraphNode_Root) == 0x000310, "Member 'UMustache_SkBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimGraphNode_TransitionResult_1) == 0x000340, "Member 'UMustache_SkBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimGraphNode_TransitionResult) == 0x000368, "Member 'UMustache_SkBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimGraphNode_SequencePlayer_1) == 0x000390, "Member 'UMustache_SkBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimGraphNode_StateResult_1) == 0x000408, "Member 'UMustache_SkBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimGraphNode_SequencePlayer) == 0x000438, "Member 'UMustache_SkBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimGraphNode_Slot) == 0x0004B0, "Member 'UMustache_SkBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimGraphNode_StateResult) == 0x0004F8, "Member 'UMustache_SkBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UMustache_SkBP_C, AnimGraphNode_StateMachine) == 0x000528, "Member 'UMustache_SkBP_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

