#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Pawn_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_NPC_AlertLevel_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.ExecuteUbergraph_NPC_Pawn_Parent
// 0x0520 (0x0520 - 0x0000)
struct NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NPC_GetScalableFloatHotfixValue_AsBool;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_NPC_GetScalableFloatHotfixValue_AsIntRounded; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NPC_GetScalableFloatHotfixValue_AsFloat;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNPCStatusWidget_C*                     K2Node_DynamicCast_AsNPCStatus_Widget;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage_3;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_3;                         // 0x0048(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_3;                           // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_3;                            // 0x0074(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_3;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_3;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_3;                      // 0x0110(0x0018)()
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bVisible)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage_2;                             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_2;                         // 0x0148(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_2;                           // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_2;                            // 0x0174(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_2;                       // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_2;                       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_2;                      // 0x0210(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceBetweenActors_Distance;        // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponentManager* CallFunc_GetCurrent_ReturnValue;                 // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNPCStatusWidget_C*                     K2Node_DynamicCast_AsNPCStatus_Widget_1;           // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_2;        // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNPCStatusWidget_C*                     K2Node_DynamicCast_AsNPCStatus_Widget_2;           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayDataTrackerComponentManager* CallFunc_GetCurrent_ReturnValue_1;               // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_NPC_AlertLevel                           CallFunc_NPC_GetAlertLevelInfo_AlertLevel;         // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B[0x1];                                      // 0x028B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_NPC_GetAlertLevelInfo_AlertLevelTag;      // 0x028C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NPC_GetAlertLevelInfo_ValidDataFound;     // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bVisible;                       // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryActivateAbilitiesByTag_ReturnValue;    // 0x0297(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Vehicle;                        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortRarity                                   CallFunc_NPC_SetBestLootRarityInInventory_NPC_BestLootRarityInInventory; // 0x02AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage_1;                             // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x02B8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x02E4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy_1;                       // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0380(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x039C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_NewController;                        // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x03B8(0x0020)()
	bool                                          CallFunc_NotEqual_GameplayTagContainer_ReturnValue; // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryActivateAbilitiesByTag_ReturnValue_1;  // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_NPC_AlertLevel                           K2Node_CustomEvent_NPC_AlertLevel_1;               // 0x03DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x03DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_NPC_AlertLevel                           K2Node_CustomEvent_NPC_AlertLevel;                 // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE[0x2];                                      // 0x03DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_3;        // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNPCStatusWidget_C*                     K2Node_DynamicCast_AsNPCStatus_Widget_3;           // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0408(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0x6];                                      // 0x0412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_4;        // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNPCStatusWidget_C*                     K2Node_DynamicCast_AsNPCStatus_Widget_4;           // 0x0420(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0430(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x045C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x04F8(0x0018)()
	bool                                          CallFunc_NPC_TryToDropLootOnDeath_CanDropLoot;     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0514(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x051D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent");
static_assert(sizeof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent) == 0x000520, "Wrong size on NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, EntryPoint) == 0x000000, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_GetScalableFloatHotfixValue_AsBool) == 0x000004, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_GetScalableFloatHotfixValue_AsBool' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_GetScalableFloatHotfixValue_AsIntRounded) == 0x000008, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_GetScalableFloatHotfixValue_AsIntRounded' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_GetScalableFloatHotfixValue_AsFloat) == 0x00000C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_GetScalableFloatHotfixValue_AsFloat' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000010, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, Temp_bool_Variable) == 0x000024, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_HasAuthority_ReturnValue) == 0x000025, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_2) == 0x000026, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000028, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_HasAuthority_ReturnValue_1) == 0x000030, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_AsNPCStatus_Widget) == 0x000038, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_AsNPCStatus_Widget' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Damage_3) == 0x000044, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Damage_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageTags_3) == 0x000048, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageTags_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Momentum_3) == 0x000068, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Momentum_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_HitInfo_3) == 0x000074, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_HitInfo_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_InstigatedBy_3) == 0x000100, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_InstigatedBy_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageCauser_3) == 0x000108, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageCauser_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_EffectContext_3) == 0x000110, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_EffectContext_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetHealth_ReturnValue) == 0x000128, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00012C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetMaxHealth_ReturnValue) == 0x00013C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Damage_2) == 0x000140, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Damage_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageTags_2) == 0x000148, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageTags_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Momentum_2) == 0x000168, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Momentum_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_HitInfo_2) == 0x000174, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_HitInfo_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_InstigatedBy_2) == 0x000200, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_InstigatedBy_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageCauser_2) == 0x000208, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageCauser_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_EffectContext_2) == 0x000210, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_EffectContext_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000228, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetDistanceBetweenActors_Distance) == 0x00022C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetDistanceBetweenActors_Distance' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_Less_FloatFloat_ReturnValue) == 0x000230, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_HasAuthority_ReturnValue_2) == 0x000231, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetCurrent_ReturnValue) == 0x000238, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetCurrent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000240, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_4) == 0x000241, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetUserWidgetObject_ReturnValue_1) == 0x000248, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetUserWidgetObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_EndPlayReason) == 0x000250, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_AsNPCStatus_Widget_1) == 0x000258, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_AsNPCStatus_Widget_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000260, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_5) == 0x000261, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetUserWidgetObject_ReturnValue_2) == 0x000268, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetUserWidgetObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_AsNPCStatus_Widget_2) == 0x000270, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_AsNPCStatus_Widget_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_bSuccess_2) == 0x000278, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetCurrent_ReturnValue_1) == 0x000280, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetCurrent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsVisible_ReturnValue) == 0x000288, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_6) == 0x000289, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_GetAlertLevelInfo_AlertLevel) == 0x00028A, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_GetAlertLevelInfo_AlertLevel' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_GetAlertLevelInfo_AlertLevelTag) == 0x00028C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_GetAlertLevelInfo_AlertLevelTag' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_GetAlertLevelInfo_ValidDataFound) == 0x000294, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_GetAlertLevelInfo_ValidDataFound' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CustomEvent_bVisible) == 0x000295, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CustomEvent_bVisible' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_7) == 0x000296, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_TryActivateAbilitiesByTag_ReturnValue) == 0x000297, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_TryActivateAbilitiesByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CustomEvent_Vehicle) == 0x000298, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CustomEvent_Velocity) == 0x0002A0, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_HasAuthority_ReturnValue_3) == 0x0002AC, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_HasAuthority_ReturnValue_4) == 0x0002AD, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_SetBestLootRarityInInventory_NPC_BestLootRarityInInventory) == 0x0002AE, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_SetBestLootRarityInInventory_NPC_BestLootRarityInInventory' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x0002AF, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Damage_1) == 0x0002B0, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageTags_1) == 0x0002B8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Momentum_1) == 0x0002D8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_HitInfo_1) == 0x0002E4, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_InstigatedBy_1) == 0x000370, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageCauser_1) == 0x000378, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_EffectContext_1) == 0x000380, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_BooleanAND_ReturnValue) == 0x000398, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000399, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x00039C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_NewController) == 0x0003B0, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_NewController' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0003B8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NotEqual_GameplayTagContainer_ReturnValue) == 0x0003D8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NotEqual_GameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_TryActivateAbilitiesByTag_ReturnValue_1) == 0x0003D9, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_TryActivateAbilitiesByTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CustomEvent_NPC_AlertLevel_1) == 0x0003DA, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CustomEvent_NPC_AlertLevel_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0003DB, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_CustomEvent_NPC_AlertLevel) == 0x0003DC, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_CustomEvent_NPC_AlertLevel' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_8) == 0x0003DD, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x0003E0, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetUserWidgetObject_ReturnValue_3) == 0x0003E8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetUserWidgetObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_AsNPCStatus_Widget_3) == 0x0003F0, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_AsNPCStatus_Widget_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_bSuccess_3) == 0x0003F8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0003FC, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_RandomFloatInRange_ReturnValue) == 0x000400, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000408, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000410, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_IsValid_ReturnValue_9) == 0x000411, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_GetUserWidgetObject_ReturnValue_4) == 0x000418, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_GetUserWidgetObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_AsNPCStatus_Widget_4) == 0x000420, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_AsNPCStatus_Widget_4' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_DynamicCast_bSuccess_4) == 0x000428, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Damage) == 0x00042C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageTags) == 0x000430, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_Momentum) == 0x000450, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_HitInfo) == 0x00045C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_InstigatedBy) == 0x0004E8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_DamageCauser) == 0x0004F0, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Event_EffectContext) == 0x0004F8, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_NPC_TryToDropLootOnDeath_CanDropLoot) == 0x000510, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_NPC_TryToDropLootOnDeath_CanDropLoot' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, K2Node_Select_Default) == 0x000514, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_Not_PreBool_ReturnValue_1) == 0x00051C, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent, CallFunc_BooleanAND_ReturnValue_1) == 0x00051D, "Member 'NPC_Pawn_Parent_C_ExecuteUbergraph_NPC_Pawn_Parent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct NPC_Pawn_Parent_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(NPC_Pawn_Parent_C_OnDeathServer) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_OnDeathServer");
static_assert(sizeof(NPC_Pawn_Parent_C_OnDeathServer) == 0x0000E8, "Wrong size on NPC_Pawn_Parent_C_OnDeathServer");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathServer, Damage) == 0x000000, "Member 'NPC_Pawn_Parent_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathServer, DamageTags) == 0x000008, "Member 'NPC_Pawn_Parent_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathServer, Momentum) == 0x000028, "Member 'NPC_Pawn_Parent_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathServer, HitInfo) == 0x000034, "Member 'NPC_Pawn_Parent_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'NPC_Pawn_Parent_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'NPC_Pawn_Parent_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'NPC_Pawn_Parent_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.NPCAlertLevelChanged
// 0x0001 (0x0001 - 0x0000)
struct NPC_Pawn_Parent_C_NPCAlertLevelChanged final
{
public:
	Enum_NPC_AlertLevel                           NPC_AlertLevel_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_NPCAlertLevelChanged) == 0x000001, "Wrong alignment on NPC_Pawn_Parent_C_NPCAlertLevelChanged");
static_assert(sizeof(NPC_Pawn_Parent_C_NPCAlertLevelChanged) == 0x000001, "Wrong size on NPC_Pawn_Parent_C_NPCAlertLevelChanged");
static_assert(offsetof(NPC_Pawn_Parent_C_NPCAlertLevelChanged, NPC_AlertLevel_0) == 0x000000, "Member 'NPC_Pawn_Parent_C_NPCAlertLevelChanged::NPC_AlertLevel_0' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.RequestUpdateNPCAlertLevel
// 0x0001 (0x0001 - 0x0000)
struct NPC_Pawn_Parent_C_RequestUpdateNPCAlertLevel final
{
public:
	Enum_NPC_AlertLevel                           NPC_AlertLevel_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_RequestUpdateNPCAlertLevel) == 0x000001, "Wrong alignment on NPC_Pawn_Parent_C_RequestUpdateNPCAlertLevel");
static_assert(sizeof(NPC_Pawn_Parent_C_RequestUpdateNPCAlertLevel) == 0x000001, "Wrong size on NPC_Pawn_Parent_C_RequestUpdateNPCAlertLevel");
static_assert(offsetof(NPC_Pawn_Parent_C_RequestUpdateNPCAlertLevel, NPC_AlertLevel_0) == 0x000000, "Member 'NPC_Pawn_Parent_C_RequestUpdateNPCAlertLevel::NPC_AlertLevel_0' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.ReceivePossessed
// 0x0008 (0x0008 - 0x0000)
struct NPC_Pawn_Parent_C_ReceivePossessed final
{
public:
	class AController*                            NewController;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_ReceivePossessed) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_ReceivePossessed");
static_assert(sizeof(NPC_Pawn_Parent_C_ReceivePossessed) == 0x000008, "Wrong size on NPC_Pawn_Parent_C_ReceivePossessed");
static_assert(offsetof(NPC_Pawn_Parent_C_ReceivePossessed, NewController) == 0x000000, "Member 'NPC_Pawn_Parent_C_ReceivePossessed::NewController' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct NPC_Pawn_Parent_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(NPC_Pawn_Parent_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_OnDeathPlayEffects");
static_assert(sizeof(NPC_Pawn_Parent_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on NPC_Pawn_Parent_C_OnDeathPlayEffects");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'NPC_Pawn_Parent_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'NPC_Pawn_Parent_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'NPC_Pawn_Parent_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'NPC_Pawn_Parent_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'NPC_Pawn_Parent_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'NPC_Pawn_Parent_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'NPC_Pawn_Parent_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.NPC ParentLaunchVehicle
// 0x0018 (0x0018 - 0x0000)
struct NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle final
{
public:
	class AActor*                                 Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle) == 0x000008, "Wrong alignment on NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle");
static_assert(sizeof(NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle) == 0x000018, "Wrong size on NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle, Vehicle) == 0x000000, "Member 'NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle::Vehicle' has a wrong offset!");
static_assert(offsetof(NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle, Velocity) == 0x000008, "Member 'NPC_Pawn_Parent_C_NPC_ParentLaunchVehicle::Velocity' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.WidgetVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct NPC_Pawn_Parent_C_WidgetVisibilityChanged final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NPC_Pawn_Parent_C_WidgetVisibilityChanged) == 0x000001, "Wrong alignment on NPC_Pawn_Parent_C_WidgetVisibilityChanged");
static_assert(sizeof(NPC_Pawn_Parent_C_WidgetVisibilityChanged) == 0x000001, "Wrong size on NPC_Pawn_Parent_C_WidgetVisibilityChanged");
static_assert(offsetof(NPC_Pawn_Parent_C_WidgetVisibilityChanged, bVisible) == 0x000000, "Member 'NPC_Pawn_Parent_C_WidgetVisibilityChanged::bVisible' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct NPC_Pawn_Parent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_Pawn_Parent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on NPC_Pawn_Parent_C_ReceiveEndPlay");
static_assert(sizeof(NPC_Pawn_Parent_C_ReceiveEndPlay) == 0x000001, "Wrong size on NPC_Pawn_Parent_C_ReceiveEndPlay");
static_assert(offsetof(NPC_Pawn_Parent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'NPC_Pawn_Parent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function NPC_Pawn_Parent.NPC_Pawn_Parent_C.OnDamagePlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct NPC_Pawn_Parent_C_OnDamagePlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
