#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Pawn_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_NPC_AlertLevel_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "EnemyPawn_Parent_Deimos_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_Pawn_Parent.NPC_Pawn_Parent_C
// 0x0230 (0x27B0 - 0x2580)
class ANPC_Pawn_Parent_C : public AEnemyPawn_Parent_Deimos_C
{
public:
	uint8                                         Pad_2574[0x4];                                     // 0x2574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_Pawn_Parent_C;                  // 0x2578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        MovementAudioComponent;                            // 0x2580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNPC_VoiceComponent_C*                  NPC_VoiceComponent;                                // 0x2588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        VOAudioComponent;                                  // 0x2590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWidgetComponent*                   NPCStatusWidget;                                   // 0x2598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_NPC_RecentlyDamaged;                            // 0x25A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NPC_AlertLevel                           NPC_AlertLevel;                                    // 0x25A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	Enum_NPC_AlertLevel                           NPC_AlertLevelPrevious;                            // 0x25A9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25AA[0x6];                                     // 0x25AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<Enum_NPC_AlertLevel, struct FGameplayTag> NPC_AlertLevelToTagMap;                           // 0x25B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         NPC_MaxDistanceFromDamageInstigatorToDrawHealthBar; // 0x2600(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NPC_HealthBarHideTimeAfterDeath;                   // 0x2604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_StatusWidgetHealthBarDisabled;                 // 0x2608(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2609[0x3];                                     // 0x2609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GameplayCue_PickupGrabbed;                         // 0x260C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   NPC_BestLootRarityInInventory;                     // 0x2614(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2615[0x3];                                     // 0x2615(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GrantStartingItemsAbilityTC;                       // 0x2618(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          NPC_DebugPawn;                                     // 0x2638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NPC_ShowInventoryRarityVisuals;                    // 0x2639(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_263A[0x2];                                     // 0x263A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InventoryGlowDelay;                                // 0x263C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         NPC_NumberOfInventoryItemsToDeliverHF;             // 0x2640(0x0020)(Edit, BlueprintVisible)
	bool                                          NPC_SpawnInvisible;                                // 0x2660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2661[0x7];                                     // 0x2661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_NPC_SpawnAbilityTag;                            // 0x2668(0x0020)(Edit, BlueprintVisible)
	bool                                          NPC_IsSpawning;                                    // 0x2688(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2689[0x3];                                     // 0x2689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NPC_OriginalGravityScale;                          // 0x268C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NPC_OriginalRotationRate;                          // 0x2690(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NPC_HasPawnGoal;                                   // 0x269C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269D[0x3];                                     // 0x269D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NPC_PawnGoalActor;                                 // 0x26A0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         NPC_NumberOfInventoryItemsToConsumeBeforeFullHF;   // 0x26A8(0x0020)(Edit, BlueprintVisible)
	bool                                          NPC_PawnIsDestroyingBuildingForNavigation;         // 0x26C8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C9[0x7];                                     // 0x26C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxIdleVODelay;                                    // 0x26D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinIdleVODelay;                                    // 0x26F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         NPC_DeathDropLootDelay;                            // 0x2710(0x0020)(Edit, BlueprintVisible)
	class FName                                   NPC_DeathDropLootTierGroupName;                    // 0x2730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  NPC_DeathDropLootRequiredDamageTags;               // 0x2738(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  NPC_DeathDropLootForbiddenDamageTags;              // 0x2758(0x0020)(Edit, BlueprintVisible)
	bool                                          NPC_HasItemInInventory;                            // 0x2778(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2779[0x3];                                     // 0x2779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           VoiceTag_FullAlertIdle;                            // 0x277C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_Idle;                                     // 0x2784(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_ReturnToIdle;                             // 0x278C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_LostTarget;                               // 0x2794(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_Suspicious;                               // 0x279C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTag_FullAlert;                                // 0x27A4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NPC_Pawn_Parent(int32 EntryPoint);
	void NPCDisableHealthBars();
	void NPCEnableHealthBars();
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void TriggerIdleVO();
	void NPC_InitializeIdleVO();
	void NPCAlertLevelChanged(Enum_NPC_AlertLevel NPC_AlertLevel_0);
	void RequestUpdateNPCAlertLevel(Enum_NPC_AlertLevel NPC_AlertLevel_0);
	void ReceivePossessed(class AController* NewController);
	void NPC_SetupHealthBarOnDeath();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void TestLoot();
	void NPC_ParentLaunchVehicle(class AActor* Vehicle, const struct FVector& Velocity);
	void WidgetVisibilityChanged(bool bVisible);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void GrantStartingItems();
	void ReceiveBeginPlay();
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	bool ShouldUpdateSkeletalMesh();
	void NPC_ApplyRecentlyDamagedTag(class UClass* RecentlyDamagedOverride);
	void NPC_GetAlertLevelInfo(Enum_NPC_AlertLevel* AlertLevel, struct FGameplayTag* AlertLevelTag, bool* ValidDataFound);
	void OnRep_NPC_AlertLevel();
	void NPC_SetBestLootRarityInInventory(EFortRarity* NPC_BestLootRarityInInventory_0);
	void NPC_GetInventoryInformation(bool* HasItemInInventory, int32* TotalNumberOfInventoryItems, int32* LastInventoryItemIndex, bool* HasEnoughItemsToDeliver, bool* ConsumedEnoughItemsToBeConsideredFull);
	void NPC_PawnDebugMessage(const class FString& String, bool OnlyWhenDebug);
	void NPC_SendGameplayCuePickupGrabbed();
	void OnRep_NPC_BestLootRarityInInventory();
	void NPC_PickupGrabbed(class AFortPickup* FortPickupGrabbed);
	void NPC_PickupDropped(class AFortPickup* FortPickupDropped);
	void NPC_ScalableFloatIsValid(const struct FScalableFloat& ScalableFloat, bool* Valid);
	void NPC_GetScalableFloatHotfixValue(const struct FScalableFloat& ScalableFloatHotfix, float AtLevel, bool* AsBool, int32* AsIntRounded, float* AsFloat);
	void NPC_SetReturnGatheredLootToBlackboard();
	void NPC_ResetOriginalGravityScale();
	void NPC_ResetOriginalRotationRate();
	void NPC_SetLootCollectionPhaseCompleteToBlackboard(bool LootCollectionPhaseComplete);
	void NPC_ApplyGameplayEffectWithMMRScaling(class AActor* Actor, class UClass* GE_Class);
	void NPC_TryToDropLootOnDeath(const struct FGameplayTagContainer& DamageTags, bool* CanDropLoot);
	void NPC_HandleAlertLevelVoice();
	void NPC_CheckIsInSafeZone(bool* TestSucceeded, bool* isInSafeZone);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Pawn_Parent_C">();
	}
	static class ANPC_Pawn_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_Pawn_Parent_C>();
	}
};
static_assert(alignof(ANPC_Pawn_Parent_C) == 0x000010, "Wrong alignment on ANPC_Pawn_Parent_C");
static_assert(sizeof(ANPC_Pawn_Parent_C) == 0x0027B0, "Wrong size on ANPC_Pawn_Parent_C");
static_assert(offsetof(ANPC_Pawn_Parent_C, UberGraphFrame_NPC_Pawn_Parent_C) == 0x002578, "Member 'ANPC_Pawn_Parent_C::UberGraphFrame_NPC_Pawn_Parent_C' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, MovementAudioComponent) == 0x002580, "Member 'ANPC_Pawn_Parent_C::MovementAudioComponent' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_VoiceComponent) == 0x002588, "Member 'ANPC_Pawn_Parent_C::NPC_VoiceComponent' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, VOAudioComponent) == 0x002590, "Member 'ANPC_Pawn_Parent_C::VOAudioComponent' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPCStatusWidget) == 0x002598, "Member 'ANPC_Pawn_Parent_C::NPCStatusWidget' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, GE_NPC_RecentlyDamaged) == 0x0025A0, "Member 'ANPC_Pawn_Parent_C::GE_NPC_RecentlyDamaged' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_AlertLevel) == 0x0025A8, "Member 'ANPC_Pawn_Parent_C::NPC_AlertLevel' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_AlertLevelPrevious) == 0x0025A9, "Member 'ANPC_Pawn_Parent_C::NPC_AlertLevelPrevious' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_AlertLevelToTagMap) == 0x0025B0, "Member 'ANPC_Pawn_Parent_C::NPC_AlertLevelToTagMap' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_MaxDistanceFromDamageInstigatorToDrawHealthBar) == 0x002600, "Member 'ANPC_Pawn_Parent_C::NPC_MaxDistanceFromDamageInstigatorToDrawHealthBar' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_HealthBarHideTimeAfterDeath) == 0x002604, "Member 'ANPC_Pawn_Parent_C::NPC_HealthBarHideTimeAfterDeath' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_StatusWidgetHealthBarDisabled) == 0x002608, "Member 'ANPC_Pawn_Parent_C::NPC_StatusWidgetHealthBarDisabled' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, GameplayCue_PickupGrabbed) == 0x00260C, "Member 'ANPC_Pawn_Parent_C::GameplayCue_PickupGrabbed' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_BestLootRarityInInventory) == 0x002614, "Member 'ANPC_Pawn_Parent_C::NPC_BestLootRarityInInventory' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, GrantStartingItemsAbilityTC) == 0x002618, "Member 'ANPC_Pawn_Parent_C::GrantStartingItemsAbilityTC' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_DebugPawn) == 0x002638, "Member 'ANPC_Pawn_Parent_C::NPC_DebugPawn' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_ShowInventoryRarityVisuals) == 0x002639, "Member 'ANPC_Pawn_Parent_C::NPC_ShowInventoryRarityVisuals' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, InventoryGlowDelay) == 0x00263C, "Member 'ANPC_Pawn_Parent_C::InventoryGlowDelay' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_NumberOfInventoryItemsToDeliverHF) == 0x002640, "Member 'ANPC_Pawn_Parent_C::NPC_NumberOfInventoryItemsToDeliverHF' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_SpawnInvisible) == 0x002660, "Member 'ANPC_Pawn_Parent_C::NPC_SpawnInvisible' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, TC_NPC_SpawnAbilityTag) == 0x002668, "Member 'ANPC_Pawn_Parent_C::TC_NPC_SpawnAbilityTag' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_IsSpawning) == 0x002688, "Member 'ANPC_Pawn_Parent_C::NPC_IsSpawning' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_OriginalGravityScale) == 0x00268C, "Member 'ANPC_Pawn_Parent_C::NPC_OriginalGravityScale' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_OriginalRotationRate) == 0x002690, "Member 'ANPC_Pawn_Parent_C::NPC_OriginalRotationRate' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_HasPawnGoal) == 0x00269C, "Member 'ANPC_Pawn_Parent_C::NPC_HasPawnGoal' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_PawnGoalActor) == 0x0026A0, "Member 'ANPC_Pawn_Parent_C::NPC_PawnGoalActor' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_NumberOfInventoryItemsToConsumeBeforeFullHF) == 0x0026A8, "Member 'ANPC_Pawn_Parent_C::NPC_NumberOfInventoryItemsToConsumeBeforeFullHF' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_PawnIsDestroyingBuildingForNavigation) == 0x0026C8, "Member 'ANPC_Pawn_Parent_C::NPC_PawnIsDestroyingBuildingForNavigation' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, MaxIdleVODelay) == 0x0026D0, "Member 'ANPC_Pawn_Parent_C::MaxIdleVODelay' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, MinIdleVODelay) == 0x0026F0, "Member 'ANPC_Pawn_Parent_C::MinIdleVODelay' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_DeathDropLootDelay) == 0x002710, "Member 'ANPC_Pawn_Parent_C::NPC_DeathDropLootDelay' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_DeathDropLootTierGroupName) == 0x002730, "Member 'ANPC_Pawn_Parent_C::NPC_DeathDropLootTierGroupName' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_DeathDropLootRequiredDamageTags) == 0x002738, "Member 'ANPC_Pawn_Parent_C::NPC_DeathDropLootRequiredDamageTags' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_DeathDropLootForbiddenDamageTags) == 0x002758, "Member 'ANPC_Pawn_Parent_C::NPC_DeathDropLootForbiddenDamageTags' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, NPC_HasItemInInventory) == 0x002778, "Member 'ANPC_Pawn_Parent_C::NPC_HasItemInInventory' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, VoiceTag_FullAlertIdle) == 0x00277C, "Member 'ANPC_Pawn_Parent_C::VoiceTag_FullAlertIdle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, VoiceTag_Idle) == 0x002784, "Member 'ANPC_Pawn_Parent_C::VoiceTag_Idle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, VoiceTag_ReturnToIdle) == 0x00278C, "Member 'ANPC_Pawn_Parent_C::VoiceTag_ReturnToIdle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, VoiceTag_LostTarget) == 0x002794, "Member 'ANPC_Pawn_Parent_C::VoiceTag_LostTarget' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, VoiceTag_Suspicious) == 0x00279C, "Member 'ANPC_Pawn_Parent_C::VoiceTag_Suspicious' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Parent_C, VoiceTag_FullAlert) == 0x0027A4, "Member 'ANPC_Pawn_Parent_C::VoiceTag_FullAlert' has a wrong offset!");

}

