#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pistol_Revolver_SideAction_AnimBP1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pistol_Revolver_SideAction_AnimBP1.Pistol_Revolver_SideAction_AnimBP1_C
// 0x07E0 (0x0AA0 - 0x02C0)
class UPistol_Revolver_SideAction_AnimBP1_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D0(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0300(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0348(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x04B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0500(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0528(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x05A0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x05D0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0648(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0678(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x06F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0720(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0798(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x07C8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0840(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0870(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x08E8(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x0918(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0930(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0960(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A10(0x0078)()
	int32                                         DrumPositionCount;                                 // 0x0A88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRotateToPos1;                                // 0x0A8C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos2;                                // 0x0A8D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos3;                                // 0x0A8E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos4;                                // 0x0A8F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos5;                                // 0x0A90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos6;                                // 0x0A91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Pistol_Revolver_SideAction_AnimBP1(int32 EntryPoint);
	void AnimNotify_Revolver_RotChamber();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pistol_Revolver_SideAction_AnimBP1_C">();
	}
	static class UPistol_Revolver_SideAction_AnimBP1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPistol_Revolver_SideAction_AnimBP1_C>();
	}
};
static_assert(alignof(UPistol_Revolver_SideAction_AnimBP1_C) == 0x000010, "Wrong alignment on UPistol_Revolver_SideAction_AnimBP1_C");
static_assert(sizeof(UPistol_Revolver_SideAction_AnimBP1_C) == 0x000AA0, "Wrong size on UPistol_Revolver_SideAction_AnimBP1_C");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, UberGraphFrame) == 0x0002C0, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0002C8, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_Root) == 0x0002D0, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_Slot) == 0x000300, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_ApplyAdditive) == 0x000348, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_TransitionResult_6) == 0x000410, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_TransitionResult_5) == 0x000438, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_TransitionResult_4) == 0x000460, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_TransitionResult_3) == 0x000488, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_TransitionResult_2) == 0x0004B0, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_TransitionResult_1) == 0x0004D8, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_TransitionResult) == 0x000500, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_SequencePlayer_6) == 0x000528, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_StateResult_6) == 0x0005A0, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_SequencePlayer_5) == 0x0005D0, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_StateResult_5) == 0x000648, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_SequencePlayer_4) == 0x000678, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_StateResult_4) == 0x0006F0, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_SequencePlayer_3) == 0x000720, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_StateResult_3) == 0x000798, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_SequencePlayer_2) == 0x0007C8, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_StateResult_2) == 0x000840, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_SequencePlayer_1) == 0x000870, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_StateResult_1) == 0x0008E8, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_IdentityPose) == 0x000918, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_StateResult) == 0x000930, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_StateMachine) == 0x000960, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, AnimGraphNode_SequencePlayer) == 0x000A10, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, DrumPositionCount) == 0x000A88, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::DrumPositionCount' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, ShouldRotateToPos1) == 0x000A8C, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::ShouldRotateToPos1' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, ShouldRotateToPos2) == 0x000A8D, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::ShouldRotateToPos2' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, ShouldRotateToPos3) == 0x000A8E, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::ShouldRotateToPos3' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, ShouldRotateToPos4) == 0x000A8F, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::ShouldRotateToPos4' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, ShouldRotateToPos5) == 0x000A90, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::ShouldRotateToPos5' has a wrong offset!");
static_assert(offsetof(UPistol_Revolver_SideAction_AnimBP1_C, ShouldRotateToPos6) == 0x000A91, "Member 'UPistol_Revolver_SideAction_AnimBP1_C::ShouldRotateToPos6' has a wrong offset!");

}

