#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_NPC_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Prj_NPC_Parent.Prj_NPC_Parent_C.ExecuteUbergraph_Prj_NPC_Parent
// 0x0398 (0x0398 - 0x0000)
struct Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0058(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0120(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0130(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetGoalActor_ReturnValue;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation;   // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal;     // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition; // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfo_WaterDepth;           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWaterSurfaceInfo_WaterBodyIdx;         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterVelocity;        // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_NPC_ProjectileFXLocation_1;     // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NPCPorjectileFXNormal_1;        // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_InternalImpactGC;               // 0x01EC(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WaterBodyIndex;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x01F8(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_NPC_ProjectileFXLocation;       // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NPCPorjectileFXNormal;          // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ImpactGC;                       // 0x02CC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HitPawn;                        // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x02E0(0x00B8)(ContainsInstancedReference)
};
static_assert(alignof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent) == 0x000008, "Wrong alignment on Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent");
static_assert(sizeof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent) == 0x000398, "Wrong size on Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, EntryPoint) == 0x000000, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_MyComp) == 0x000018, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_Other) == 0x000020, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_OtherComp) == 0x000028, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_bSelfMoved) == 0x000030, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_HitLocation) == 0x000034, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_HitNormal) == 0x000040, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_NormalImpulse) == 0x00004C, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_Hit) == 0x000058, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_DynamicCast_AsPawn) == 0x0000E8, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F4, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000100, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00010C, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000118, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_HitActors) == 0x000120, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_Event_HitResults) == 0x000130, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_GetInstigatorController_ReturnValue) == 0x000140, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_DynamicCast_AsFort_AIController) == 0x000148, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_GetGoalActor_ReturnValue) == 0x000158, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_GetGoalActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000160, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_DynamicCast_AsFort_Pawn) == 0x000168, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_DynamicCast_bSuccess_2) == 0x000170, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_ComponentBoundEvent_WaterBody) == 0x000178, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x000180, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x000188, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00018C, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation) == 0x000198, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal) == 0x0001A4, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition) == 0x0001B0, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_GetWaterSurfaceInfo_WaterDepth) == 0x0001BC, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_GetWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_GetWaterSurfaceInfo_WaterBodyIdx) == 0x0001C0, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_GetWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_GetWaterSurfaceInfo_WaterVelocity) == 0x0001C4, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_GetWaterSurfaceInfo_WaterVelocity' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0001D0, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_CustomEvent_NPC_ProjectileFXLocation_1) == 0x0001D4, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_CustomEvent_NPC_ProjectileFXLocation_1' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_CustomEvent_NPCPorjectileFXNormal_1) == 0x0001E0, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_CustomEvent_NPCPorjectileFXNormal_1' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_CustomEvent_InternalImpactGC) == 0x0001EC, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_CustomEvent_InternalImpactGC' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_CustomEvent_WaterBodyIndex) == 0x0001F4, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_CustomEvent_WaterBodyIndex' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0001F8, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0002B0, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_CustomEvent_NPC_ProjectileFXLocation) == 0x0002B4, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_CustomEvent_NPC_ProjectileFXLocation' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_CustomEvent_NPCPorjectileFXNormal) == 0x0002C0, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_CustomEvent_NPCPorjectileFXNormal' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_CustomEvent_ImpactGC) == 0x0002CC, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_CustomEvent_ImpactGC' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, K2Node_CustomEvent_HitPawn) == 0x0002D4, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::K2Node_CustomEvent_HitPawn' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0002D8, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x0002DC, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x0002E0, "Member 'Prj_NPC_Parent_C_ExecuteUbergraph_Prj_NPC_Parent::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");

// Function Prj_NPC_Parent.Prj_NPC_Parent_C.RegularExplode
// 0x0024 (0x0024 - 0x0000)
struct Prj_NPC_Parent_C_RegularExplode final
{
public:
	struct FVector                                NPC_ProjectileFXLocation_0;                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NPCPorjectileFXNormal_0;                           // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ImpactGC_0;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          HitPawn_0;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_NPC_Parent_C_RegularExplode) == 0x000004, "Wrong alignment on Prj_NPC_Parent_C_RegularExplode");
static_assert(sizeof(Prj_NPC_Parent_C_RegularExplode) == 0x000024, "Wrong size on Prj_NPC_Parent_C_RegularExplode");
static_assert(offsetof(Prj_NPC_Parent_C_RegularExplode, NPC_ProjectileFXLocation_0) == 0x000000, "Member 'Prj_NPC_Parent_C_RegularExplode::NPC_ProjectileFXLocation_0' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_RegularExplode, NPCPorjectileFXNormal_0) == 0x00000C, "Member 'Prj_NPC_Parent_C_RegularExplode::NPCPorjectileFXNormal_0' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_RegularExplode, ImpactGC_0) == 0x000018, "Member 'Prj_NPC_Parent_C_RegularExplode::ImpactGC_0' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_RegularExplode, HitPawn_0) == 0x000020, "Member 'Prj_NPC_Parent_C_RegularExplode::HitPawn_0' has a wrong offset!");

// Function Prj_NPC_Parent.Prj_NPC_Parent_C.WaterExplode
// 0x0024 (0x0024 - 0x0000)
struct Prj_NPC_Parent_C_WaterExplode final
{
public:
	struct FVector                                NPC_ProjectileFXLocation_0;                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NPCPorjectileFXNormal_0;                           // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InternalImpactGC_0;                                // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         WaterBodyIndex_0;                                  // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_NPC_Parent_C_WaterExplode) == 0x000004, "Wrong alignment on Prj_NPC_Parent_C_WaterExplode");
static_assert(sizeof(Prj_NPC_Parent_C_WaterExplode) == 0x000024, "Wrong size on Prj_NPC_Parent_C_WaterExplode");
static_assert(offsetof(Prj_NPC_Parent_C_WaterExplode, NPC_ProjectileFXLocation_0) == 0x000000, "Member 'Prj_NPC_Parent_C_WaterExplode::NPC_ProjectileFXLocation_0' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_WaterExplode, NPCPorjectileFXNormal_0) == 0x00000C, "Member 'Prj_NPC_Parent_C_WaterExplode::NPCPorjectileFXNormal_0' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_WaterExplode, InternalImpactGC_0) == 0x000018, "Member 'Prj_NPC_Parent_C_WaterExplode::InternalImpactGC_0' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_WaterExplode, WaterBodyIndex_0) == 0x000020, "Member 'Prj_NPC_Parent_C_WaterExplode::WaterBodyIndex_0' has a wrong offset!");

// Function Prj_NPC_Parent.Prj_NPC_Parent_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent_0;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent_0) == 0x000008, "Member 'Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent_0' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'Prj_NPC_Parent_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function Prj_NPC_Parent.Prj_NPC_Parent_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct Prj_NPC_Parent_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Prj_NPC_Parent_C_OnExploded) == 0x000008, "Wrong alignment on Prj_NPC_Parent_C_OnExploded");
static_assert(sizeof(Prj_NPC_Parent_C_OnExploded) == 0x000020, "Wrong size on Prj_NPC_Parent_C_OnExploded");
static_assert(offsetof(Prj_NPC_Parent_C_OnExploded, HitActors) == 0x000000, "Member 'Prj_NPC_Parent_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_OnExploded, HitResults) == 0x000010, "Member 'Prj_NPC_Parent_C_OnExploded::HitResults' has a wrong offset!");

// Function Prj_NPC_Parent.Prj_NPC_Parent_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct Prj_NPC_Parent_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_NPC_Parent_C_ReceiveHit) == 0x000008, "Wrong alignment on Prj_NPC_Parent_C_ReceiveHit");
static_assert(sizeof(Prj_NPC_Parent_C_ReceiveHit) == 0x0000D0, "Wrong size on Prj_NPC_Parent_C_ReceiveHit");
static_assert(offsetof(Prj_NPC_Parent_C_ReceiveHit, MyComp) == 0x000000, "Member 'Prj_NPC_Parent_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ReceiveHit, Other) == 0x000008, "Member 'Prj_NPC_Parent_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Prj_NPC_Parent_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_NPC_Parent_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'Prj_NPC_Parent_C_ReceiveHit::bSelfMoved' has a wrong offset!");
