#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_HighTower_Date_ChainLightning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_HighTower_Date_ChainLightning.Prj_HighTower_Date_ChainLightning_C
// 0x0118 (0x0990 - 0x0878)
class APrj_HighTower_Date_ChainLightning_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TracerMesh_Outer;                                  // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TracerMesh;                                        // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ElecticBall;                                       // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HideAndKill;                                       // 0x08A0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_8A1[0x7];                                      // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                ChainLightningTargets;                             // 0x08A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentChainLightningTraceTarget;                  // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        FoundChainTarget;                                  // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Targeted;                                       // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_ChainLightning;                                 // 0x08D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Targeted_GrantedTag;                               // 0x08E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_TargetingApplication;                          // 0x08E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ChainLightningInterval;                            // 0x08F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            FortAbilitySystemComponent;                        // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ChainLightningRange;                               // 0x0900(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxChainTargets;                                   // 0x0920(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_Damage;                                         // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         HitTargets;                                        // 0x0948(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         IntervalBetweenChain;                              // 0x0958(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Starting_Location;                                 // 0x0978(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tracer_Lifetime;                                   // 0x0984(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Explosion;                                      // 0x0988(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_HighTower_Date_ChainLightning(int32 EntryPoint);
	void GameplayCueMulticast(class AActor* Target, const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& CueParameters);
	void ReceiveBeginPlay();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnRep_HideAndKill();
	void FindChainLightningTargets(class AActor* HitActor_0);
	void chainlightning(class AActor* InputPin, class AFortPlayerPawn** AsFort_Player_Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_HighTower_Date_ChainLightning_C">();
	}
	static class APrj_HighTower_Date_ChainLightning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_HighTower_Date_ChainLightning_C>();
	}
};
static_assert(alignof(APrj_HighTower_Date_ChainLightning_C) == 0x000008, "Wrong alignment on APrj_HighTower_Date_ChainLightning_C");
static_assert(sizeof(APrj_HighTower_Date_ChainLightning_C) == 0x000990, "Wrong size on APrj_HighTower_Date_ChainLightning_C");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, UberGraphFrame) == 0x000878, "Member 'APrj_HighTower_Date_ChainLightning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, TracerMesh_Outer) == 0x000880, "Member 'APrj_HighTower_Date_ChainLightning_C::TracerMesh_Outer' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, TracerMesh) == 0x000888, "Member 'APrj_HighTower_Date_ChainLightning_C::TracerMesh' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, Audio) == 0x000890, "Member 'APrj_HighTower_Date_ChainLightning_C::Audio' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, ElecticBall) == 0x000898, "Member 'APrj_HighTower_Date_ChainLightning_C::ElecticBall' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, HideAndKill) == 0x0008A0, "Member 'APrj_HighTower_Date_ChainLightning_C::HideAndKill' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, ChainLightningTargets) == 0x0008A8, "Member 'APrj_HighTower_Date_ChainLightning_C::ChainLightningTargets' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, HitActor) == 0x0008B8, "Member 'APrj_HighTower_Date_ChainLightning_C::HitActor' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, CurrentChainLightningTraceTarget) == 0x0008C0, "Member 'APrj_HighTower_Date_ChainLightning_C::CurrentChainLightningTraceTarget' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, FoundChainTarget) == 0x0008C8, "Member 'APrj_HighTower_Date_ChainLightning_C::FoundChainTarget' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, GE_Targeted) == 0x0008D0, "Member 'APrj_HighTower_Date_ChainLightning_C::GE_Targeted' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, GC_ChainLightning) == 0x0008D8, "Member 'APrj_HighTower_Date_ChainLightning_C::GC_ChainLightning' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, Targeted_GrantedTag) == 0x0008E0, "Member 'APrj_HighTower_Date_ChainLightning_C::Targeted_GrantedTag' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, Tag_TargetingApplication) == 0x0008E8, "Member 'APrj_HighTower_Date_ChainLightning_C::Tag_TargetingApplication' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, ChainLightningInterval) == 0x0008F0, "Member 'APrj_HighTower_Date_ChainLightning_C::ChainLightningInterval' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, FortAbilitySystemComponent) == 0x0008F8, "Member 'APrj_HighTower_Date_ChainLightning_C::FortAbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, ChainLightningRange) == 0x000900, "Member 'APrj_HighTower_Date_ChainLightning_C::ChainLightningRange' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, MaxChainTargets) == 0x000920, "Member 'APrj_HighTower_Date_ChainLightning_C::MaxChainTargets' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, GE_Damage) == 0x000940, "Member 'APrj_HighTower_Date_ChainLightning_C::GE_Damage' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, HitTargets) == 0x000948, "Member 'APrj_HighTower_Date_ChainLightning_C::HitTargets' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, IntervalBetweenChain) == 0x000958, "Member 'APrj_HighTower_Date_ChainLightning_C::IntervalBetweenChain' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, Starting_Location) == 0x000978, "Member 'APrj_HighTower_Date_ChainLightning_C::Starting_Location' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, Tracer_Lifetime) == 0x000984, "Member 'APrj_HighTower_Date_ChainLightning_C::Tracer_Lifetime' has a wrong offset!");
static_assert(offsetof(APrj_HighTower_Date_ChainLightning_C, GC_Explosion) == 0x000988, "Member 'APrj_HighTower_Date_ChainLightning_C::GC_Explosion' has a wrong offset!");

}

