#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_HighTower_Date_BallLightning

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Prj_HighTower_Date_BallLightning.Prj_HighTower_Date_BallLightning_C.ExecuteUbergraph_Prj_HighTower_Date_BallLightning
// 0x0280 (0x0280 - 0x0000)
struct Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation; // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal; // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition; // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastWaterSurfaceInfo_WaterDepth;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx;     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterVelocity;    // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurieActive_ReturnValue;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0068(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0078(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0xC];                                       // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurieActive_ReturnValue_1;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0120(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01B0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DistanceBetweenTwoVectors_Distance;       // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning) == 0x000010, "Wrong alignment on Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning");
static_assert(sizeof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning) == 0x000280, "Wrong size on Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, EntryPoint) == 0x000000, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_IsServer_ReturnValue) == 0x000005, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_ComponentBoundEvent_WaterBody) == 0x000008, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x000010, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x000018, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation) == 0x00001C, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal) == 0x000028, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition) == 0x000034, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetLastWaterSurfaceInfo_WaterDepth) == 0x000040, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetLastWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx) == 0x000044, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetLastWaterSurfaceInfo_WaterVelocity) == 0x000048, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetLastWaterSurfaceInfo_WaterVelocity' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_IsCurieActive_ReturnValue) == 0x000054, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_IsCurieActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_MakeRotFromX_ReturnValue) == 0x000058, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_HitActors) == 0x000068, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_HitResults) == 0x000078, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000088, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_IsCurieActive_ReturnValue_1) == 0x0000D0, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_IsCurieActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_SpawnBuildingGameplayActor_ReturnValue) == 0x0000D8, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_SpawnBuildingGameplayActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_MyComp) == 0x0000E0, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_Other) == 0x0000E8, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_OtherComp) == 0x0000F0, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_bSelfMoved) == 0x0000F8, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_HitLocation) == 0x0000FC, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_HitNormal) == 0x000108, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_NormalImpulse) == 0x000114, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_Event_Hit) == 0x000120, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_MakeTransform_ReturnValue_1) == 0x0001B0, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001E0, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_SpawnBuildingGameplayActor_ReturnValue_1) == 0x0001E8, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_SpawnBuildingGameplayActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetInstigator_ReturnValue) == 0x0001F0, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, Temp_bool_IsClosed_Variable) == 0x0001F8, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000200, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000208, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000214, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_DistanceBetweenTwoVectors_Distance) == 0x000220, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_DistanceBetweenTwoVectors_Distance' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetValueAtLevel_ReturnValue) == 0x000224, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000228, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_FTrunc_ReturnValue) == 0x00022C, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_Conv_IntToBool_ReturnValue) == 0x000230, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_BooleanAND_ReturnValue) == 0x000231, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000234, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_BooleanAND_ReturnValue_1) == 0x000238, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_FTrunc_ReturnValue_1) == 0x00023C, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000240, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_BooleanAND_ReturnValue_2) == 0x000241, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000244, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, K2Node_CustomEvent_Rotation) == 0x000250, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00025C, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000268, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning, Temp_bool_Has_Been_Initd_Variable) == 0x000270, "Member 'Prj_HighTower_Date_BallLightning_C_ExecuteUbergraph_Prj_HighTower_Date_BallLightning::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function Prj_HighTower_Date_BallLightning.Prj_HighTower_Date_BallLightning_C.SplashFX
// 0x000C (0x000C - 0x0000)
struct Prj_HighTower_Date_BallLightning_C_SplashFX final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_HighTower_Date_BallLightning_C_SplashFX) == 0x000004, "Wrong alignment on Prj_HighTower_Date_BallLightning_C_SplashFX");
static_assert(sizeof(Prj_HighTower_Date_BallLightning_C_SplashFX) == 0x00000C, "Wrong size on Prj_HighTower_Date_BallLightning_C_SplashFX");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_SplashFX, Rotation) == 0x000000, "Member 'Prj_HighTower_Date_BallLightning_C_SplashFX::Rotation' has a wrong offset!");

// Function Prj_HighTower_Date_BallLightning.Prj_HighTower_Date_BallLightning_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct Prj_HighTower_Date_BallLightning_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Prj_HighTower_Date_BallLightning_C_OnExploded) == 0x000008, "Wrong alignment on Prj_HighTower_Date_BallLightning_C_OnExploded");
static_assert(sizeof(Prj_HighTower_Date_BallLightning_C_OnExploded) == 0x000020, "Wrong size on Prj_HighTower_Date_BallLightning_C_OnExploded");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_OnExploded, HitActors) == 0x000000, "Member 'Prj_HighTower_Date_BallLightning_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_OnExploded, HitResults) == 0x000010, "Member 'Prj_HighTower_Date_BallLightning_C_OnExploded::HitResults' has a wrong offset!");

// Function Prj_HighTower_Date_BallLightning.Prj_HighTower_Date_BallLightning_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent_0;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent_0) == 0x000008, "Member 'Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent_0' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'Prj_HighTower_Date_BallLightning_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function Prj_HighTower_Date_BallLightning.Prj_HighTower_Date_BallLightning_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct Prj_HighTower_Date_BallLightning_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_HighTower_Date_BallLightning_C_ReceiveHit) == 0x000008, "Wrong alignment on Prj_HighTower_Date_BallLightning_C_ReceiveHit");
static_assert(sizeof(Prj_HighTower_Date_BallLightning_C_ReceiveHit) == 0x0000D0, "Wrong size on Prj_HighTower_Date_BallLightning_C_ReceiveHit");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ReceiveHit, MyComp) == 0x000000, "Member 'Prj_HighTower_Date_BallLightning_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ReceiveHit, Other) == 0x000008, "Member 'Prj_HighTower_Date_BallLightning_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Prj_HighTower_Date_BallLightning_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'Prj_HighTower_Date_BallLightning_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'Prj_HighTower_Date_BallLightning_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ReceiveHit, HitNormal) == 0x000028, "Member 'Prj_HighTower_Date_BallLightning_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'Prj_HighTower_Date_BallLightning_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_ReceiveHit, Hit) == 0x000040, "Member 'Prj_HighTower_Date_BallLightning_C_ReceiveHit::Hit' has a wrong offset!");

// Function Prj_HighTower_Date_BallLightning.Prj_HighTower_Date_BallLightning_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct Prj_HighTower_Date_BallLightning_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_HighTower_Date_BallLightning_C_UserConstructionScript) == 0x000001, "Wrong alignment on Prj_HighTower_Date_BallLightning_C_UserConstructionScript");
static_assert(sizeof(Prj_HighTower_Date_BallLightning_C_UserConstructionScript) == 0x000001, "Wrong size on Prj_HighTower_Date_BallLightning_C_UserConstructionScript");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_UserConstructionScript, CallFunc_IsServer_ReturnValue) == 0x000000, "Member 'Prj_HighTower_Date_BallLightning_C_UserConstructionScript::CallFunc_IsServer_ReturnValue' has a wrong offset!");

// Function Prj_HighTower_Date_BallLightning.Prj_HighTower_Date_BallLightning_C.FindMeshANgle
// 0x0050 (0x0050 - 0x0000)
struct Prj_HighTower_Date_BallLightning_C_FindMeshANgle final
{
public:
	struct FVector                                HitLoc;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NewParam;                                          // 0x0020(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_HighTower_Date_BallLightning_C_FindMeshANgle) == 0x000010, "Wrong alignment on Prj_HighTower_Date_BallLightning_C_FindMeshANgle");
static_assert(sizeof(Prj_HighTower_Date_BallLightning_C_FindMeshANgle) == 0x000050, "Wrong size on Prj_HighTower_Date_BallLightning_C_FindMeshANgle");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_FindMeshANgle, HitLoc) == 0x000000, "Member 'Prj_HighTower_Date_BallLightning_C_FindMeshANgle::HitLoc' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_FindMeshANgle, HitNormal) == 0x00000C, "Member 'Prj_HighTower_Date_BallLightning_C_FindMeshANgle::HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_HighTower_Date_BallLightning_C_FindMeshANgle, NewParam) == 0x000020, "Member 'Prj_HighTower_Date_BallLightning_C_FindMeshANgle::NewParam' has a wrong offset!");

}

