#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Chaplin_Uncharged_Child

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Prj_Chaplin_Uncharged_Child.Prj_Chaplin_Uncharged_Child_C.ExecuteUbergraph_Prj_Chaplin_Uncharged_Child
// 0x05C0 (0x05C0 - 0x0000)
struct Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_ComponentBoundEvent_WaterBody;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_ComponentBoundEvent_WaterInteractionComponent; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFirstBody;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp_1;                          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x0080(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation;   // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal;     // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition; // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfo_WaterDepth;           // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWaterSurfaceInfo_WaterBodyIdx;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterVelocity;        // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location_1;                     // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Normal_1;                       // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ImpactGC_1;                     // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHitPawn;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0190(0x00B8)(ContainsInstancedReference)
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0248(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0258(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetMuzzleLocation_ReturnValue;            // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetGoalActor_ReturnValue;                 // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x02C8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bIsOverlap;                           // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_DynamicCast_AsFort_Water_Body_Actor;        // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Normal;                         // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ImpactGC;                       // 0x037C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WaterLevel;                     // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0388(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation_1; // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal_1;   // 0x045C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition_1; // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterSurfaceInfo_WaterDepth_1;         // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWaterSurfaceInfo_WaterBodyIdx_1;       // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceInfo_WaterVelocity_1;      // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48A[0x2];                                      // 0x048A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x048C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51A[0x2];                                      // 0x051A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0524(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x053C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0548(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0568(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0584(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0590(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x3];                                      // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x05BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child) == 0x000008, "Wrong alignment on Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child");
static_assert(sizeof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child) == 0x0005C0, "Wrong size on Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, EntryPoint) == 0x000000, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000004, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000010, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_ComponentBoundEvent_WaterBody) == 0x000028, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_ComponentBoundEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_ComponentBoundEvent_WaterInteractionComponent) == 0x000030, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_ComponentBoundEvent_WaterInteractionComponent' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_ComponentBoundEvent_bIsFirstBody) == 0x000038, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_ComponentBoundEvent_bIsFirstBody' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_MyComp) == 0x000040, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_Other) == 0x000048, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_OtherComp_1) == 0x000050, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_bSelfMoved) == 0x000058, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_HitLocation) == 0x00005C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_HitNormal) == 0x000068, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_NormalImpulse) == 0x000074, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_Hit_1) == 0x000080, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_Hit_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_AsPawn) == 0x000110, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00011C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation) == 0x000128, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal) == 0x000134, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition) == 0x000140, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterDepth) == 0x00014C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterDepth' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterBodyIdx) == 0x000150, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterBodyIdx' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterVelocity) == 0x000154, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterVelocity' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_CustomEvent_Location_1) == 0x000160, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_CustomEvent_Location_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_CustomEvent_Normal_1) == 0x00016C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_CustomEvent_Normal_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_CustomEvent_ImpactGC_1) == 0x000178, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_CustomEvent_ImpactGC_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_CustomEvent_bHitPawn) == 0x000180, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_CustomEvent_bHitPawn' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000184, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000188, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000190, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_HitActors) == 0x000248, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_HitResults) == 0x000258, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000268, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_bSuccess_1) == 0x000270, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetInstigatorController_ReturnValue) == 0x000278, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_AsFort_AIController) == 0x000280, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_bSuccess_2) == 0x000288, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetMuzzleLocation_ReturnValue) == 0x00028C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetMuzzleLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetGoalActor_ReturnValue) == 0x000298, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetGoalActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_AsFort_Pawn) == 0x0002A0, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_bSuccess_3) == 0x0002A8, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0002B0, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_OtherActor) == 0x0002B8, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_OtherComp) == 0x0002C0, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_HitResult) == 0x0002C8, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_bIsOverlap) == 0x000354, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_bIsOverlap' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_AsFort_Water_Body_Actor) == 0x000358, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_AsFort_Water_Body_Actor' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_bSuccess_4) == 0x000360, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_CustomEvent_Location) == 0x000364, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_CustomEvent_Normal) == 0x000370, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_CustomEvent_Normal' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_CustomEvent_ImpactGC) == 0x00037C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_CustomEvent_ImpactGC' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_CustomEvent_WaterLevel) == 0x000384, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_CustomEvent_WaterLevel' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000388, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x000440, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000444, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation_1) == 0x000450, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterPlaneLocation_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal_1) == 0x00045C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterPlaneNormal_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition_1) == 0x000468, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterSurfacePosition_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterDepth_1) == 0x000474, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterDepth_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterBodyIdx_1) == 0x000478, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterBodyIdx_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_GetWaterSurfaceInfo_WaterVelocity_1) == 0x00047C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_GetWaterSurfaceInfo_WaterVelocity_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_IsDedicatedServer_ReturnValue) == 0x000488, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000489, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_Event_Hit) == 0x00048C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_bBlockingHit) == 0x000518, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_bInitialOverlap) == 0x000519, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_Time) == 0x00051C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_Distance) == 0x000520, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_Location) == 0x000524, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_ImpactPoint) == 0x000530, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_Normal) == 0x00053C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_ImpactNormal) == 0x000548, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_PhysMat) == 0x000558, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_HitActor) == 0x000560, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_HitComponent) == 0x000568, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_HitBoneName) == 0x000570, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_HitItem) == 0x000578, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_ElementIndex) == 0x00057C, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_FaceIndex) == 0x000580, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_TraceStart) == 0x000584, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_BreakHitResult_TraceEnd) == 0x000590, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_AsPawn_1) == 0x0005A0, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_AsPawn_1' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, K2Node_DynamicCast_bSuccess_5) == 0x0005A8, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0005AC, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0005B8, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0005B9, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0005BA, "Member 'Prj_Chaplin_Uncharged_Child_C_ExecuteUbergraph_Prj_Chaplin_Uncharged_Child::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");

// Function Prj_Chaplin_Uncharged_Child.Prj_Chaplin_Uncharged_Child_C.OnStop
// 0x008C (0x008C - 0x0000)
struct Prj_Chaplin_Uncharged_Child_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_Chaplin_Uncharged_Child_C_OnStop) == 0x000004, "Wrong alignment on Prj_Chaplin_Uncharged_Child_C_OnStop");
static_assert(sizeof(Prj_Chaplin_Uncharged_Child_C_OnStop) == 0x00008C, "Wrong size on Prj_Chaplin_Uncharged_Child_C_OnStop");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_OnStop, Hit) == 0x000000, "Member 'Prj_Chaplin_Uncharged_Child_C_OnStop::Hit' has a wrong offset!");

// Function Prj_Chaplin_Uncharged_Child.Prj_Chaplin_Uncharged_Child_C.MultiWaterExplode
// 0x0024 (0x0024 - 0x0000)
struct Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ImpactGC_0;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         WaterLevel;                                        // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode) == 0x000004, "Wrong alignment on Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode");
static_assert(sizeof(Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode) == 0x000024, "Wrong size on Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode, Location) == 0x000000, "Member 'Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode::Location' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode, Normal) == 0x00000C, "Member 'Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode::Normal' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode, ImpactGC_0) == 0x000018, "Member 'Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode::ImpactGC_0' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode, WaterLevel) == 0x000020, "Member 'Prj_Chaplin_Uncharged_Child_C_MultiWaterExplode::WaterLevel' has a wrong offset!");

// Function Prj_Chaplin_Uncharged_Child.Prj_Chaplin_Uncharged_Child_C.OnTouched
// 0x00A0 (0x00A0 - 0x0000)
struct Prj_Chaplin_Uncharged_Child_C_OnTouched final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0010(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bIsOverlap;                                        // 0x009C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Chaplin_Uncharged_Child_C_OnTouched) == 0x000008, "Wrong alignment on Prj_Chaplin_Uncharged_Child_C_OnTouched");
static_assert(sizeof(Prj_Chaplin_Uncharged_Child_C_OnTouched) == 0x0000A0, "Wrong size on Prj_Chaplin_Uncharged_Child_C_OnTouched");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_OnTouched, OtherActor) == 0x000000, "Member 'Prj_Chaplin_Uncharged_Child_C_OnTouched::OtherActor' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_OnTouched, OtherComp) == 0x000008, "Member 'Prj_Chaplin_Uncharged_Child_C_OnTouched::OtherComp' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_OnTouched, HitResult) == 0x000010, "Member 'Prj_Chaplin_Uncharged_Child_C_OnTouched::HitResult' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_OnTouched, bIsOverlap) == 0x00009C, "Member 'Prj_Chaplin_Uncharged_Child_C_OnTouched::bIsOverlap' has a wrong offset!");

// Function Prj_Chaplin_Uncharged_Child.Prj_Chaplin_Uncharged_Child_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct Prj_Chaplin_Uncharged_Child_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Prj_Chaplin_Uncharged_Child_C_OnExploded) == 0x000008, "Wrong alignment on Prj_Chaplin_Uncharged_Child_C_OnExploded");
static_assert(sizeof(Prj_Chaplin_Uncharged_Child_C_OnExploded) == 0x000020, "Wrong size on Prj_Chaplin_Uncharged_Child_C_OnExploded");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_OnExploded, HitActors) == 0x000000, "Member 'Prj_Chaplin_Uncharged_Child_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_OnExploded, HitResults) == 0x000010, "Member 'Prj_Chaplin_Uncharged_Child_C_OnExploded::HitResults' has a wrong offset!");

// Function Prj_Chaplin_Uncharged_Child.Prj_Chaplin_Uncharged_Child_C.MultiExplode
// 0x0024 (0x0024 - 0x0000)
struct Prj_Chaplin_Uncharged_Child_C_MultiExplode final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ImpactGC_0;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bHitPawn_0;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Chaplin_Uncharged_Child_C_MultiExplode) == 0x000004, "Wrong alignment on Prj_Chaplin_Uncharged_Child_C_MultiExplode");
static_assert(sizeof(Prj_Chaplin_Uncharged_Child_C_MultiExplode) == 0x000024, "Wrong size on Prj_Chaplin_Uncharged_Child_C_MultiExplode");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_MultiExplode, Location) == 0x000000, "Member 'Prj_Chaplin_Uncharged_Child_C_MultiExplode::Location' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_MultiExplode, Normal) == 0x00000C, "Member 'Prj_Chaplin_Uncharged_Child_C_MultiExplode::Normal' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_MultiExplode, ImpactGC_0) == 0x000018, "Member 'Prj_Chaplin_Uncharged_Child_C_MultiExplode::ImpactGC_0' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_MultiExplode, bHitPawn_0) == 0x000020, "Member 'Prj_Chaplin_Uncharged_Child_C_MultiExplode::bHitPawn_0' has a wrong offset!");

// Function Prj_Chaplin_Uncharged_Child.Prj_Chaplin_Uncharged_Child_C.BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature final
{
public:
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         WaterInteractionComponent_0;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstBody;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000008, "Wrong alignment on Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(sizeof(Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature) == 0x000018, "Wrong size on Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterBody) == 0x000000, "Member 'Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterBody' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, WaterInteractionComponent_0) == 0x000008, "Member 'Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::WaterInteractionComponent_0' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature, bIsFirstBody) == 0x000010, "Member 'Prj_Chaplin_Uncharged_Child_C_BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature::bIsFirstBody' has a wrong offset!");

// Function Prj_Chaplin_Uncharged_Child.Prj_Chaplin_Uncharged_Child_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct Prj_Chaplin_Uncharged_Child_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prj_Chaplin_Uncharged_Child_C_ReceiveHit) == 0x000008, "Wrong alignment on Prj_Chaplin_Uncharged_Child_C_ReceiveHit");
static_assert(sizeof(Prj_Chaplin_Uncharged_Child_C_ReceiveHit) == 0x0000D0, "Wrong size on Prj_Chaplin_Uncharged_Child_C_ReceiveHit");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ReceiveHit, MyComp) == 0x000000, "Member 'Prj_Chaplin_Uncharged_Child_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ReceiveHit, Other) == 0x000008, "Member 'Prj_Chaplin_Uncharged_Child_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Prj_Chaplin_Uncharged_Child_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Prj_Chaplin_Uncharged_Child_C_ReceiveHit::OtherComp' has a wrong offset!");
