#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_NPC_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_NPC_Parent.Prj_NPC_Parent_C
// 0x00F8 (0x0970 - 0x0878)
class APrj_NPC_Parent_C : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NPCProjectileFX;                                   // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        NPC_ProjectileAmbientSound;                        // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NPC_ProjectileMesh;                                // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HitPawn;                                           // 0x0898(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HitWater;                                          // 0x0899(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89A[0x2];                                      // 0x089A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WaterBodyIndex;                                    // 0x089C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NPC_ProjectileFXLocation;                          // 0x08A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             NPC_ProjectileHitResult;                           // 0x08AC(0x008C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          NPC_ProjectileExploded;                            // 0x0938(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_939[0x7];                                      // 0x0939(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             NPC_ProjectileImpactSound;                         // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NPC_AmbientSoundFadeOutDuration;                   // 0x0948(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ImpactGC;                                          // 0x094C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NPCPorjectileFXNormal;                             // 0x0954(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           WaterImpactGC;                                     // 0x0960(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InternalImpactGC;                                  // 0x0968(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_NPC_Parent(int32 EntryPoint);
	void RegularExplode(const struct FVector& NPC_ProjectileFXLocation_0, const struct FVector& NPCPorjectileFXNormal_0, const struct FGameplayTag& ImpactGC_0, bool HitPawn_0);
	void WaterExplode(const struct FVector& NPC_ProjectileFXLocation_0, const struct FVector& NPCPorjectileFXNormal_0, const struct FGameplayTag& InternalImpactGC_0, int32 WaterBodyIndex_0);
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnStoppedOnServer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_NPC_Parent_C">();
	}
	static class APrj_NPC_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_NPC_Parent_C>();
	}
};
static_assert(alignof(APrj_NPC_Parent_C) == 0x000008, "Wrong alignment on APrj_NPC_Parent_C");
static_assert(sizeof(APrj_NPC_Parent_C) == 0x000970, "Wrong size on APrj_NPC_Parent_C");
static_assert(offsetof(APrj_NPC_Parent_C, UberGraphFrame) == 0x000878, "Member 'APrj_NPC_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, NPCProjectileFX) == 0x000880, "Member 'APrj_NPC_Parent_C::NPCProjectileFX' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, NPC_ProjectileAmbientSound) == 0x000888, "Member 'APrj_NPC_Parent_C::NPC_ProjectileAmbientSound' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, NPC_ProjectileMesh) == 0x000890, "Member 'APrj_NPC_Parent_C::NPC_ProjectileMesh' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, HitPawn) == 0x000898, "Member 'APrj_NPC_Parent_C::HitPawn' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, HitWater) == 0x000899, "Member 'APrj_NPC_Parent_C::HitWater' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, WaterBodyIndex) == 0x00089C, "Member 'APrj_NPC_Parent_C::WaterBodyIndex' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, NPC_ProjectileFXLocation) == 0x0008A0, "Member 'APrj_NPC_Parent_C::NPC_ProjectileFXLocation' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, NPC_ProjectileHitResult) == 0x0008AC, "Member 'APrj_NPC_Parent_C::NPC_ProjectileHitResult' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, NPC_ProjectileExploded) == 0x000938, "Member 'APrj_NPC_Parent_C::NPC_ProjectileExploded' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, NPC_ProjectileImpactSound) == 0x000940, "Member 'APrj_NPC_Parent_C::NPC_ProjectileImpactSound' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, NPC_AmbientSoundFadeOutDuration) == 0x000948, "Member 'APrj_NPC_Parent_C::NPC_AmbientSoundFadeOutDuration' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, ImpactGC) == 0x00094C, "Member 'APrj_NPC_Parent_C::ImpactGC' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, NPCPorjectileFXNormal) == 0x000954, "Member 'APrj_NPC_Parent_C::NPCPorjectileFXNormal' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, WaterImpactGC) == 0x000960, "Member 'APrj_NPC_Parent_C::WaterImpactGC' has a wrong offset!");
static_assert(offsetof(APrj_NPC_Parent_C, InternalImpactGC) == 0x000968, "Member 'APrj_NPC_Parent_C::InternalImpactGC' has a wrong offset!");

}

