#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidekickInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidekickInstance.SidekickInstance_C
// 0x0028 (0x0310 - 0x02E8)
class USidekickInstance_C final : public USidekickDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_VideoSuspended;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Widget_VideoDisabled;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Widget_VideoSuspended;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CachedDisabled;                                    // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CachedPaused;                                      // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SidekickInstance(int32 EntryPoint);
	void OnVideoPaused(bool bPaused);
	void OnVideoDisabled(bool bDisabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidekickInstance_C">();
	}
	static class USidekickInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidekickInstance_C>();
	}
};
static_assert(alignof(USidekickInstance_C) == 0x000008, "Wrong alignment on USidekickInstance_C");
static_assert(sizeof(USidekickInstance_C) == 0x000310, "Wrong size on USidekickInstance_C");
static_assert(offsetof(USidekickInstance_C, UberGraphFrame) == 0x0002E8, "Member 'USidekickInstance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidekickInstance_C, Border_VideoSuspended) == 0x0002F0, "Member 'USidekickInstance_C::Border_VideoSuspended' has a wrong offset!");
static_assert(offsetof(USidekickInstance_C, Widget_VideoDisabled) == 0x0002F8, "Member 'USidekickInstance_C::Widget_VideoDisabled' has a wrong offset!");
static_assert(offsetof(USidekickInstance_C, Widget_VideoSuspended) == 0x000300, "Member 'USidekickInstance_C::Widget_VideoSuspended' has a wrong offset!");
static_assert(offsetof(USidekickInstance_C, CachedDisabled) == 0x000308, "Member 'USidekickInstance_C::CachedDisabled' has a wrong offset!");
static_assert(offsetof(USidekickInstance_C, CachedPaused) == 0x000309, "Member 'USidekickInstance_C::CachedPaused' has a wrong offset!");

}

