#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidekickInstance

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SidekickInstance.SidekickInstance_C.ExecuteUbergraph_SidekickInstance
// 0x0010 (0x0010 - 0x0000)
struct SidekickInstance_C_ExecuteUbergraph_SidekickInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisabled;                            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPaused;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance) == 0x000004, "Wrong alignment on SidekickInstance_C_ExecuteUbergraph_SidekickInstance");
static_assert(sizeof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance) == 0x000010, "Wrong size on SidekickInstance_C_ExecuteUbergraph_SidekickInstance");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, EntryPoint) == 0x000000, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, Temp_bool_Variable) == 0x000004, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, Temp_byte_Variable) == 0x000005, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, Temp_byte_Variable_1) == 0x000006, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, Temp_bool_Variable_1) == 0x000007, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, Temp_byte_Variable_2) == 0x000008, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, Temp_byte_Variable_3) == 0x000009, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, K2Node_Event_bDisabled) == 0x00000A, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::K2Node_Event_bDisabled' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, K2Node_Event_bPaused) == 0x00000B, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::K2Node_Event_bPaused' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, K2Node_Select_Default) == 0x00000C, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidekickInstance_C_ExecuteUbergraph_SidekickInstance, K2Node_Select_Default_1) == 0x00000D, "Member 'SidekickInstance_C_ExecuteUbergraph_SidekickInstance::K2Node_Select_Default_1' has a wrong offset!");

// Function SidekickInstance.SidekickInstance_C.OnVideoPaused
// 0x0001 (0x0001 - 0x0000)
struct SidekickInstance_C_OnVideoPaused final
{
public:
	bool                                          bPaused;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SidekickInstance_C_OnVideoPaused) == 0x000001, "Wrong alignment on SidekickInstance_C_OnVideoPaused");
static_assert(sizeof(SidekickInstance_C_OnVideoPaused) == 0x000001, "Wrong size on SidekickInstance_C_OnVideoPaused");
static_assert(offsetof(SidekickInstance_C_OnVideoPaused, bPaused) == 0x000000, "Member 'SidekickInstance_C_OnVideoPaused::bPaused' has a wrong offset!");

// Function SidekickInstance.SidekickInstance_C.OnVideoDisabled
// 0x0001 (0x0001 - 0x0000)
struct SidekickInstance_C_OnVideoDisabled final
{
public:
	bool                                          bDisabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SidekickInstance_C_OnVideoDisabled) == 0x000001, "Wrong alignment on SidekickInstance_C_OnVideoDisabled");
static_assert(sizeof(SidekickInstance_C_OnVideoDisabled) == 0x000001, "Wrong size on SidekickInstance_C_OnVideoDisabled");
static_assert(offsetof(SidekickInstance_C_OnVideoDisabled, bDisabled) == 0x000000, "Member 'SidekickInstance_C_OnVideoDisabled::bDisabled' has a wrong offset!");

}

