#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_M249_Skeleton_Dynamic_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_M249_Skeleton_Dynamic_AnimBP.SK_M249_Skeleton_Dynamic_AnimBP_C
// 0x0760 (0x0A20 - 0x02C0)
class USK_M249_Skeleton_Dynamic_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x02F0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0310(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0398(0x0030)()
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x03D0(0x0650)()

public:
	void ExecuteUbergraph_SK_M249_Skeleton_Dynamic_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_M249_Skeleton_Dynamic_AnimBP_C">();
	}
	static class USK_M249_Skeleton_Dynamic_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_M249_Skeleton_Dynamic_AnimBP_C>();
	}
};
static_assert(alignof(USK_M249_Skeleton_Dynamic_AnimBP_C) == 0x000010, "Wrong alignment on USK_M249_Skeleton_Dynamic_AnimBP_C");
static_assert(sizeof(USK_M249_Skeleton_Dynamic_AnimBP_C) == 0x000A20, "Wrong size on USK_M249_Skeleton_Dynamic_AnimBP_C");
static_assert(offsetof(USK_M249_Skeleton_Dynamic_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'USK_M249_Skeleton_Dynamic_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_M249_Skeleton_Dynamic_AnimBP_C, AnimBlueprintClassSubsystem_PropertyAccess) == 0x0002C8, "Member 'USK_M249_Skeleton_Dynamic_AnimBP_C::AnimBlueprintClassSubsystem_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USK_M249_Skeleton_Dynamic_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0002D0, "Member 'USK_M249_Skeleton_Dynamic_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USK_M249_Skeleton_Dynamic_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0002F0, "Member 'USK_M249_Skeleton_Dynamic_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USK_M249_Skeleton_Dynamic_AnimBP_C, AnimGraphNode_SubInput) == 0x000310, "Member 'USK_M249_Skeleton_Dynamic_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(USK_M249_Skeleton_Dynamic_AnimBP_C, AnimGraphNode_Root) == 0x000398, "Member 'USK_M249_Skeleton_Dynamic_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USK_M249_Skeleton_Dynamic_AnimBP_C, AnimGraphNode_RigidBody) == 0x0003D0, "Member 'USK_M249_Skeleton_Dynamic_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");

}

