#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeSynthTrackComponent_LowTower

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "BP_TimeSynthTrackComponent_DataTracker_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TimeSynthTrackComponent_LowTower.TimeSynthTrackComponent_LowTower_C
// 0x0020 (0x0230 - 0x0210)
class UTimeSynthTrackComponent_LowTower_C final : public UBP_TimeSynthTrackComponent_DataTracker_C
{
public:
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           UnawareTag;                                        // 0x020C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AlertedTag;                                        // 0x0214(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AggressiveTag;                                     // 0x021C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         UnawareInterp;                                     // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AlertedInterp;                                     // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AggressiveInterp;                                  // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnDataTrackerUpdate();
	void GetRemainingEventCooldown(float* Cooldown);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TimeSynthTrackComponent_LowTower_C">();
	}
	static class UTimeSynthTrackComponent_LowTower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimeSynthTrackComponent_LowTower_C>();
	}
};
static_assert(alignof(UTimeSynthTrackComponent_LowTower_C) == 0x000008, "Wrong alignment on UTimeSynthTrackComponent_LowTower_C");
static_assert(sizeof(UTimeSynthTrackComponent_LowTower_C) == 0x000230, "Wrong size on UTimeSynthTrackComponent_LowTower_C");
static_assert(offsetof(UTimeSynthTrackComponent_LowTower_C, UnawareTag) == 0x00020C, "Member 'UTimeSynthTrackComponent_LowTower_C::UnawareTag' has a wrong offset!");
static_assert(offsetof(UTimeSynthTrackComponent_LowTower_C, AlertedTag) == 0x000214, "Member 'UTimeSynthTrackComponent_LowTower_C::AlertedTag' has a wrong offset!");
static_assert(offsetof(UTimeSynthTrackComponent_LowTower_C, AggressiveTag) == 0x00021C, "Member 'UTimeSynthTrackComponent_LowTower_C::AggressiveTag' has a wrong offset!");
static_assert(offsetof(UTimeSynthTrackComponent_LowTower_C, UnawareInterp) == 0x000224, "Member 'UTimeSynthTrackComponent_LowTower_C::UnawareInterp' has a wrong offset!");
static_assert(offsetof(UTimeSynthTrackComponent_LowTower_C, AlertedInterp) == 0x000228, "Member 'UTimeSynthTrackComponent_LowTower_C::AlertedInterp' has a wrong offset!");
static_assert(offsetof(UTimeSynthTrackComponent_LowTower_C, AggressiveInterp) == 0x00022C, "Member 'UTimeSynthTrackComponent_LowTower_C::AggressiveInterp' has a wrong offset!");

}

