#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_FrostedTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Floor_FrostedTips.Trap_Floor_FrostedTips_C
// 0x0170 (0x0EB8 - 0x0D48)
class ATrap_Floor_FrostedTips_C : public ABuildingTrapFloor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Flames_Pilot_Light_Group_01;                    // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FireMuzzle4;                                       // 0x0D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FireMuzzle3;                                       // 0x0D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FireMuzzle2;                                       // 0x0D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FireMuzzle1;                                       // 0x0D70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FireMuzzle;                                        // 0x0D78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ActiveFX_3;                                        // 0x0D80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ActiveFX_2;                                        // 0x0D88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ActiveFX_1;                                        // 0x0D90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX;                                            // 0x0D98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_FlameGrill_Trap_Start;                           // 0x0DA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ActiveFX;                                          // 0x0DA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TriggerVolume;                                     // 0x0DB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0DB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PlacementSoundLocation;                            // 0x0DC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Timeline_2_ColorTrack_FB29236049D838A8883CF29FA551B640; // 0x0DC8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Opacity_FB29236049D838A8883CF29FA551B640; // 0x0DD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_GrowRadial_FB29236049D838A8883CF29FA551B640; // 0x0DDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Grow_FB29236049D838A8883CF29FA551B640;  // 0x0DE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Reveal_FB29236049D838A8883CF29FA551B640; // 0x0DE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_FB29236049D838A8883CF29FA551B640; // 0x0DE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE9[0x7];                                      // 0x0DE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0DF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Timeline_1_EmissiveTrack_8EDB1E9A48DF965D59BD819AA551F7EE; // 0x0DF8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_8EDB1E9A48DF965D59BD819AA551F7EE; // 0x0E08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E09[0x7];                                      // 0x0E09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0E10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Timeline_0_ColorTrack_DBC90D1D4BC7A7BF1068C6AAF192FE64; // 0x0E18(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Opacity_DBC90D1D4BC7A7BF1068C6AAF192FE64; // 0x0E28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_GrowRadial_DBC90D1D4BC7A7BF1068C6AAF192FE64; // 0x0E2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Grow_DBC90D1D4BC7A7BF1068C6AAF192FE64;  // 0x0E30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Reveal_DBC90D1D4BC7A7BF1068C6AAF192FE64; // 0x0E34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_DBC90D1D4BC7A7BF1068C6AAF192FE64; // 0x0E38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E39[0x7];                                      // 0x0E39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0E40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Placed_Sound;                                 // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0E50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Reload_Sound;                                 // 0x0E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0E68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TrapMID;                                           // 0x0E70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActiveEmissiveColor;                               // 0x0E78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       ActiveFXEmitters;                                  // 0x0E88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class USceneComponent*>                FlameSpawnersSpots;                                // 0x0E98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class USoundCue*                              Trap_GasIgnite_Sound;                              // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_PreFire_Sound;                                // 0x0EB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Trap_Floor_FrostedTips(int32 EntryPoint);
	void PlacedByPlayer(const class AFortPlayerStateZone* PlayerState);
	void GameplayCue_Abilities_Activation_Traps_DelayBegin(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Activation_Traps_ReloadBegin(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnFinishedBuilding();
	void OnPlaced();
	void OnReloadEnd();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();
	void SetActiveFireFX(bool _Active);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Floor_FrostedTips_C">();
	}
	static class ATrap_Floor_FrostedTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Floor_FrostedTips_C>();
	}
};
static_assert(alignof(ATrap_Floor_FrostedTips_C) == 0x000008, "Wrong alignment on ATrap_Floor_FrostedTips_C");
static_assert(sizeof(ATrap_Floor_FrostedTips_C) == 0x000EB8, "Wrong size on ATrap_Floor_FrostedTips_C");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, UberGraphFrame) == 0x000D48, "Member 'ATrap_Floor_FrostedTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, SM_Flames_Pilot_Light_Group_01) == 0x000D50, "Member 'ATrap_Floor_FrostedTips_C::SM_Flames_Pilot_Light_Group_01' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, FireMuzzle4) == 0x000D58, "Member 'ATrap_Floor_FrostedTips_C::FireMuzzle4' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, FireMuzzle3) == 0x000D60, "Member 'ATrap_Floor_FrostedTips_C::FireMuzzle3' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, FireMuzzle2) == 0x000D68, "Member 'ATrap_Floor_FrostedTips_C::FireMuzzle2' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, FireMuzzle1) == 0x000D70, "Member 'ATrap_Floor_FrostedTips_C::FireMuzzle1' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, FireMuzzle) == 0x000D78, "Member 'ATrap_Floor_FrostedTips_C::FireMuzzle' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, ActiveFX_3) == 0x000D80, "Member 'ATrap_Floor_FrostedTips_C::ActiveFX_3' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, ActiveFX_2) == 0x000D88, "Member 'ATrap_Floor_FrostedTips_C::ActiveFX_2' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, ActiveFX_1) == 0x000D90, "Member 'ATrap_Floor_FrostedTips_C::ActiveFX_1' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, IdleFX) == 0x000D98, "Member 'ATrap_Floor_FrostedTips_C::IdleFX' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, P_FlameGrill_Trap_Start) == 0x000DA0, "Member 'ATrap_Floor_FrostedTips_C::P_FlameGrill_Trap_Start' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, ActiveFX) == 0x000DA8, "Member 'ATrap_Floor_FrostedTips_C::ActiveFX' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, TriggerVolume) == 0x000DB0, "Member 'ATrap_Floor_FrostedTips_C::TriggerVolume' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Root) == 0x000DB8, "Member 'ATrap_Floor_FrostedTips_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, PlacementSoundLocation) == 0x000DC0, "Member 'ATrap_Floor_FrostedTips_C::PlacementSoundLocation' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_2_ColorTrack_FB29236049D838A8883CF29FA551B640) == 0x000DC8, "Member 'ATrap_Floor_FrostedTips_C::Timeline_2_ColorTrack_FB29236049D838A8883CF29FA551B640' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_2_Opacity_FB29236049D838A8883CF29FA551B640) == 0x000DD8, "Member 'ATrap_Floor_FrostedTips_C::Timeline_2_Opacity_FB29236049D838A8883CF29FA551B640' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_2_GrowRadial_FB29236049D838A8883CF29FA551B640) == 0x000DDC, "Member 'ATrap_Floor_FrostedTips_C::Timeline_2_GrowRadial_FB29236049D838A8883CF29FA551B640' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_2_Grow_FB29236049D838A8883CF29FA551B640) == 0x000DE0, "Member 'ATrap_Floor_FrostedTips_C::Timeline_2_Grow_FB29236049D838A8883CF29FA551B640' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_2_Reveal_FB29236049D838A8883CF29FA551B640) == 0x000DE4, "Member 'ATrap_Floor_FrostedTips_C::Timeline_2_Reveal_FB29236049D838A8883CF29FA551B640' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_2__Direction_FB29236049D838A8883CF29FA551B640) == 0x000DE8, "Member 'ATrap_Floor_FrostedTips_C::Timeline_2__Direction_FB29236049D838A8883CF29FA551B640' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_2) == 0x000DF0, "Member 'ATrap_Floor_FrostedTips_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_1_EmissiveTrack_8EDB1E9A48DF965D59BD819AA551F7EE) == 0x000DF8, "Member 'ATrap_Floor_FrostedTips_C::Timeline_1_EmissiveTrack_8EDB1E9A48DF965D59BD819AA551F7EE' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_1__Direction_8EDB1E9A48DF965D59BD819AA551F7EE) == 0x000E08, "Member 'ATrap_Floor_FrostedTips_C::Timeline_1__Direction_8EDB1E9A48DF965D59BD819AA551F7EE' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_1) == 0x000E10, "Member 'ATrap_Floor_FrostedTips_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_0_ColorTrack_DBC90D1D4BC7A7BF1068C6AAF192FE64) == 0x000E18, "Member 'ATrap_Floor_FrostedTips_C::Timeline_0_ColorTrack_DBC90D1D4BC7A7BF1068C6AAF192FE64' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_0_Opacity_DBC90D1D4BC7A7BF1068C6AAF192FE64) == 0x000E28, "Member 'ATrap_Floor_FrostedTips_C::Timeline_0_Opacity_DBC90D1D4BC7A7BF1068C6AAF192FE64' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_0_GrowRadial_DBC90D1D4BC7A7BF1068C6AAF192FE64) == 0x000E2C, "Member 'ATrap_Floor_FrostedTips_C::Timeline_0_GrowRadial_DBC90D1D4BC7A7BF1068C6AAF192FE64' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_0_Grow_DBC90D1D4BC7A7BF1068C6AAF192FE64) == 0x000E30, "Member 'ATrap_Floor_FrostedTips_C::Timeline_0_Grow_DBC90D1D4BC7A7BF1068C6AAF192FE64' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_0_Reveal_DBC90D1D4BC7A7BF1068C6AAF192FE64) == 0x000E34, "Member 'ATrap_Floor_FrostedTips_C::Timeline_0_Reveal_DBC90D1D4BC7A7BF1068C6AAF192FE64' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_0__Direction_DBC90D1D4BC7A7BF1068C6AAF192FE64) == 0x000E38, "Member 'ATrap_Floor_FrostedTips_C::Timeline_0__Direction_DBC90D1D4BC7A7BF1068C6AAF192FE64' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Timeline_0) == 0x000E40, "Member 'ATrap_Floor_FrostedTips_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Trap_Placed_Sound) == 0x000E48, "Member 'ATrap_Floor_FrostedTips_C::Trap_Placed_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Trap_Active_Sound) == 0x000E50, "Member 'ATrap_Floor_FrostedTips_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Trap_Fire_Sound) == 0x000E58, "Member 'ATrap_Floor_FrostedTips_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Trap_Reload_Sound) == 0x000E60, "Member 'ATrap_Floor_FrostedTips_C::Trap_Reload_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Trap_Explode_Sound) == 0x000E68, "Member 'ATrap_Floor_FrostedTips_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, TrapMID) == 0x000E70, "Member 'ATrap_Floor_FrostedTips_C::TrapMID' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, ActiveEmissiveColor) == 0x000E78, "Member 'ATrap_Floor_FrostedTips_C::ActiveEmissiveColor' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, ActiveFXEmitters) == 0x000E88, "Member 'ATrap_Floor_FrostedTips_C::ActiveFXEmitters' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, FlameSpawnersSpots) == 0x000E98, "Member 'ATrap_Floor_FrostedTips_C::FlameSpawnersSpots' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Trap_GasIgnite_Sound) == 0x000EA8, "Member 'ATrap_Floor_FrostedTips_C::Trap_GasIgnite_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Floor_FrostedTips_C, Trap_PreFire_Sound) == 0x000EB0, "Member 'ATrap_Floor_FrostedTips_C::Trap_PreFire_Sound' has a wrong offset!");

}

