#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_FrostedTips

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Floor_FrostedTips.Trap_Floor_FrostedTips_C.ExecuteUbergraph_Trap_Floor_FrostedTips
// 0x0820 (0x0820 - 0x0000)
struct Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x00E0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x0160(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x01E0(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0270(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_5;              // 0x02F0(0x0080)(IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0xB];                                      // 0x0375(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_6;              // 0x0380(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0400(0x0010)(ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_2;   // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x044C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x2];                                      // 0x0462(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType_2;               // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA[0x6];                                      // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters_2;              // 0x04B0(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType_1;               // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A[0x6];                                      // 0x056A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters_1;              // 0x0570(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62A[0x2];                                      // 0x062A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x062C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0638(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0640(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x064C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0660(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0680(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x068C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0728(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue;  // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0750(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_809[0x7];                                      // 0x0809(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPlayerStateZone*             K2Node_Event_PlayerState;                          // 0x0810(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips) == 0x000010, "Wrong alignment on Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips");
static_assert(sizeof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips) == 0x000820, "Wrong size on Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, EntryPoint) == 0x000000, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_BreakVector_X) == 0x000090, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_BreakVector_Y) == 0x000094, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_BreakVector_Z) == 0x000098, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Multiply_VectorVector_ReturnValue) == 0x00009C, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A8, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_MakeVector_ReturnValue_1) == 0x0000BC, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0000D4, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_MakeStruct_ParticleSysParam_1) == 0x0000E0, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_MakeStruct_ParticleSysParam_2) == 0x000160, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_MakeStruct_ParticleSysParam_3) == 0x0001E0, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000260, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_MakeStruct_ParticleSysParam_4) == 0x000270, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_MakeStruct_ParticleSysParam_5) == 0x0002F0, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_MakeStruct_ParticleSysParam_5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, Temp_float_Variable) == 0x000370, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000374, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_MakeStruct_ParticleSysParam_6) == 0x000380, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_MakeStruct_ParticleSysParam_6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_MakeArray_Array) == 0x000400, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000410, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x00041C, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Conv_LinearColorToVector_ReturnValue_2) == 0x000428, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Conv_LinearColorToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000434, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000440, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00044C, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000458, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_IsValid_ReturnValue) == 0x000460, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_IsValid_ReturnValue_1) == 0x000461, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_GetCameraLocation_ReturnValue) == 0x000464, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000470, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00047C, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000488, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000490, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0004A0, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_IsDedicatedServer_ReturnValue) == 0x0004A8, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_GameplayCueEvent_EventType_2) == 0x0004A9, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_GameplayCueEvent_EventType_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_GameplayCueEvent_Parameters_2) == 0x0004B0, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_GameplayCueEvent_Parameters_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_SwitchEnum_CmpSuccess) == 0x000568, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_GameplayCueEvent_EventType_1) == 0x000569, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_GameplayCueEvent_EventType_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_GameplayCueEvent_Parameters_1) == 0x000570, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_GameplayCueEvent_Parameters_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_SwitchEnum_CmpSuccess_1) == 0x000628, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_IsValid_ReturnValue_2) == 0x000629, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00062C, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000638, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000640, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00064C, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_VSize_ReturnValue) == 0x000658, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_Event_Damage) == 0x00065C, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_Event_DamageTags) == 0x000660, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_Event_Momentum) == 0x000680, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_Event_HitInfo) == 0x00068C, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_Event_InstigatedBy) == 0x000718, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_Event_DamageCauser) == 0x000720, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_Event_EffectContext) == 0x000728, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue) == 0x000740, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_GameplayCueEvent_EventType) == 0x000748, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_GameplayCueEvent_Parameters) == 0x000750, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_SwitchEnum_CmpSuccess_2) == 0x000808, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips, K2Node_Event_PlayerState) == 0x000810, "Member 'Trap_Floor_FrostedTips_C_ExecuteUbergraph_Trap_Floor_FrostedTips::K2Node_Event_PlayerState' has a wrong offset!");

// Function Trap_Floor_FrostedTips.Trap_Floor_FrostedTips_C.PlacedByPlayer
// 0x0008 (0x0008 - 0x0000)
struct Trap_Floor_FrostedTips_C_PlacedByPlayer final
{
public:
	const class AFortPlayerStateZone*             PlayerState;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Floor_FrostedTips_C_PlacedByPlayer) == 0x000008, "Wrong alignment on Trap_Floor_FrostedTips_C_PlacedByPlayer");
static_assert(sizeof(Trap_Floor_FrostedTips_C_PlacedByPlayer) == 0x000008, "Wrong size on Trap_Floor_FrostedTips_C_PlacedByPlayer");
static_assert(offsetof(Trap_Floor_FrostedTips_C_PlacedByPlayer, PlayerState) == 0x000000, "Member 'Trap_Floor_FrostedTips_C_PlacedByPlayer::PlayerState' has a wrong offset!");

// Function Trap_Floor_FrostedTips.Trap_Floor_FrostedTips_C.GameplayCue.Abilities.Activation.Traps.DelayBegin
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_DelayBegin final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_DelayBegin) == 0x000008, "Wrong alignment on Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_DelayBegin");
static_assert(sizeof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_DelayBegin) == 0x0000C0, "Wrong size on Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_DelayBegin");
static_assert(offsetof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_DelayBegin, EventType) == 0x000000, "Member 'Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_DelayBegin::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_DelayBegin, Parameters) == 0x000008, "Member 'Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_DelayBegin::Parameters' has a wrong offset!");

// Function Trap_Floor_FrostedTips.Trap_Floor_FrostedTips_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct Trap_Floor_FrostedTips_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Trap_Floor_FrostedTips_C_OnDeathServer) == 0x000008, "Wrong alignment on Trap_Floor_FrostedTips_C_OnDeathServer");
static_assert(sizeof(Trap_Floor_FrostedTips_C_OnDeathServer) == 0x0000E8, "Wrong size on Trap_Floor_FrostedTips_C_OnDeathServer");
static_assert(offsetof(Trap_Floor_FrostedTips_C_OnDeathServer, Damage) == 0x000000, "Member 'Trap_Floor_FrostedTips_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_OnDeathServer, DamageTags) == 0x000008, "Member 'Trap_Floor_FrostedTips_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_OnDeathServer, Momentum) == 0x000028, "Member 'Trap_Floor_FrostedTips_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_OnDeathServer, HitInfo) == 0x000034, "Member 'Trap_Floor_FrostedTips_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'Trap_Floor_FrostedTips_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'Trap_Floor_FrostedTips_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'Trap_Floor_FrostedTips_C_OnDeathServer::EffectContext' has a wrong offset!");

// Function Trap_Floor_FrostedTips.Trap_Floor_FrostedTips_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000008, "Wrong alignment on Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x0000C0, "Wrong size on Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000008, "Member 'Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Floor_FrostedTips.Trap_Floor_FrostedTips_C.GameplayCue.Abilities.Activation.Traps.ReloadBegin
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x000008, "Wrong alignment on Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(sizeof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x0000C0, "Wrong size on Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(offsetof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, EventType) == 0x000000, "Member 'Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, Parameters) == 0x000008, "Member 'Trap_Floor_FrostedTips_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::Parameters' has a wrong offset!");

// Function Trap_Floor_FrostedTips.Trap_Floor_FrostedTips_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct Trap_Floor_FrostedTips_C_UserConstructionScript final
{
public:
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Floor_FrostedTips_C_UserConstructionScript) == 0x000008, "Wrong alignment on Trap_Floor_FrostedTips_C_UserConstructionScript");
static_assert(sizeof(Trap_Floor_FrostedTips_C_UserConstructionScript) == 0x000020, "Wrong size on Trap_Floor_FrostedTips_C_UserConstructionScript");
static_assert(offsetof(Trap_Floor_FrostedTips_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'Trap_Floor_FrostedTips_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x000010, "Member 'Trap_Floor_FrostedTips_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function Trap_Floor_FrostedTips.Trap_Floor_FrostedTips_C.SetActiveFireFX
// 0x0028 (0x0028 - 0x0000)
struct Trap_Floor_FrostedTips_C_SetActiveFireFX final
{
public:
	bool                                          _Active;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_FrostedTips_C_SetActiveFireFX) == 0x000008, "Wrong alignment on Trap_Floor_FrostedTips_C_SetActiveFireFX");
static_assert(sizeof(Trap_Floor_FrostedTips_C_SetActiveFireFX) == 0x000028, "Wrong size on Trap_Floor_FrostedTips_C_SetActiveFireFX");
static_assert(offsetof(Trap_Floor_FrostedTips_C_SetActiveFireFX, _Active) == 0x000000, "Member 'Trap_Floor_FrostedTips_C_SetActiveFireFX::_Active' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_SetActiveFireFX, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Trap_Floor_FrostedTips_C_SetActiveFireFX::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_FrostedTips_C_SetActiveFireFX, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Trap_Floor_FrostedTips_C_SetActiveFireFX::Temp_int_Loop_Counter_Variable' has a wrong offset!");
