#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserSearchResultListEntry_XS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UserSearchResultListEntry_XS.UserSearchResultListEntry_XS_C
// 0x0128 (0x0D38 - 0x0C10)
class UUserSearchResultListEntry_XS_C final : public UFortUserSearchResultListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0C18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0C20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lock;                                        // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Online;                                            // 0x0C50(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Offline;                                           // 0x0C60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Away;                                              // 0x0C70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           bLocked;                                           // 0x0C80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            UserNameOnline;                                    // 0x0C90(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            UserNameOfflineAway;                               // 0x0CB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            UserNameBlocked;                                   // 0x0CE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsPlatOnlyFriend;                                  // 0x0D08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D09[0x3];                                      // 0x0D09(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x0D0C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x0D1C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 NickNameOnline;                                    // 0x0D2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 NickNameOffline;                                   // 0x0D30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UserSearchResultListEntry_XS(int32 EntryPoint);
	void SetNamePlatformAndMutuals(const class FText& DisplayName, const class FText& Platform, int32 MutualCount);
	void BP_OnHovered();
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnUnhovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UserSearchResultListEntry_XS_C">();
	}
	static class UUserSearchResultListEntry_XS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserSearchResultListEntry_XS_C>();
	}
};
static_assert(alignof(UUserSearchResultListEntry_XS_C) == 0x000008, "Wrong alignment on UUserSearchResultListEntry_XS_C");
static_assert(sizeof(UUserSearchResultListEntry_XS_C) == 0x000D38, "Wrong size on UUserSearchResultListEntry_XS_C");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, UberGraphFrame) == 0x000C10, "Member 'UUserSearchResultListEntry_XS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Selected) == 0x000C18, "Member 'UUserSearchResultListEntry_XS_C::Selected' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Hovered) == 0x000C20, "Member 'UUserSearchResultListEntry_XS_C::Hovered' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Arrow) == 0x000C28, "Member 'UUserSearchResultListEntry_XS_C::Arrow' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, EmptyButtonToEatOneMouseUpEvent) == 0x000C30, "Member 'UUserSearchResultListEntry_XS_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Image_Lock) == 0x000C38, "Member 'UUserSearchResultListEntry_XS_C::Image_Lock' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Text_DisplayName) == 0x000C40, "Member 'UUserSearchResultListEntry_XS_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, UserActionMenuInputButton) == 0x000C48, "Member 'UUserSearchResultListEntry_XS_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Online) == 0x000C50, "Member 'UUserSearchResultListEntry_XS_C::Online' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Offline) == 0x000C60, "Member 'UUserSearchResultListEntry_XS_C::Offline' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, Away) == 0x000C70, "Member 'UUserSearchResultListEntry_XS_C::Away' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, bLocked) == 0x000C80, "Member 'UUserSearchResultListEntry_XS_C::bLocked' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, UserNameOnline) == 0x000C90, "Member 'UUserSearchResultListEntry_XS_C::UserNameOnline' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, UserNameOfflineAway) == 0x000CB8, "Member 'UUserSearchResultListEntry_XS_C::UserNameOfflineAway' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, UserNameBlocked) == 0x000CE0, "Member 'UUserSearchResultListEntry_XS_C::UserNameBlocked' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, IsPlatOnlyFriend) == 0x000D08, "Member 'UUserSearchResultListEntry_XS_C::IsPlatOnlyFriend' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, EncourageEpicFriend_IdleColor) == 0x000D0C, "Member 'UUserSearchResultListEntry_XS_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, EncourageEpicFriend_HoveredColor) == 0x000D1C, "Member 'UUserSearchResultListEntry_XS_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, NickNameOnline) == 0x000D2C, "Member 'UUserSearchResultListEntry_XS_C::NickNameOnline' has a wrong offset!");
static_assert(offsetof(UUserSearchResultListEntry_XS_C, NickNameOffline) == 0x000D30, "Member 'UUserSearchResultListEntry_XS_C::NickNameOffline' has a wrong offset!");

}

