#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ValetRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ValetRuntime.FortDagwoodVehicleManager
// 0x0008 (0x00B8 - 0x00B0)
class UFortDagwoodVehicleManager final : public UGameStateComponent
{
public:
	bool                                          bHasUpdatedPropReplacement;                        // 0x00B0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CustomHandleActorStreamedInEditor(class AActor* SourceActor);
	void OnVehicleSpawned(class AFortAthenaVehicle* Vehicle);
	void OnVehicleSpawnsUpdated(class UFortVehicleItemDefinition* VehicleItemDef, TArray<class AActor*>* SpawnedVehicles, int32 NewVehicleCount);
	void ServerSetVehicleFuel(float NewFuel);
	void SetVehicleFuel(float NewFuel);
	void UpdatePropReplacement();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDagwoodVehicleManager">();
	}
	static class UFortDagwoodVehicleManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDagwoodVehicleManager>();
	}
};
static_assert(alignof(UFortDagwoodVehicleManager) == 0x000008, "Wrong alignment on UFortDagwoodVehicleManager");
static_assert(sizeof(UFortDagwoodVehicleManager) == 0x0000B8, "Wrong size on UFortDagwoodVehicleManager");
static_assert(offsetof(UFortDagwoodVehicleManager, bHasUpdatedPropReplacement) == 0x0000B0, "Member 'UFortDagwoodVehicleManager::bHasUpdatedPropReplacement' has a wrong offset!");

// Class ValetRuntime.FortCameraMode_Dagwood
// 0x0040 (0x0E10 - 0x0DD0)
class UFortCameraMode_Dagwood final : public UFortCameraMode_AthenaVehicle
{
public:
	float                                         HorizontalCameraSpaceOffsetWhileTurning;           // 0x0DC8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteeringAngleForMaxHorizontalOffset;               // 0x0DCC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InAirVerticalOffset;                               // 0x0DD0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirOffsetDampFactor;                               // 0x0DD4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedAlphaDampFactor;                              // 0x0DD8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInAirRequiredForVertOffset;                    // 0x0DDC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleBasePitch;                                  // 0x0DE0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HorizOffsetInterpSpeed;                            // 0x0DE4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HorizOffsetInterpSpeedRecovery;                    // 0x0DE8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentSpeedAlpha;                                 // 0x0DEC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentVerticalOffset;                             // 0x0DF0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentHorizontalOffset;                           // 0x0DF4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInAir;                                         // 0x0DF8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviousSpeed;                                     // 0x0DFC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AppliedPitch;                                      // 0x0E00(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E04[0xC];                                      // 0x0E04(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraMode_Dagwood">();
	}
	static class UFortCameraMode_Dagwood* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraMode_Dagwood>();
	}
};
static_assert(alignof(UFortCameraMode_Dagwood) == 0x000010, "Wrong alignment on UFortCameraMode_Dagwood");
static_assert(sizeof(UFortCameraMode_Dagwood) == 0x000E10, "Wrong size on UFortCameraMode_Dagwood");
static_assert(offsetof(UFortCameraMode_Dagwood, HorizontalCameraSpaceOffsetWhileTurning) == 0x000DC8, "Member 'UFortCameraMode_Dagwood::HorizontalCameraSpaceOffsetWhileTurning' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, SteeringAngleForMaxHorizontalOffset) == 0x000DCC, "Member 'UFortCameraMode_Dagwood::SteeringAngleForMaxHorizontalOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, InAirVerticalOffset) == 0x000DD0, "Member 'UFortCameraMode_Dagwood::InAirVerticalOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, AirOffsetDampFactor) == 0x000DD4, "Member 'UFortCameraMode_Dagwood::AirOffsetDampFactor' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, SpeedAlphaDampFactor) == 0x000DD8, "Member 'UFortCameraMode_Dagwood::SpeedAlphaDampFactor' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, TimeInAirRequiredForVertOffset) == 0x000DDC, "Member 'UFortCameraMode_Dagwood::TimeInAirRequiredForVertOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, VehicleBasePitch) == 0x000DE0, "Member 'UFortCameraMode_Dagwood::VehicleBasePitch' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, HorizOffsetInterpSpeed) == 0x000DE4, "Member 'UFortCameraMode_Dagwood::HorizOffsetInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, HorizOffsetInterpSpeedRecovery) == 0x000DE8, "Member 'UFortCameraMode_Dagwood::HorizOffsetInterpSpeedRecovery' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, CurrentSpeedAlpha) == 0x000DEC, "Member 'UFortCameraMode_Dagwood::CurrentSpeedAlpha' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, CurrentVerticalOffset) == 0x000DF0, "Member 'UFortCameraMode_Dagwood::CurrentVerticalOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, CurrentHorizontalOffset) == 0x000DF4, "Member 'UFortCameraMode_Dagwood::CurrentHorizontalOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, TimeInAir) == 0x000DF8, "Member 'UFortCameraMode_Dagwood::TimeInAir' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, PreviousSpeed) == 0x000DFC, "Member 'UFortCameraMode_Dagwood::PreviousSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraMode_Dagwood, AppliedPitch) == 0x000E00, "Member 'UFortCameraMode_Dagwood::AppliedPitch' has a wrong offset!");

// Class ValetRuntime.FortContextualTutorial_VehicleValetLowFuel
// 0x0008 (0x00C8 - 0x00C0)
class UFortContextualTutorial_VehicleValetLowFuel final : public UFortContextualTutorial
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleStartSkydivingForActivation();
	void HandleVehicleStateChanged(class AFortPlayerPawn* PlayerPawn, class AActor* NewVehicle, class AActor* OldVehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContextualTutorial_VehicleValetLowFuel">();
	}
	static class UFortContextualTutorial_VehicleValetLowFuel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_VehicleValetLowFuel>();
	}
};
static_assert(alignof(UFortContextualTutorial_VehicleValetLowFuel) == 0x000008, "Wrong alignment on UFortContextualTutorial_VehicleValetLowFuel");
static_assert(sizeof(UFortContextualTutorial_VehicleValetLowFuel) == 0x0000C8, "Wrong size on UFortContextualTutorial_VehicleValetLowFuel");

// Class ValetRuntime.FortDagwoodVehicle
// 0x0430 (0x1C90 - 0x1860)
class AFortDagwoodVehicle final : public AFortAthenaSKMotorVehicle
{
public:
	uint8                                         Pad_1860[0x10];                                    // 0x1860(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UMatineeCameraShake>        HardLandingCameraShake;                            // 0x1870(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>        OffroadCamShakeClass;                              // 0x1878(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>        DriverCamShakeClass;                               // 0x1880(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>        HandBrakeCamShakeClass;                            // 0x1888(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVehicleClass                                 VehicleClass;                                      // 0x1890(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1891[0x3];                                     // 0x1891(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NativeMinPontoonRadiusToSink;                      // 0x1894(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NativePontoonScaleTimeFront;                       // 0x1898(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NativePontoonScaleRadiusPerTick;                   // 0x189C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NativePontoonScaleTimeRear;                        // 0x18A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NativeBasePontoonRadiusFront;                      // 0x18A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NativeBasePontoonRadiusRear;                       // 0x18A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeDelay;                                         // 0x18AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeDuration;                                      // 0x18B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinBrakeForceForSkid;                              // 0x18B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinForwardSpeedForSkid;                            // 0x18B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpeedLinesCueTag;                                  // 0x18BC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalizedRPM;                                     // 0x18C4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeStartTime;                                     // 0x18C8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18CC[0x4];                                     // 0x18CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnOutOfFuelDelegate;                               // 0x18D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnGainedFuelDelegate;                              // 0x18E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         RechargeableBoostPercent;                          // 0x18F0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoostEndTime;                                      // 0x18F4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSplatterSourceComponent*           SplatterSourceComp;                                // 0x18F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCachedWaterData                       WaterBodyDataCache;                                // 0x1900(0x0038)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EFuelLeakType                                 FuelLeakType;                                      // 0x1938(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableNativizedTick;                              // 0x1939(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_193A[0x6];                                     // 0x193A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PassengerLeanSockets;                              // 0x1940(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FVector>                        PassngerLeanRelativeOffsets;                       // 0x1950(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortCameraMode_AthenaVehicle> PassengerCameraModeClass;                       // 0x1960(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortCameraMode>            PassengerCameraModeClass_ADS;                      // 0x1968(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           WheelSocketNames;                                  // 0x1970(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortDagwoodVehicleConfigs*             FortDagwoodVehicleConfigs;                         // 0x1980(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortDagwoodVehicleConfigs> FortDagwoodConfigsClass;                           // 0x1988(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 RearShocks;                                        // 0x1990(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  OffroadEnvironmentDamageTags;                      // 0x19A0(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  FireDamageTags;                                    // 0x19C0(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FVector                                NativeWheelScaleRear;                              // 0x19E0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                NativeWheelScaleFront;                             // 0x19EC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                NativeTireScaleRear;                               // 0x19F8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                NativeTireScaleFront;                              // 0x1A04(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTireSmokeActive;                                  // 0x1A10(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBoostFailed;                                      // 0x1A11(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanBoostPitch;                                    // 0x1A12(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnRoad;                                           // 0x1A13(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnLandscape;                                      // 0x1A14(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnDirt;                                           // 0x1A15(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnVehicle;                                        // 0x1A16(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWasBrakeSkidding;                                 // 0x1A17(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint64                                        AccelForceFeedbackHandle;                          // 0x1A18(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint64                                        SkidForceFeedbackHandle;                           // 0x1A20(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint64                                        BrakeForceFeedbackHandle;                          // 0x1A28(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint64                                        HandBrakeForceFeedbackHandle;                      // 0x1A30(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<ETireSurfaces>                         TireSurfaces;                                      // 0x1A38(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBoosting;                                         // 0x1A48(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSpeedLinesActive;                                 // 0x1A49(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A4A[0xE];                                     // 0x1A4A(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleRuntimeModifiers               RuntimeModifiedProperties;                         // 0x1A58(0x0048)(Net, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FVector                                FlipYawForwardTargetDirection;                     // 0x1AA0(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FlipYawOriginalForward;                            // 0x1AAC(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETireLocations                                LastPoppedTire;                                    // 0x1AB8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AB9[0x3];                                     // 0x1AB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RoadTopSpeedMultplier;                             // 0x1ABC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentBumpiness;                                  // 0x1AC0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentForwardAcceleration;                        // 0x1AC4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreviousTurnAlpha;                                 // 0x1AC8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentCameraAssistStrength;                       // 0x1ACC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LostGripTime;                                      // 0x1AD0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LostGripRightAlpha;                                // 0x1AD4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HandbrakeTime;                                     // 0x1AD8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RimScrapeDamageTimer;                              // 0x1ADC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FlipYawMult;                                       // 0x1AE0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FlipTimer;                                         // 0x1AE4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FlipExplodeTimer;                                  // 0x1AE8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FlipPushForceTimer;                                // 0x1AEC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FlipAirTimer;                                      // 0x1AF0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FlipLanding;                                       // 0x1AF4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FlipStartTime;                                     // 0x1AF8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LastFlipDamageTime;                                // 0x1AFC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreFlipControlLossTimer;                           // 0x1B00(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LastPopTireTime;                                   // 0x1B04(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HealthZeroTime;                                    // 0x1B08(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativePontoonScaleTimerFront;                      // 0x1B0C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativePontoonScaleTimerRear;                       // 0x1B10(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeScaledFrontPontoonRadius;                    // 0x1B14(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeScaledRearPontoonRadius;                     // 0x1B18(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDidCinematicFlip;                                 // 0x1B1C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanCinematicFlip;                                 // 0x1B1D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInPopTireVeer;                                    // 0x1B1E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInFlipRecovery;                                   // 0x1B1F(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExplodeAfterFlip;                                 // 0x1B20(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLostGrip;                                         // 0x1B21(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyHandBrakeCatchupForce;                       // 0x1B22(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDidHandbrakeCatchup;                              // 0x1B23(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInFlipRoll;                                       // 0x1B24(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInFlipYaw;                                        // 0x1B25(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInFlipPitch;                                      // 0x1B26(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFlipDidLeaveGround;                               // 0x1B27(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBreakBuildingsIfBlockingLeaningPassenger;         // 0x1B28(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B29[0x3];                                     // 0x1B29(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LeanBreakTimeAccumulator;                          // 0x1B2C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LeanBreakCheckInterval;                            // 0x1B30(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              LastStickInput;                                    // 0x1B34(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B3C[0x4];                                     // 0x1B3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SeatToWindowShapeNames;                            // 0x1B40(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMatineeCameraShake*                    OffroadCameraShakeInstance;                        // 0x1B50(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMatineeCameraShake*                    DriverCameraShakeInstance;                         // 0x1B58(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMatineeCameraShake*                    AccelCameraShakeInstance;                          // 0x1B60(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMatineeCameraShake*                    HandBrakeCameraShakeInstance;                      // 0x1B68(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      NativeComp_RoadAndExhaust;                         // 0x1B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      NativeComp_LowFuelSputter;                         // 0x1B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      NativeComp_Damage;                                 // 0x1B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      NativeComp_SpeedLines;                             // 0x1B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         TireExhaustFX;                                     // 0x1B90(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         NativeSys_LowFuelSputter;                          // 0x1B98(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         NativeSys_SpeedLines;                              // 0x1BA0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BA8[0x10];                                    // 0x1BA8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaVehicleFuelComponent*        FuelComponent;                                     // 0x1BB8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BC0[0x8];                                     // 0x1BC0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETireStates>                           TireStates;                                        // 0x1BC8(0x0010)(Net, ZeroConstructor, Transient, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPoppedTireReactionStates                     ActivePoppedTireReaction;                          // 0x1BD8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPoppedTireReactionStates                     ServerPoppedTireReaction;                          // 0x1BD9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bExploded;                                         // 0x1BDA(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1BDB[0x1];                                     // 0x1BDB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ServerCriticalHealth;                              // 0x1BDC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AController>             KillerController;                                  // 0x1BE0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AActor>                  KillerCauser;                                      // 0x1BE8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<class AFortPlayerPawnAthena*>            PlayersBasedOnVehicle;                             // 0x1BF0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C40[0x4];                                     // 0x1C40(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsInoperable;                                     // 0x1C44(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C45[0x3];                                     // 0x1C45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomSeed;                                        // 0x1C48(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRandomStream                          RandStream;                                        // 0x1C4C(0x0008)(ZeroConstructor, Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C54[0x4];                                     // 0x1C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            TireBootMesh;                                      // 0x1C58(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C60[0x30];                                    // 0x1C60(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnBoostFinished();
	void BP_OnBoostStarted();
	void CleanupLoopingPooledFX();
	const struct FVehicleRuntimeModifiers GetCurrentRuntimeProperties();
	void MakeInoperable();
	void MakeOperable(bool bAddGas);
	void NativeOnFuelChanged(float NewFuelPercent, float OldFuelPercent);
	void NativeOnLowFuel();
	void NativeOnOutOfFuel();
	void OnBoostFailed();
	void OnBoostReady();
	void OnClientBeginAltInteract(class AFortPawn* Pawn);
	void OnDestroyedPropFromCollision(const class ABuildingActor* BuildingHitActor);
	void OnEmptyFuel();
	void OnEnteredRoad();
	void OnEnterLandscape();
	void OnExitLandscape();
	void OnExitRoad();
	void OnExplode();
	void OnFireStart();
	void OnFireStop();
	void OnFlipImpactDamage();
	void OnGainedFuel(float NewPercent);
	void OnInoperableChanged(bool bInoperable);
	void OnLeakingFuelStart();
	void OnLeakingFuelStop();
	void OnLowFuel();
	void OnPoppedTire(int32 TireIndex);
	void OnRep_Exploded();
	void OnRep_IsInoperable();
	void OnRep_PoppedTireReaction();
	void OnRep_RandSeed();
	void OnRep_RuntimeModifiers();
	void OnRep_Tires(const TArray<ETireStates>& PrevTireStates);
	void OnRimScrapeDamage(int32 TireIndex);
	void OnServerAltInteract(class AFortPawn* Pawn);
	void OnSpawnLeakProjectile(class AFortProjectileBase* SpawnProjectile);
	void OnStartCriticalHealth();
	void OnStartHandbrake();
	void OnStopHandbrake();
	void OnTickAudioController(float DeltaTime);
	void OnTickAudioFade(float FadeParam);
	void ServerAddRuntimeGearsInfo(const struct FRuntimeGearInfo& GearInfo);
	void ServerSetRuntimeBoostInfo(const struct FRuntimeBoostInfo& BoostInfo);
	void ServerSetRuntimeDriveInfo(float MaxIncline, float MaxTilt);
	void ServerSetRuntimeFuelInfo(const struct FRuntimeFuelInfo& FuelInfo);
	void ServerSetRuntimeGravity(float GravMult);
	void ServerSetRuntimeProperties(const struct FVehicleRuntimeModifiers& RunTimeProps);
	void ServerSetRuntimeSpringsInfo(const struct FRuntimeSpringsInfo& SpringsInfo);
	void SetFuel(float NewFuel);
	void SetNormalizedAudioRPM(float InRPM);
	void SetOnFire(bool bNewFire);
	void StartFade();
	void UpdateVehicleFuelLeak();

	bool AreAnyTiresPopped() const;
	bool ForwardOrReverseInputPressed() const;
	float GetBumpiness() const;
	float GetFuel() const;
	float GetFuelCapacity() const;
	float GetHUDTopSpeed() const;
	float GetNormalizedAudioRPM() const;
	bool GetOnFire() const;
	class FString GetPlayerFacingName() const;
	float GetTireHealthPercent(ETireLocations TireIndex) const;
	bool GetTireState(int32 TireIndex) const;
	ETireSurfaces GetTireSurface(ETireLocations TireIndex) const;
	bool IsInoperable() const;
	bool IsNativeBPTickEnabled() const;
	bool IsOffroad() const;
	bool IsOnDirt() const;
	bool IsOnLandscape() const;
	bool IsOnRoad() const;
	bool IsTireSkidding(const float MinSpeedForSkid, const float AngleForSkid, const float SpeedForPeelout, const float SpeedForBraking) const;
	bool IsVehicleAcceleratingWithSpeedThreshold(float SpeedThreshold) const;
	float NativeCalculateAccelRumbleIntensity(float MaxIntensity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDagwoodVehicle">();
	}
	static class AFortDagwoodVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortDagwoodVehicle>();
	}
};
static_assert(alignof(AFortDagwoodVehicle) == 0x000010, "Wrong alignment on AFortDagwoodVehicle");
static_assert(sizeof(AFortDagwoodVehicle) == 0x001C90, "Wrong size on AFortDagwoodVehicle");
static_assert(offsetof(AFortDagwoodVehicle, HardLandingCameraShake) == 0x001870, "Member 'AFortDagwoodVehicle::HardLandingCameraShake' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, OffroadCamShakeClass) == 0x001878, "Member 'AFortDagwoodVehicle::OffroadCamShakeClass' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, DriverCamShakeClass) == 0x001880, "Member 'AFortDagwoodVehicle::DriverCamShakeClass' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, HandBrakeCamShakeClass) == 0x001888, "Member 'AFortDagwoodVehicle::HandBrakeCamShakeClass' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, VehicleClass) == 0x001890, "Member 'AFortDagwoodVehicle::VehicleClass' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativeMinPontoonRadiusToSink) == 0x001894, "Member 'AFortDagwoodVehicle::NativeMinPontoonRadiusToSink' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativePontoonScaleTimeFront) == 0x001898, "Member 'AFortDagwoodVehicle::NativePontoonScaleTimeFront' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativePontoonScaleRadiusPerTick) == 0x00189C, "Member 'AFortDagwoodVehicle::NativePontoonScaleRadiusPerTick' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativePontoonScaleTimeRear) == 0x0018A0, "Member 'AFortDagwoodVehicle::NativePontoonScaleTimeRear' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativeBasePontoonRadiusFront) == 0x0018A4, "Member 'AFortDagwoodVehicle::NativeBasePontoonRadiusFront' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativeBasePontoonRadiusRear) == 0x0018A8, "Member 'AFortDagwoodVehicle::NativeBasePontoonRadiusRear' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FadeDelay) == 0x0018AC, "Member 'AFortDagwoodVehicle::FadeDelay' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FadeDuration) == 0x0018B0, "Member 'AFortDagwoodVehicle::FadeDuration' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, MinBrakeForceForSkid) == 0x0018B4, "Member 'AFortDagwoodVehicle::MinBrakeForceForSkid' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, MinForwardSpeedForSkid) == 0x0018B8, "Member 'AFortDagwoodVehicle::MinForwardSpeedForSkid' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, SpeedLinesCueTag) == 0x0018BC, "Member 'AFortDagwoodVehicle::SpeedLinesCueTag' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NormalizedRPM) == 0x0018C4, "Member 'AFortDagwoodVehicle::NormalizedRPM' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FadeStartTime) == 0x0018C8, "Member 'AFortDagwoodVehicle::FadeStartTime' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, OnOutOfFuelDelegate) == 0x0018D0, "Member 'AFortDagwoodVehicle::OnOutOfFuelDelegate' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, OnGainedFuelDelegate) == 0x0018E0, "Member 'AFortDagwoodVehicle::OnGainedFuelDelegate' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, RechargeableBoostPercent) == 0x0018F0, "Member 'AFortDagwoodVehicle::RechargeableBoostPercent' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, BoostEndTime) == 0x0018F4, "Member 'AFortDagwoodVehicle::BoostEndTime' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, SplatterSourceComp) == 0x0018F8, "Member 'AFortDagwoodVehicle::SplatterSourceComp' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, WaterBodyDataCache) == 0x001900, "Member 'AFortDagwoodVehicle::WaterBodyDataCache' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FuelLeakType) == 0x001938, "Member 'AFortDagwoodVehicle::FuelLeakType' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bEnableNativizedTick) == 0x001939, "Member 'AFortDagwoodVehicle::bEnableNativizedTick' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, PassengerLeanSockets) == 0x001940, "Member 'AFortDagwoodVehicle::PassengerLeanSockets' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, PassngerLeanRelativeOffsets) == 0x001950, "Member 'AFortDagwoodVehicle::PassngerLeanRelativeOffsets' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, PassengerCameraModeClass) == 0x001960, "Member 'AFortDagwoodVehicle::PassengerCameraModeClass' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, PassengerCameraModeClass_ADS) == 0x001968, "Member 'AFortDagwoodVehicle::PassengerCameraModeClass_ADS' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, WheelSocketNames) == 0x001970, "Member 'AFortDagwoodVehicle::WheelSocketNames' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FortDagwoodVehicleConfigs) == 0x001980, "Member 'AFortDagwoodVehicle::FortDagwoodVehicleConfigs' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FortDagwoodConfigsClass) == 0x001988, "Member 'AFortDagwoodVehicle::FortDagwoodConfigsClass' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, RearShocks) == 0x001990, "Member 'AFortDagwoodVehicle::RearShocks' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, OffroadEnvironmentDamageTags) == 0x0019A0, "Member 'AFortDagwoodVehicle::OffroadEnvironmentDamageTags' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FireDamageTags) == 0x0019C0, "Member 'AFortDagwoodVehicle::FireDamageTags' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativeWheelScaleRear) == 0x0019E0, "Member 'AFortDagwoodVehicle::NativeWheelScaleRear' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativeWheelScaleFront) == 0x0019EC, "Member 'AFortDagwoodVehicle::NativeWheelScaleFront' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativeTireScaleRear) == 0x0019F8, "Member 'AFortDagwoodVehicle::NativeTireScaleRear' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativeTireScaleFront) == 0x001A04, "Member 'AFortDagwoodVehicle::NativeTireScaleFront' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bTireSmokeActive) == 0x001A10, "Member 'AFortDagwoodVehicle::bTireSmokeActive' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bBoostFailed) == 0x001A11, "Member 'AFortDagwoodVehicle::bBoostFailed' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bCanBoostPitch) == 0x001A12, "Member 'AFortDagwoodVehicle::bCanBoostPitch' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bOnRoad) == 0x001A13, "Member 'AFortDagwoodVehicle::bOnRoad' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bOnLandscape) == 0x001A14, "Member 'AFortDagwoodVehicle::bOnLandscape' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bOnDirt) == 0x001A15, "Member 'AFortDagwoodVehicle::bOnDirt' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bOnVehicle) == 0x001A16, "Member 'AFortDagwoodVehicle::bOnVehicle' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bWasBrakeSkidding) == 0x001A17, "Member 'AFortDagwoodVehicle::bWasBrakeSkidding' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, AccelForceFeedbackHandle) == 0x001A18, "Member 'AFortDagwoodVehicle::AccelForceFeedbackHandle' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, SkidForceFeedbackHandle) == 0x001A20, "Member 'AFortDagwoodVehicle::SkidForceFeedbackHandle' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, BrakeForceFeedbackHandle) == 0x001A28, "Member 'AFortDagwoodVehicle::BrakeForceFeedbackHandle' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, HandBrakeForceFeedbackHandle) == 0x001A30, "Member 'AFortDagwoodVehicle::HandBrakeForceFeedbackHandle' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, TireSurfaces) == 0x001A38, "Member 'AFortDagwoodVehicle::TireSurfaces' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bBoosting) == 0x001A48, "Member 'AFortDagwoodVehicle::bBoosting' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bSpeedLinesActive) == 0x001A49, "Member 'AFortDagwoodVehicle::bSpeedLinesActive' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, RuntimeModifiedProperties) == 0x001A58, "Member 'AFortDagwoodVehicle::RuntimeModifiedProperties' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FlipYawForwardTargetDirection) == 0x001AA0, "Member 'AFortDagwoodVehicle::FlipYawForwardTargetDirection' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FlipYawOriginalForward) == 0x001AAC, "Member 'AFortDagwoodVehicle::FlipYawOriginalForward' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, LastPoppedTire) == 0x001AB8, "Member 'AFortDagwoodVehicle::LastPoppedTire' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, RoadTopSpeedMultplier) == 0x001ABC, "Member 'AFortDagwoodVehicle::RoadTopSpeedMultplier' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, CurrentBumpiness) == 0x001AC0, "Member 'AFortDagwoodVehicle::CurrentBumpiness' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, CurrentForwardAcceleration) == 0x001AC4, "Member 'AFortDagwoodVehicle::CurrentForwardAcceleration' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, PreviousTurnAlpha) == 0x001AC8, "Member 'AFortDagwoodVehicle::PreviousTurnAlpha' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, CurrentCameraAssistStrength) == 0x001ACC, "Member 'AFortDagwoodVehicle::CurrentCameraAssistStrength' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, LostGripTime) == 0x001AD0, "Member 'AFortDagwoodVehicle::LostGripTime' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, LostGripRightAlpha) == 0x001AD4, "Member 'AFortDagwoodVehicle::LostGripRightAlpha' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, HandbrakeTime) == 0x001AD8, "Member 'AFortDagwoodVehicle::HandbrakeTime' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, RimScrapeDamageTimer) == 0x001ADC, "Member 'AFortDagwoodVehicle::RimScrapeDamageTimer' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FlipYawMult) == 0x001AE0, "Member 'AFortDagwoodVehicle::FlipYawMult' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FlipTimer) == 0x001AE4, "Member 'AFortDagwoodVehicle::FlipTimer' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FlipExplodeTimer) == 0x001AE8, "Member 'AFortDagwoodVehicle::FlipExplodeTimer' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FlipPushForceTimer) == 0x001AEC, "Member 'AFortDagwoodVehicle::FlipPushForceTimer' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FlipAirTimer) == 0x001AF0, "Member 'AFortDagwoodVehicle::FlipAirTimer' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FlipLanding) == 0x001AF4, "Member 'AFortDagwoodVehicle::FlipLanding' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, FlipStartTime) == 0x001AF8, "Member 'AFortDagwoodVehicle::FlipStartTime' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, LastFlipDamageTime) == 0x001AFC, "Member 'AFortDagwoodVehicle::LastFlipDamageTime' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, PreFlipControlLossTimer) == 0x001B00, "Member 'AFortDagwoodVehicle::PreFlipControlLossTimer' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, LastPopTireTime) == 0x001B04, "Member 'AFortDagwoodVehicle::LastPopTireTime' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, HealthZeroTime) == 0x001B08, "Member 'AFortDagwoodVehicle::HealthZeroTime' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativePontoonScaleTimerFront) == 0x001B0C, "Member 'AFortDagwoodVehicle::NativePontoonScaleTimerFront' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativePontoonScaleTimerRear) == 0x001B10, "Member 'AFortDagwoodVehicle::NativePontoonScaleTimerRear' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativeScaledFrontPontoonRadius) == 0x001B14, "Member 'AFortDagwoodVehicle::NativeScaledFrontPontoonRadius' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, NativeScaledRearPontoonRadius) == 0x001B18, "Member 'AFortDagwoodVehicle::NativeScaledRearPontoonRadius' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bDidCinematicFlip) == 0x001B1C, "Member 'AFortDagwoodVehicle::bDidCinematicFlip' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bCanCinematicFlip) == 0x001B1D, "Member 'AFortDagwoodVehicle::bCanCinematicFlip' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bInPopTireVeer) == 0x001B1E, "Member 'AFortDagwoodVehicle::bInPopTireVeer' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bInFlipRecovery) == 0x001B1F, "Member 'AFortDagwoodVehicle::bInFlipRecovery' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bExplodeAfterFlip) == 0x001B20, "Member 'AFortDagwoodVehicle::bExplodeAfterFlip' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bLostGrip) == 0x001B21, "Member 'AFortDagwoodVehicle::bLostGrip' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bApplyHandBrakeCatchupForce) == 0x001B22, "Member 'AFortDagwoodVehicle::bApplyHandBrakeCatchupForce' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bDidHandbrakeCatchup) == 0x001B23, "Member 'AFortDagwoodVehicle::bDidHandbrakeCatchup' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bInFlipRoll) == 0x001B24, "Member 'AFortDagwoodVehicle::bInFlipRoll' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bInFlipYaw) == 0x001B25, "Member 'AFortDagwoodVehicle::bInFlipYaw' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bInFlipPitch) == 0x001B26, "Member 'AFortDagwoodVehicle::bInFlipPitch' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bFlipDidLeaveGround) == 0x001B27, "Member 'AFortDagwoodVehicle::bFlipDidLeaveGround' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, bBreakBuildingsIfBlockingLeaningPassenger) == 0x001B28, "Member 'AFortDagwoodVehicle::bBreakBuildingsIfBlockingLeaningPassenger' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, LeanBreakTimeAccumulator) == 0x001B2C, "Member 'AFortDagwoodVehicle::LeanBreakTimeAccumulator' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, LeanBreakCheckInterval) == 0x001B30, "Member 'AFortDagwoodVehicle::LeanBreakCheckInterval' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, LastStickInput) == 0x001B34, "Member 'AFortDagwoodVehicle::LastStickInput' has a wrong offset!");
static_assert(offsetof(AFortDagwoodVehicle, SeatToWindowShapeNames) == 0x001B40, "Member 'AFortDagwoodVehicle::SeatToWindowShapeNames' has a wrong offset!");
